{"62":{"name":"Kyle Rankin","title":"Chief Security Officer","organization":"Purism","photo":{"alt":null,"height":"239","width":"247","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/headshot2.jpg"},"biography":"Kyle Rankin is Chief Security Officer at Purism; the author of Linux Hardening in Hostile Networks, DevOps Troubleshooting, The Official Ubuntu Server Book, and Knoppix Hacks, among other books. Rankin was an award-winning columnist and tech editor for Linux Journal, and speaks frequently on Open Source software including at SCALE, FOSDEM, O'Reilly Security Conference, Linux Fest NorthWest, BSidesLV, CactusCon, OSCON, Linux World Expo, and Penguicon.","website":{"name":"My Personal Site","url":"https://kylerank.in"}},"259":{"name":"Dave Stokes","title":"Technology Evangelist","organization":"Percona","photo":{"alt":null,"height":"2016","width":"1134","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/davestokes1.jpg"},"biography":"Dave Stokes is a technology evangelist for Percona Corporation.  He has worked at companies ranging alphabetically from the American Heart Association to Xerox, has three college degrees, enjoys riding his Honda Goldwing motorcycle, lives in North Texas, and started with UNIX in the Version 7 days.  He is the author of MySQL & JSON - A Practical Programming Guide, which is available at Amazon.com","website":{"name":"Percona","url":"https://percona.com"}},"317":{"name":"Jorge Castro","title":"Community Manager","organization":"Stacklet","photo":{"alt":null,"height":"4320","width":"2868","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/3114732869_81c9220ffe_o.jpg"},"biography":"Jorge Castro is a community manager, specializing in Open Source. He is basically a cat herder - a combination of engineering, developer relations, and user advocacy.  Jorge graduated with a degree in Telecommunications from Michigan State University and rode with the 11th Armored Cavalry Regiment for four years. He first entered the technology field at SAIC and then moved to system administration at the School of Engineering and Computer Science at Oakland University in Rochester Hills, Michigan. Jorge then joined Canonical to work on Ubuntu for about 10 years before moving to Heptio and VMware to work on Kubernetes.  He's currently at Stacklet working on the Cloud Custodian project. He now resides in Ann Arbor, Michigan with his lovely wife Jill, their son Rafael, and their beagle Oscar.  Hobbies and interests include renewing his passport, heavy metal, paleontology, gaming, helping run the Orchestructure meetup, technology, and scouting out the best beers in the world.","website":{"name":"My blog","url":"http://www.jorgecastro.org"}},"386":{"name":"Dawn Foster","title":"Director Open Source Community Strategy","organization":"VMware","photo":{"alt":null,"height":"1320","width":"1150","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/dawn_May_2021_sq.jpg"},"biography":"Dawn is Director of Open Source Community Strategy within VMware’s Open Source Program Office. She is on the board of OpenUK, an organization committed to UK leadership in Open Technology. Dawn is involved in several LF projects as a Governing Board member and maintainer for the CHAOSS metrics project and as an elected Steering Committee member for the TODO Group. She has 20+ years of experience at companies like Intel and Puppet with expertise in community building, strategy, open source software, metrics, and more. Dawn holds a PhD along with an MBA and a BS in Computer Science. She has spoken at dozens of industry events, including many Linux Foundation events, OSCON, SXSW, FOSDEM and more. In her spare time she enjoys reading science fiction, running, and traveling.","website":{"name":"Fast Wonder","url":"http://fastwonderblog.com/"}},"408":{"name":"Kohsuke Kawaguchi","title":"Creator","organization":"Jenkins project","photo":{"alt":null,"height":"174","width":"150","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/self_0.jpeg"},"biography":"Kohsuke is the creator of Hudson, later renamed Jenkins. He wrote the majority of the Hudson/Jenkins core single-handedly. Kohsuke has more than 10 years of extensive software development experience, ranging from Java to C++, .NET to x64 assembly, as well as systems expertise on several platforms, including Windows, Linux and Solaris. This broad range of experience was a key enabler in the development of various advanced features of Jenkins. Kohsuke is now an architect at CloudBees and an active member of the Jenkins project.","website":{"name":"Jenkins","url":"http://jenkins.io/"}},"435":{"name":"Bruce Momjian","title":"Vice President, Postgres Evangelist","organization":"EDB","photo":{"alt":null,"height":"932","width":"932","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/buddy_icon.jpg"},"biography":"Bruce Momjian is co-founder and core team member of the PostgreSQL Global Development Group, and has worked on PostgreSQL since 1996. He has been employed by EDB since 2006. He has spoken at many international open-source conferences and is the author of PostgreSQL: Introduction and Concepts, published by Addison-Wesley. Prior to his involvement with PostgreSQL, Bruce worked as a consultant, developing custom database applications for some of the world's largest law firms. As an academic, Bruce holds a Masters in Education, an honorary doctorate, was a high school computer science teacher, and lectures internationally.","website":{"name":"My Homepage","url":"https://momjian.us"}},"448":{"name":"Alyssa Tong","title":"Community Programs","organization":"Cloudbees","photo":{"alt":null,"height":"1061","width":"1178","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/IMG_8637.jpg"},"biography":"Alyssa Tong is a long-time Jenkins contributor. Currently, she is a member of the . She drives and manages Jenkins participation in community events and conferences like Google Summer of Code, , , DevOps World, and . She is also responsible for Community Programs at \n \n \n \n \n \n Jenkins Advocacy and Outreach SIG FOSDEM SCaLE KubeCon CloudBees, Inc.","website":null},"461":{"name":"Karsten Wade","title":"Sr. Community Architect","organization":"Red Hat","photo":{"alt":null,"height":"1536","width":"2048","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/headshot-Karsten-Wade-the-Venetian.jpg"},"biography":"Since 2000 Karsten has been teaching and living the open source way (). As a member of Red Hat's Open Source and Standards team ( ), he helps with community activities in projects Red Hat is involved in. As a 22 year IT industry veteran, Karsten has worked most sides of common business equations as an IS manager, professional services consultant, technical writer, developer advocate, and open source specialist. He blogs at  and as @quaid on various platforms.\n \n \n \n http://TheOpensourceWay.org http://community.redhat.com http://iquaid.org \n    Karsten lives in his hometown of Santa Cruz, CA with his wife and two daughters on their small urban farm, Fairy-Tale Farm (), where they focus on growing their own food and nurturing sustainable community living. In recent years, his lifelong interest in sustainable transportation lead him to help open and operate Santa Cruz Pedicab ().\n \n \n http://Fairy-TaleFarm.com http://santacruzpedicab.com","website":{"name":"i,   quaid","url":"http://iquaid.org"}},"477":{"name":"Federico Lucifredi","title":"Product Management Director","organization":"Red Hat","photo":{"alt":null,"height":"1152","width":"946","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/F2%20Hedcut%20by%20Kevin%20Sprouls%20.jpg"},"biography":"Federico Lucifredi is the Product Management Director for Ceph Storage at Red Hat and a co-author of O'Reilly's \"Peccary Book\" on AWS System Administration. Previously, he was the Ubuntu Server product manager at Canonical, where he oversaw a broad portfolio and the rise of Ubuntu Server to the rank of most popular OS on Amazon AWS. A software engineer-turned-manager at the Novell corporation, he was part of the SUSE Linux team, overseeing the update lifecycle and delivery stack of a $150 million maintenance business. A CIO and a network software architect at advanced technology and embedded Linux startups, Federico was also a lecturer for over 200 students in Boston University's graduate and undergraduate programs, and simultaneously a consultant for MIT implementing fluid-dynamics simulations in Java.","website":null},"929":{"name":"Christophe Pettus","title":"CEO","organization":"PostgreSQL Experts, Inc.","photo":{"alt":null,"height":"1377","width":"1377","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/xof%20square_0.jpg"},"biography":"Christophe has been working with PostgreSQL since 1997. He is the CEO of PostgreSQL Experts, Inc.","website":{"name":"The Build","url":"http://thebuild.com"}},"3655":{"name":"Raghavan Srinivas","title":null,"organization":null,"photo":null,"biography":"Raghavan \"Rags\" Srinivas works as a OpenStack advocate and solutions architect at Rackspace where he finds himself constantly challenged from low level networking to high level application issues. His general focus area is in distributed systems, with a specialization in Cloud Computing and Big Data. He worked on Hadoop, HBase and NoSQL during its early stages. Rags brings with him over 20 years of hands-on software development and over 10 years of architecture and technology evangelism experience. He has evangelized and influenced the architecture of a number of technology areas. He is also a repeat JavaOne rock star speaker award winner. \n    Rags holds a Masters degree in Computer Science from the Center of Advanced Computer\nStudies at the University of Louisiana at Lafayette. He likes to hike, run and generally be outdoors but most of all he loves to eat.","website":null},"3677":{"name":"Stephen Frost","title":"Chief Technology Officer","organization":"Crunchy Data","photo":{"alt":null,"height":"216","width":"324","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/me_7.jpg"},"biography":"Stephen Frost is a PostgreSQL Major Contributor and Committer who implemented the PostgreSQL role system and column-level privileges, and who has made contributions to PL/PgSQL, PostGIS, the Linux kernel, and Debian. He has broad experience with the PostgreSQL authentication and authorization system, Multi-Version Concurrent-Control (MVCC), performance tuning (both system-wide and for specific queries), hacking on PostgreSQL itself, the PostgreSQL community, and PostGIS.","website":{"name":"Crunchy Data","url":"http://crunchydata.com"}},"3694":{"name":"Subash DSouza","title":"Director, Cloud Data Engineering","organization":"California State University, Office of the Chancellor","photo":{"alt":null,"height":"650","width":"650","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/SubashHeadshot.jpg"},"biography":"Subash D’Souza works at the cross-section of open data, and education. He is the Founder of Data Con LA, the largest independent data conference in the SoCal region. He is also the founder of Data 4 Good, a public-private nonprofit think tank created to work with various organizations using data to tackle social problems working on issues ranging from homelessness to digital equity technology innovation, data and analytics, and public-private partnerships. He is currently the Director for Cloud Data Engineering at California State University, Office of the Chancellor where he reports to senior leadership providing guidance and feedback on using modern cloud tech and data skills to usher CSU into the digital age. He was previously the Head of Data Engineering at Headspace where he worked on solving data challenges. Prior to that he was the Director for Big Data & Ops at Warner Bros leveraging his skillsets to build best practices and scale data pipelines.","website":null},"4034":{"name":"Frank Karlitschek","title":"CEO / Founder","organization":"Nextcloud","photo":{"alt":null,"height":"1000","width":"1000","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/Frank%20Karlitschek-small.jpg"},"biography":"Frank Karlitschek is a long time open source developer and former board member of the KDE e.V. In 2016 he founded Nextcloud to create a fully open source and decentralized alternative to big centralized US cloud companies. In 2012 he initiated the User Data Manifesto to define basic human rights regarding personal data. Frank was an invited expert at the W3C to help to create the ActivityPub internet standard. Frank has spoken at MIT, CERN, Harvard and ETH and keynoted several conferences. Frank is the founder and CEO of Nextcloud GmbH. He is also a fellow of Open Forum Europe and an advisor to the United Nations regarding Intellectual Property and Open Source","website":{"name":"https://nextcloud.com","url":"https://nextcloud.com"}},"4063":{"name":"Alison Chaiken","title":null,"organization":null,"photo":{"alt":null,"height":"298","width":"301","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/OggCamp_headshot.jpg"},"biography":"Alison is been an automotive systems programmer and kernel engineer and has worked at Nokia, Mentor Graphics, and Peloton Technology. In 2014-2015, she collaborated on-site with a customer in Germany. Alison has spoken at events including ELC and ELCE, USENIX, LibrePlanet, linux.conf.au, Automotive Linux Summit, SCALE and Maker Faire. She organizes the monthly meetings of the 2800+-member, 7-year-old Silicon Valley Automotive Open Source Group (). She lives in Mountain View , CA where she rides bikes, drinks beer and studies German.\n \n https://www.meetup.com/Silicon-Valley-Automotive-Open-Source/","website":{"name":"she-devel.com","url":"http://she-devel.com/"}},"4087":{"name":"Brian Proffitt","title":"Principal Community Analyst","organization":"Red Hat","photo":{"alt":null,"height":"960","width":"960","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/proffitt.jpg"},"biography":"Brian Proffitt is currently Principal Community Analyst for Red Hat's Open Source and Standards team. A long-time member of the free and open source software community, Brian is the author of several books on Linux, iOS, and other odd operating systems, as well as former technology journalist from ReadWrite, ITworld, LinuxPlanet, and Linux Today.","website":{"name":"Red Hat Community ","url":"http://community.redhat.com"}},"4106":{"name":"Jeff Gehlbach","title":"Technical Product Manager","organization":"The OpenNMS Group","photo":{"alt":null,"height":"2096","width":"1397","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/jeffG_headshot_epic_small.jpg"},"biography":"Jeff has worked with free software since the mid-1990s and has practiced the discipline of large-scale network management since 2000. His current role as Principal Technical Product Manager at The OpenNMS Group lets him continue both these pursuits.","website":null},"4286":{"name":"Daniel Walsh","title":"Consulting Engineer","organization":"Red Hat","photo":{"alt":null,"height":"512","width":"512","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/dwalsh-ireland.jpg"},"biography":"Daniel Walsh has worked in the computer security field for over 35 years. Dan is a Consulting Engineer at Red Hat. He joined Red Hat in August 2001. Dan leads the Red Hat Container Engineering team since August 2013, but has been working on container technology for several years. Dan currently focusess on the CRI-O Container Runtime, Buildah for building container images, containers/storage and containers/image. Dan has made many contributions to the Docker project. Dan has also developed a lot of the software on Project Atomic. He has led the SELinux project, concentrating on the application space and policy development. Dan helped developed sVirt, Secure Virtualization as well as the SELinux Sandbox back in RHEL6 an early desktop container tool. Previously, Dan worked Netect/Bindview's on Vulnerability Assessment Products and at Digital Equipment Corporation working on the Athena Project, AltaVista Firewall/Tunnel (VPN) Products. Dan has a BA in Mathematics from the College of the Ho","website":{"name":"Senior Distinquished Software Engineer","url":"http://danwalsh.livejournal.com"}},"4882":{"name":"Julie Gunderson","title":"Sr. Reliability Advocate","organization":"Gremlin","photo":{"alt":null,"height":"2406","width":"2205","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/IMG_4999.jpg"},"biography":"Julie Gunderson is a Sr. Reliability Advocate at Gremlin, where she works to further the adoption of Chaos Engineering principles and methodologies. Over the last seven years, Julie has been actively involved in the DevOps space and is passionate about helping individuals, teams, and organizations understand how to leverage best practices and develop amazing cultures. Julie is also a founding member of DevOpsDays Boise, which recently celebrated its 4th year. When Julie isn’t working, she is most likely making jewelry out of circuit boards, or traipsing around the mountains in Idaho.","website":{"name":"Sr. Reliability Advocate","url":"https://www.linkedin.com/in/juliegunderson/"}},"4903":{"name":"Eduardo Silva","title":"Co-Founder","organization":"Calyptia","photo":{"alt":null,"height":"400","width":"400","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/eduardo.jpeg"},"biography":"Eduardo is an entrepreneur and software engineer. He is currently one of the Fluentd project maintainers and creator of Fluent Bit, a lightweight Logs and Metrics processor. He also is the founder of Calyptia (the Fluent company).","website":{"name":"Personal Blog","url":"http://edsiper.linuxchile.cl"}},"4942":{"name":"Duane O'Brien","title":"Head of Open Source","organization":"Indeed, Inc","photo":{"alt":null,"height":"800","width":"800","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/Duane-Headshot-Small-2019.jpg"},"biography":"Duane O’Brien is the Head of Open Source at , the world’s #1 jobs site. He is passionate about helping companies responsibly participate in the open source community. He is the creator of the , a program that enables open source contributors to direct financial support to free and open source software used by their employers.\n \n \n Indeed.com FOSS Contributor Fund","website":null},"5140":{"name":"Josh Berkus","title":"Kubernetes Community","organization":"Red Hat Inc.","photo":{"alt":null,"height":"480","width":"505","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/headshot_new_small_0.jpg"},"biography":"Josh Berkus spends his time messing around with containers, automation, and community-building for Red Hat Inc.  Prior to that, he spent nearly two decades working on PostgreSQL.  From his home in Portland, he cooks, makes pottery, and looks after a cat.","website":{"name":"Kubernetes","url":"https://kubernetes.io"}},"5186":{"name":"Joe Smith","title":"Infrastructure Engineer","organization":"Neuralink, Inc","photo":{"alt":null,"height":"1014","width":"1014","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/E84567CC-0FFD-41A2-824F-0C9F08976AC3.jpeg"},"biography":"I'm a software engineer on the Infrastructure team at Neuralink. We're building a medical device to help folks with spinal cord injuries control their computer with their thoughts alone. I love working on tough distributed systems problems, and learning from my team and the community! I have been a fond user and contributor to Open Source for over 15 years, with no plans on stopping anytime soon. \n    Previously, I was the Site Reliability Engineering tech lead at Slack, the / SRE Tech Lead at Twitter, and an Internal Technology Resident at Google. I received a Computer Science BS in May 2010 from Chapman University in Orange, California.\n \n \n Mesos Aurora","website":{"name":"Homepage","url":"https://bjoli.com"}},"5403":{"name":"Sriram Ramkrishna","title":"Principal Ecosystems Engineer","organization":"Sesame by ITRenew Inc","photo":{"alt":null,"height":"1944","width":"2592","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/IMG_20180304_171556821.jpg"},"biography":"Sriram Ramkrishna spent over 22 years working in open source communities building coalitions to solve problems, working as a connector between projects and help supporting open source communities. Sri uses his background in his role as Principal Ecosystems Engineer for ITRenew/Sesame in corporate open source communities like the Open Compute Project, CNCF, and the Linux Foundation.","website":null},"5432":{"name":"Mark Waite","title":"Technical Evangelist","organization":"CloudBees, Inc.","photo":{"alt":null,"height":"2350","width":"2142","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/MarkEWaite-2019_0.jpg"},"biography":"Mark Waite is a long-time Jenkins contributor. He is the Jenkins Documentation Officer and leads the Jenkins Documentation Special Interest Group.  He is one of the maintainers of the Jenkins git plugin and the Jenkins git client plugin.  He's active in the Jenkins Platform Special Interest Group.  He's fascinated by software development and especially interested in software testing.","website":{"name":"Mark Waite's Blog","url":"http://markwaite.blogspot.com/"}},"5455":{"name":"Alexander Rubin","title":"Sr Database Engineer","organization":"Amazon Web Services","photo":{"alt":null,"height":"265","width":"265","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/alexander_rubin.png"},"biography":"Alexander is a Sr Database Engineer at Amazon Web Services (AWS), leading RDS security team. Alexander worked with MySQL since 2000 as DBA and Application Developer. Alexander was working as MySQL principal consultant/architect for over 15 years, started with MySQL AB in 2006 (company behind MySQL database), Sun Microsystems, Oracle and then Percona. He helped many customers design large, scalable and highly available MySQL systems, optimize MySQL performance and improve MySQL security.","website":null},"5501":{"name":"Robert Treat","title":"@robtreat2","organization":"https://xzilla.net","photo":null,"biography":"Working on database-backed, internet-based systems for over a decade, Robert is a published author and long-time open source contributor, having been recognized as a major contributor to the PostgreSQL project for his work over the years. An international speaker on databases, open source, and managing web operations at scale, he occasionally blogs at \n \n https://xzilla.net.","website":null},"5533":{"name":"Mark Roden","title":"VP, Data","organization":"Crexi","photo":{"alt":null,"height":"1288","width":"1257","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/Mark%20Roden%281%29.jpg"},"biography":"Mark Roden is VP of Data at Crexi, a commercial real estate company dedicated to connecting brokers and investors.  He is also the CEO of Tetra Bio Distributed, a non-profit dedicated to the design and creation of open source medical hardware.  Tetra was founded within a few months of the outbreak of COVID-19, and our devices center around making medical devices more accessible to makers and anyone interested in medical technology.","website":null},"5545":{"name":"Guinevere Saenger","title":"Software Engineer","organization":"Samsung SDSA","photo":{"alt":null,"height":"1668","width":"1583","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/guin_portrait.png"},"biography":"In 2016, Guinevere Saenger transitioned from being a full-time professional pianist to a career in tech. To do so, she obtained a spot at the highly competitive Ada Developers Academy in Seattle, a year-long, tuition-free, bootcamp-style software development training program for women and nonbinary people making a mid-life career switch into tech. As part of her training, Guinevere interned at Samsung SDS on the Cloud Native Computing Team, where, after graduating in July 2017, she accepted a full-time software engineer position working on Kubernetes deployment tools such as Kraken. Making her home in the beautiful Pacific Northwest, Guinevere enjoys music, food, and the outdoors.","website":{"name":"https://guincodes.blogspot.com/","url":"https://guincodes.blogspot.com/"}},"5547":{"name":"Matty Stratton","title":"Staff Developer Advocate","organization":"Pulumi","photo":{"alt":null,"height":"2048","width":"1536","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/4A3D9F26-8C8C-412B-8CD6-DBC67553BB8C.jpeg"},"biography":"Matty Stratton is a Staff Developer Advocate at Pulumi, founder and co-host of the popular Arrested DevOps podcast, and the global chair of the DevOpsDays set of conferences. Matty has over 20 years of experience in IT operations and is a sought-after speaker internationally, presenting at Agile, DevOps, and cloud engineering focused events worldwide. Demonstrating his keen insight into the changing landscape of technology, he recently changed his license plate from DEVOPS to KUBECTL. He lives in Chicago and has three awesome kids, whom he loves just a little bit more than he loves Diet Coke. Matty is the keeper of the Thought Leaderboard for the DevOps Party Games online game show and you can find him on Twitter at @mattstratton.","website":{"name":"Arrested DevOps","url":"https://www.arresteddevops.com"}},"5621":{"name":"Michelle Brenner","title":"Senior Software Engineer","organization":"Netflix","photo":{"alt":null,"height":"508","width":"720","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/michelle_brenner_kcdc_headshot.jpg"},"biography":"Michelle (she/her) is a Senior Software Engineer with 11 years of experience. She started in engineering support and now leads large-scale development projects. A Philadelphia native that currently calls Los Angeles home, she is an art school graduate and a self-taught engineer. During her career, she has enjoyed creating software to help others succeed, from artists to restaurateurs to fellow engineers. She uses her experience to advise entrepreneurs on topics from technical to team building. Michelle shares her engineering travails and passion for DEI through conference speaking and publishing articles, with the hope others can learn from her challenges.","website":{"name":"http://michellebrenner.com","url":"http://michellebrenner.com"}},"5622":{"name":"Michal Hrusecky","title":"Technical Lead","organization":"Turris","photo":{"alt":null,"height":"600","width":"600","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/ja.jpg"},"biography":"Developer for most of his life and open source enthusiast and advocate for big part of it. Over the time involved in openSUSE and Gentoo communities, activelly participating on various local events and even cofounded the biggest opensource conference in Czech republic. Started his profesional career at SUSE and during whole his career worked on open source projects. Interest in various hardware gadgets brought him to his current job where he is leading a team of amazing people making open source, high performance and secure Wi-Fi routers called Turris.","website":null},"5631":{"name":"Ell Marquez","title":"Security Advocate","organization":"Ell Marquez","photo":{"alt":null,"height":"2048","width":"1536","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/Ell.jpg"},"biography":"Ell Marquez is a proud advocate of Hacking Is Not and Crime and Operation Safe escape. She has traveled the world for five years, educating security practitioners on subjects from on-prem infrastructure to the cloud and everything in between. As part of her journey in 2022, Ell transitioned to GRIMM with the focus on researching and training organizations on strengthening their defenses against the latest cyber threats.","website":{"name":"Ell's website","url":"http://ellopunk.com"}},"5640":{"name":"Steven Rostedt","title":"Software Engineer","organization":"Google","photo":{"alt":null,"height":"1080","width":"1080","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/face.jpg"},"biography":"Steven started working on the Linux kernel in 1998, and become a professional (paid) kernel developer in 2001. He's one of the original authors of the PREEMPT_RT patch, that turns Linux into a hard real-time OS, and is also the original creator and current maintainer of Ftrace, the official tracer of the Linux kernel. Steven is still very active in developing new features for Linux as well as getting involved in the community. Steven has given over 80 talks around the world, has been on various conference program committees and currently sits on the Linux Foundation's Technical Advisory Board (TAB).","website":{"name":"Linux Kernel","url":"http://www.kernel.org"}},"5691":{"name":"JJ Asghar","title":"Developer Advocate","organization":"IBM","photo":{"alt":null,"height":"200","width":"200","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/810824.jpeg"},"biography":"JJ works at IBM on the IBM cloud as a Developer Advocate. He’s focusing on the IBM Kubernetes Service trying to make companies and users have a successful on boarding to the Cloud Native ecosystem. He lives and grew up in Austin, Texas. He enjoys a good strong stout, hoppy IPA, and some team building Artemis, madding Dwarf Fortress or Rimworld or possibly pair programming cluster Factorio. He’s a member of the Church of Emacs, though jumps into Vim on remote machines. He usually chooses Ubuntu over CentOS, but secretly wants FreeBSD everywhere. He’s always trying to become a better Ruby developer, but flirts with Go, Rust, and only when he has to, Node. A father and husband, if he’s not trying to automate his job away he’s always to convince his daughters to “be button makers not button pushers.”","website":{"name":"https://jjasghar.github.io","url":"https://jjasghar.github.io"}},"5701":{"name":"Robert Hernandez","title":"CTO","organization":"Nebulaworks","photo":{"alt":null,"height":"400","width":"400","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/profile-400.jpg"},"biography":"Rob Hernandez is the CTO at Nebulaworks, where he is responsible for defining the development principles and processes to deliver unbiased strategic solutions to client business outcomes.Rob received his B.S. in Computer Information Systems from Chapman University. In his free time, he is a volunteer for the open source community-run conference: . If he’s not contributing to open source projects, you can catch him participating in sailing races around California.\n \n \n \n \n \n Southern California Linux Expo","website":{"name":"Nebulaworks","url":"https://nebulaworks.com"}},"5721":{"name":"Jennifer Scheuerell","title":"Senior Data Systems Consultant","organization":"Sound Data","photo":{"alt":null,"height":"524","width":"551","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/Screen%20Shot%202018-10-31%20at%202.23.56%20PM.png"},"biography":"Jennifer started Sound Data in 2008 after ten years building research databases at the University of Washington. She has built a wide variety of data systems for clients in science and engineering. She holds a MS from the University of Washington and is a certified Oracle Applications Developer.","website":{"name":"Sound Data","url":"http://sound-data.com"}},"5732":{"name":"Brian Scott","title":"Manager, Systems Reliability Engineering ","organization":"The Walt Disney Company","photo":{"alt":null,"height":"400","width":"400","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/brian-scott.jpg"},"biography":"Brian Scott is an Manager of Systems Reliability Engineering at The Walt Disney Company, focusing on Customer SRE, Public Cloud, Automation, and promoting SRE best practices across the Enterprise. Supporting small and large applications in the cloud across all Disney segments. Has a strong passion for Golang and containerization and bringing the best experience to Disney’s guests.","website":{"name":"Disney","url":"http://Disney.com"}},"5748":{"name":"Sean Marquez","title":"Technical Writer","organization":"Tetra Bio Distributed","photo":{"alt":null,"height":"333","width":"333","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/AAIA_wDGAAAAAQAAAAAAAAzgAAAAJDg3MTY2YTMwLTA5YmEtNDQzZi1hMTIxLTNjODdlOGNkMzJhYw_0.jpg"},"biography":"Advocate for distributed open-source hardware. Experience in software engineering, data science, open source, agile methodologies, DevOps, configuration management, technical writing & documentation, and model-based systems engineering.","website":null},"5771":{"name":"Jonathan Katz","title":"VP, Platform Engineering","organization":"Crunchy Data","photo":{"alt":null,"height":"128","width":"114","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/headshot17.jpg"},"biography":"Jonathan Katz is the VP of Platform Engineering at Crunchy Data, focused on managing PGO, an open source Postgres Operator behind Crunchy Postgres for Kubernetes. Jonathan is on the PostgreSQL Core Team and is involved in various governance aspects of the PostgreSQL Global Development Group. He is a Secretary and Director of the PostgreSQL Community Association of Canada NPO and is a Director of the United States PostgreSQL Association NPO. He speaks at conferences around the world on both app developer and operations topics on PostgreSQL and associated technologies like Kubernetes. Prior to Crunchy Data, Jonathan was CTO at VenueBook and before that, VP of Technology at Paperless Post.  Jonathan graduated from Tufts University with a B.S. in Computer Science and a B.A. in Mathematics.","website":{"name":"Crunchy Data","url":"https://www.crunchydata.com"}},"5786":{"name":"Patrick Swartz","title":"Solution Engineer","organization":"SUSE","photo":{"alt":null,"height":"374","width":"290","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/PSwartz_profile_pic.jpg"},"biography":"Patrick Swartz has been a Linux and opensource advocate since the mid-1990s working with start-ups to Fortune 100 companies to develop opensource strategies.  As a father of 8 kids he continually looks for ways to engage his kids in the opensource world.","website":null},"5790":{"name":"Roller Angel","title":"Helpdesk Technician / GLOBE Community Support","organization":"UCAR (University Corporation for Atmospheric Research) / The GLOBE Program","photo":{"alt":null,"height":"411","width":"425","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/Roller-Headshot-2019.png"},"biography":"Roller works at UCAR (University Corporation for Atmospheric Research) on The GLOBE Program as part of the GLOBE Community Support Team. He prefers to  use FreeBSD on his work laptop, which helps him do his job with ease. He spends most of his time helping people learn how to accomplish their goals using technology. He is an avid BSD user and Pythonista who enjoys learning all the amazing things he can do with BSD and Python to solve issues. He is a firm believer that one can learn anything they wish to set their mind to. He is getting more involved in contributing to open source projects in his spare time. He uses BSD and Python to help him learn more about the computer and to assist him with his many side projects and help him automate and manage various aspects of his life.","website":{"name":"BSD Programming Workshop","url":"http://BSD.pw"}},"5793":{"name":"Michael Marx","title":"MySQL Principal Solutions Engineer ","organization":"MySQL","photo":null,"biography":null,"website":null},"5858":{"name":"Murriel Perez-McCabe","title":"DevOps Engineer","organization":null,"photo":{"alt":null,"height":"1542","width":"1542","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/murriel.jpg"},"biography":"Murriel is an engineer by trade, and has held many other roles in tech throughout her career, including systems administrator, IT Manager, and freelance technology services consultant, across industries ranging from manufacturing to Virtual Reality to IoT. An avid volunteer, Murriel previously served as managing director of Girls in Tech LA, and has organized many technology and mentorship events with various non-profit and community organizations. In addition to being a tech enthusiast, tinkerer, and serial hobbyist, her offline adventures can find her in a vegetable and succulent garden or paddling into the Southern California surf.","website":{"name":"Website","url":"https://www.murrielgrace.com"}},"5883":{"name":"Richard Yen","title":"Principal Support Engineer","organization":"EnterpriseDB","photo":{"alt":null,"height":"200","width":"200","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/d2583945d34a001495d01fcd2266c86f.jpg"},"biography":"Richard has been using PostgreSQL since v. 7.4 in 2003.  He is a Principal Support Engineer at EnterpriseDB, providing technical support to DBAs and developers around the world, and works with many clients ranging from private corporations to government organizations and financial institutions.","website":{"name":"http://richyen.com","url":"http://richyen.com"}},"5896":{"name":"Jeremy Meiss","title":"Director, Developer Relations","organization":"CircleCI","photo":{"alt":null,"height":"600","width":"601","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/jeremy-meiss.png"},"biography":"Jeremy is the Director of DevRel & Community at CircleCI, formerly at Solace, Auth0, and XDA. He is active in the DevRel Community, and is a co-creator of DevOpsPartyGames.com. A lover of all things coffee, community, open source, and tech, he is also house-broken, and (generally) plays well with others.","website":null},"5908":{"name":"Ben Cotton","title":null,"organization":null,"photo":{"alt":null,"height":"1996","width":"1996","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/ato2015-01-square.jpg"},"biography":"Ben Cotton is a meteorologist by training, but weather makes a great hobby. Ben works as the Fedora Program Manager at Red Hat. He is an Open Organization Ambassador and author of . Ben co-founded a local open source meetup group, and is a member of the Open Source Initiative and a supporter of Software Freedom Conservancy.\n \n Program Management for Open Source Projects","website":{"name":"Funnel Fiasco","url":"https://funnelfiasco.com"}},"5918":{"name":"Pep Pla","title":"DBA","organization":"Percona","photo":{"alt":null,"height":"600","width":"600","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/_1010010_600x600.jpg"},"biography":"Pep has a broad experience in several database platforms, but in recent years he has focused on MySQL. His work abides by the motto of Mission Control at NASA: “Tough and competent”. Tough means you are accountable for what you do or fail to do, it means compromise and responsibility. Competent means that you take nothing for granted and you must never be found short in knowledge and skills. This is how Pep feels and lives database management. He is also interested in applying Lean culture to his job and enjoys living in Barcelona with his kids and his partner.","website":null},"5928":{"name":"Simon Elmir","title":"Production Engineer","organization":"Meta (Facebook)","photo":{"alt":null,"height":"800","width":"800","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/DSC01961-edit2.png"},"biography":"Simon Elmir started using Linux in the early 00's, building his early skills on computers built from hand-me-down machines and scavenged parts. He's worked as a sysadmin in places like computer labs, datacenters, and web hosting companies. Most recently, Simon works as a Production Engineer on infrastructure for artificial intelligence systems at Meta (Facebook).","website":null},"5948":{"name":"Ray Paik","title":"Head of Community","organization":"Cube Dev","photo":{"alt":null,"height":"724","width":"499","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/Headshot%202.png"},"biography":"Ray is the Head of Community at Cube Dev where he is helping to grow the community of contributors to the Cube.js project. Prior to Cube Dev, Ray managed open source communities at GitLab and the Linux Foundation. Ray has been a speaker at open source conferences such as All Things Open, Community Leadership Summit, FOSDEM, GitLab Commit, Open Source Summit, and SCaLE. Ray lives in Sunnyvale, CA with his wife and daughter and all three are loyal season ticket holders of the San Jose Earthquakes soccer team.","website":null},"5956":{"name":"Zeke Dean","title":null,"organization":"Imply.io","photo":{"alt":null,"height":"300","width":"258","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/Zeke%20Dean.jpg"},"biography":"Zeke Dean, a highly experienced streaming analytics architect with expertise in both Kafka and Apache Druid. An expert at wearing multiple hats to satisfy customers in their specific roles. Delivered highly scalable code and distributed systems. Numerous years of experience building big data systems for enterprises all over the world -- from banks in the Middle East and india to major publishing houses in the United States and a payment platform in Japan . Zeke now works with businesses to solve their analytics requirements on streaming data using the Imply analytics in motion platform based on Apache Druid.","website":null},"5965":{"name":"Jeffrey Sica","title":"Senior Software Engineer","organization":"Red Hat","photo":{"alt":null,"height":"982","width":"952","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/jeefy%20k8s%20profile%20closeup.png"},"biography":"Jeffrey's primary role at Red Hat involves developing and maintaining the CI system used to gauge product health for the OpenShift Dedicated platform. When not poking holes at test plans, he can usually be found working on upstream Kubernetes in various sub-projects or posting an unhealthy amount of GIFs on Twitter.","website":{"name":"jeefy.net","url":"http://jeefy.net"}},"5983":{"name":"Jans Aasman","title":"CEO","organization":"Franz Inc.","photo":{"alt":null,"height":"1200","width":"1200","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/Jan_Aasman_Headshot_16J9290_SQ1_Web.jpg"},"biography":"Dr. Jans Aasman started his career as an experimental and cognitive psychologist, earning his PhD in cognitive science with a detailed model of car driver behavior He has spent most of his professional life in telecommunications research, specializing in intelligent user interfaces and applied artificial intelligence projects. Jans is currently the CEO of Franz Inc., the leading supplier of scalable Graph database products that provide the storage layer for powerful reasoning and ontology modeling capabilities for Knowledge Graph applications.  Dr. Aasman has gained notoriety as a conference speaker at such events as Smart Data, NoSQL Now, International Semantic Web Conference, KMWorld, Java One, Linked Data Planet, INSA, GeoWeb, AAAI, IEEE, Enterprise Data World, STIDS,  ODSC, Text Analytics, and DEBS to name a few.","website":{"name":"Franz Inc.","url":"https://franz.com"}},"6034":{"name":"Alvaro Leiva","title":null,"organization":"Meta","photo":{"alt":null,"height":"1890","width":"1262","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/received_433747241797907.jpeg"},"biography":"I love Coding, I grew up in a small town in Chile and one weekend, 16 years ago, I had the flu and could not go out. I decided to learn how to code in Python and that was the beginning of the road that would moved us all to the Northern California so that I could join the Production Engineering team at Instagram. Also like eating, drinking and cooking (in that order).","website":null},"6039":{"name":"Binu Ramakrishnan","title":"Security Engineering","organization":"NVIDIA Corporation","photo":{"alt":null,"height":"2324","width":"1703","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/binu-2019-photo.jpeg"},"biography":"Binu Ramakrishnan is a security engineering lead at NVIDIA, responsible for the end to end security of the GPU/Kubernetes cloud platform used for running DL workloads. Previously, Binu has worked at Yahoo for ten years, leading product security engineering and engagement programs and built Internet-scale secure systems. As an avid coder, he has authored and open sourced various security related tools. Binu is also the co-author of IETF RFCs related to email security.","website":{"name":"GitHub","url":"https://prbinu.github.io/"}},"6049":{"name":"Rob Richardson","title":"Developer Advocate","organization":"Cyral","photo":{"alt":null,"height":"640","width":"500","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/Rob%20Richardson.jpg"},"biography":"Rob Richardson is a software craftsman building web properties in ASP.NET and Node, React and Vue. He’s a Microsoft MVP, published author, frequent speaker at conferences, user groups, and community events, and a diligent teacher and student of high quality software development. You can find this and other talks on his blog at  and follow him on twitter at @rob_rich.\n \n https://robrich.org/presentations","website":{"name":"Rob's Speaking Experience","url":"https://robrich.org/presentations"}},"6059":{"name":"Davide Cavalca","title":"Production Engineer","organization":"Meta","photo":null,"biography":"Davide Cavalca is a Production Engineer at Meta on the Linux team. Davide has been working in the systems space for over 15 years, always with a strong focus towards open source and automation.","website":{"name":"Meta Linux Open Source","url":"https://opensource.fb.com/linux/"}},"6203":{"name":"John Engelke","title":"Senior Data Systems Software Dev Specialist","organization":"Jet Propulsion Laboratory,  California Institute of Technology","photo":{"alt":null,"height":"200","width":"200","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/test-head.jpg"},"biography":"With experience writing software and managing teams for leading Web companies (Edmunds, Intuit), plus new concept startups, John has a strong background in Web software engineering and release management. He has worked with concurrent, real-time systems developing DB-enabled Java and Python applications. John currently serves as lead developer for  and devops specialist for the  at . Recent experience managing devops teams for a gaming startup inspired innovative solutions to multiplatform problems. Past experience also includes stints as a systems administrator at a regional university. \n \n \n \n NASA's Exoplanet Watch Mars 2020 Perseverance Rover Jet Propulsion Laboratory","website":{"name":"NASA Exoplanet Watch","url":"https://exoplanets.nasa.gov/exoplanet-watch/"}},"6588":{"name":"Kenny Armstrong","title":"Trainer Advisor","organization":"Linux Professional Institute","photo":{"alt":null,"height":"450","width":"450","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/DSC01402.jpg"},"biography":"Kenny has worked with UNIX-like operating systems since his introduction to them while serving in the U.S. military in the late 1990s. Kenny has been involved with the Linux community in various capacities such as teaching Linux for a variety of training organizations, deploying Linux in local government institutions up to large Universities, as well as in various large-scale businesses. Kenny enjoys working with open platforms and finding potential new uses for them in a variety of situations. More importantly, he prefers teaching others about Linux so that they can put it to use wherever possible.","website":null},"6703":{"name":"John Sicklick","title":"Adjunct Faculty","organization":"Long Beach City College","photo":{"alt":null,"height":"250","width":"250","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/john.sicklick.jpg"},"biography":"John has over 30 years of experience in the aerospace industry as a software developer, systems administrator, systems integrator, and systems security engineer. John is a retired U.S. Navy Commander where he served as an Information Corps Warfare Qualified officer. John currently serves as an adjunct faculty member at a local community college, teaching courses in ethical hacking, Linux operating system, and computer forensics. He has also served as a mentor instructor for SANS. A graduate of New York Maritime College and Azusa Pacific University, he holds a BS in Computer Science and an MS in Applied Computer Science and Technical Programming. He holds the GSLC, GXPN, GWAPT, GCIH, GCFE, GPEN, GSEC, and CISSP certifications and the Penetration Testing & Ethical Hacking certificate from the SANS Technology Institute. John is excited and honored to help others further their careers in cybersecurity.","website":null},"9668":{"name":"Robert Read","title":"Head Invention Coach","organization":"Public Invention, a research non-profit","photo":{"alt":null,"height":"1183","width":"871","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/ColorHeadShot.png"},"biography":"Robert L. Read was first paid as a programmer at the age of 16. He has a PhD in Computer Science from the University of Texas at Austin. He wrote the essay “How to Be A Programmer” (). After a career as a director/architect at medium size software firms, he became a Presidential Innovation Fellow in the Obama administration and co-founder 18F with the federal government. He then founded Public Invention (), a US 501c3 public charity, to extend the ideas of the free software movement to free-libre open source hardware inventions. As the Head Invention Coach of Public Invention, Rob mentors teams making a variety of invention projects, including tools for mathematics, water quality analysis, and robotics,  When the pandemic broke, Public Invention began creating free-libre open source tools for pandemic response teams to use and arguing for modular open source respiration support medical devices.\n \n \n https://github.com/braydie/HowToBeAProgrammer https://www.pubinv.org/","website":{"name":"Public Invention","url":"https://www.pubinv.org/"}},"9882":{"name":"Matt Yonkovit","title":"Head of Open Source Strategy","organization":"Percona","photo":{"alt":null,"height":"1420","width":"1586","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/matt_yonkovit_compressed.png"},"biography":"Matt Yonkovit has been in the Open Source Database Community for over 15 years working for MySQL AB, Sun Microsystems, Mattermost, and Percona. Matt has held technical roles, management, and executive roles (including Chief Customer Officer, Chief Experience Officer, VP of Global Services)  serving the open source community.    He is currently serving as Percona's head of Open Source Strategy(the HOSS), focused on helping developers, architects, and DBA's get the most out of their open-source database investments no matter what database or how they use them. Matt lives in Raleigh NC.","website":null},"9917":{"name":"Jim Tario","title":"Senior Site Reliability Engineer","organization":"Blizzard Entertainment","photo":{"alt":null,"height":"2624","width":"2104","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/profile_pic%20copy.jpg"},"biography":"Jim Tario is a Site Reliability Engineer on the Diablo team at Blizzard Entertainment, where he works on the reliability of the infrastructure and systems. At Blizzard, he was one of the first interns in the Service Engineering team (now SRE) and progressed to Senior through this 5-year tenure.","website":{"name":"Personal Site","url":"https://jimtar.io/"}},"9966":{"name":"Noaa Barki","title":"Fullstack Engineer","organization":"Datree","photo":{"alt":null,"height":"400","width":"400","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/Noaa_Headshot.jpeg"},"biography":"Noaa is a full-stack developer, community manager, and tech writer who wishes to encourage developers to deepen the decisions we make during the development processes, research about the technologies we use and share our knowledge. She started her journey in the 8200 Unit of the IDF Intelligence forces where Noaa took her first steps in software development. In the last 4 years, her work has mainly included Angular, .NET, VanillaJS, and Typescript. She currently develops in React, NodeJS and Golang.","website":{"name":"Datree","url":"https://datree.io"}},"9967":{"name":"Shimon Tolts","title":"CEO & Co-Founder","organization":"Datree","photo":{"alt":null,"height":"500","width":"500","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/Shimon_Headshot.jpeg"},"biography":"Shimon established and managed the Software Engineering Infrastructure department for 400 engineers at ironSource. Also as an AWS Community Hero, Shimon runs the largest AWS user-group worldwide and an avid speaker at conferences. Today, Shimon is the CEO & Co-Founder at Datree, an automated policy enforcement solution for Kubernetes. It helps to prevent misconfigurations from code through production. Datree allows to seamlessly manage and enforce policies across Developers and DevOps engineers.","website":{"name":"Datree","url":"https://datree.io"}},"10025":{"name":"Mark Wong","title":"Performance Engineer","organization":"EDB","photo":{"alt":null,"height":"866","width":"866","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/mark-sq.jpg"},"biography":"Mark Wong is a Performance Engineer at EDB and is a PostgreSQL Major Contributor. He first introduced himself to the PostgreSQL community in 2003 with open source benchmarking kits and performance data. Since then, he has continued to contribute to various aspects of the community such as a Google Summer of Code mentor, Conference Organizer, Portland PostgreSQL Users Group Co-Organizer, PostgreSQL Fundraising Group Member, and a Director on the Board of the United States PostgreSQL Association, a non-profit for promoting the use of PostgreSQL.","website":null},"10031":{"name":"Mike Bursell","title":"CEO","organization":"Profian","photo":{"alt":null,"height":"1528","width":"1680","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/2021-05-24_0008-square.jpg"},"biography":"Mike Bursell is CEO of Profian, a company in the Confidential Computing space. He is one of the co-founders of the Enarx project () and a visible presence in the Confidential Computing Consortium.  Mike has previously worked at companies including Red Hat, Intel and Citrix, with roles working on security, virtualisation and networking. After training in software engineering, he specialised in distributed systems and security. He regularly speaks at industry events in Europe, North America and APAC.\n \n https://enarx.dev Professional interests include: Confidential Computing, Linux, trust, open source software, security, distributed systems, blockchain, virtualisation. Mike has an MA from the University of Cambridge and an MBA from the Open University, and author of \"Trust in Computer Systems and the Cloud\", published by Wiley.","website":{"name":"Profian","url":"https://profian.com"}},"10033":{"name":"Frits Hoogland","title":"Developer Advocate","organization":"Yugabyte","photo":{"alt":null,"height":"200","width":"199","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/fritshoogland.png"},"biography":"Frits Hoogland is a developer advocate at Yugabyte, where he works on cloud native open source technology and performance challenges. He’s an IT professional who believes in applying a scientific approach to performing IT tasks. He spent 25 years working predominantly with Oracle database technology solving performance issues for some of the world’s largest companies. Frits has also worked for the highly-acclaimed Enkitec corporation, co-wrote a book about Oracle Exadata, and helped the University of Rotterdam build a database for DNA to aid pathological gene selection.","website":{"name":"Blog","url":"https://dev.to/fritshooglandyugabyte"}},"10038":{"name":"Mary Cordova","title":"Senior Manager, Data Engineering & Analytics, InfoSec","organization":null,"photo":{"alt":null,"height":"1632","width":"1224","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/MVIMG_20180621_214124~3.jpg"},"biography":"Mary Cordova is a member of the SplunkTrust, experienced Splunk users from around the globe recognized for their exceptional contributions to the Splunk Community. She has worked in the threat detection and response space for various industry leaders in gaming, media and entertainment for the past decade and can be found lurking around several L.A. based InfoSec communities.","website":{"name":"Mary Cordova LI","url":"https://www.linkedin.com/in/marycordova"}},"10039":{"name":"Angel Rivera","title":"Senior Developer Advocate","organization":"CircelCI","photo":{"alt":null,"height":"954","width":"954","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/rivera-circleci-circle-crop.png"},"biography":"Angel started his career as an US Air Force Space Systems Operations specialist in Cape Canaveral AF Station where he realized his passion for technology and software development. He has extensive experience in the private, public and military sectors and his technical experience includes military/space lift operations, software development, SRE/DevOPs engineering. He also has a wealth of experience in defense and federal sectors such as contracting, information systems security and management. You can usually find him speaking at or organizing local tech meetups and hackathons where he enjoys engaging with developers.","website":null},"10056":{"name":"Atom Ramirez","title":"High School Student","organization":null,"photo":{"alt":null,"height":"2361","width":"1446","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/atomr.JPG"},"biography":"Atom is a high school student interested in cyber security, Linux, programming, and Basketball. He has been competing in cyber competitions such as Cyberpatriot, National Cyber League and local California CTF events. As a Cyberpatriot since the 7th grade and founder of the Cybersecurity Club at Bishop Amat Memorial High School, he enjoys sharing his experience by publishing cyber related articles online. He recently completed the Qubit By Qubit Introduction to Quantum Computing course where he learned Quantum physics, Linear Algebra to design quantum circuits using Python and Qiskit package on the IBM Quantum Experience platform. He plans to major in Physics and Computer Science to apply Quantum physics in cybersecurity spaces.","website":null},"10065":{"name":"Kyle Davis","title":"Senior Developer Advocate","organization":"AWS","photo":{"alt":null,"height":"160","width":"120","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/headshot_0.jpeg"},"biography":"Kyle Davis is the Senior Developer Advocate for OpenSearch at AWS. Kyle has a long history with software development and databases and was a founding contributor to the OpenSearch project. When not working, Kyle enjoys 3D printing, and getting his hands dirty in his Edmonton, Alberta-based home garden.","website":null},"10068":{"name":"Marie Ramirez","title":"High School Student","organization":null,"photo":{"alt":null,"height":"3793","width":"2973","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/marie.jpg"},"biography":"Marie Curie Ramirez is a high school student at Bishop Amat High School with a interest in Cybersecurity and Linux. She's been competing in cyber defense competitions for several years and plans to pursue a degree in Mathematics and Computer Science. She has published online articles on cyber security topics such as \"Overcoming a girl's struggle in Cyber Security\", \"Staying safe by understanding common cyber threats\", and \"How secure is your password?\". She also enjoys dance and volleyball.","website":null},"10071":{"name":"Frédéric Desbiens","title":"Program Manager — IoT and Edge Computing","organization":"Eclipse Foundation","photo":{"alt":null,"height":"1920","width":"1920","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/fdesbiens%20-%20headshot%20-%20small%20-%20square.jpg"},"biography":"Frédéric Desbiens manages IoT and Edge Computing programs at the Eclipse Foundation. His job is to help the community innovate by bringing devices and software together. He is a strong supporter of open source. He worked as a product manager, solutions architect, and developer for companies as diverse as Pivotal, Cisco, and Oracle. Frédéric holds an MBA in electronic commerce, a BASc in Computer Science, and a BEd, all from Université Laval. In the past, Frédéric spoke at several industry conferences, such as Oracle OpenWorld, JavaOne, ODTUG Kaleidoscope, IOUG Collaborate, and QCon. After hours, Frédéric will typically read a history book, play video games, or watch Anime. \n    You can follow his blog at: \n \n https://blog.bluberrycoder.com/","website":{"name":"Eclipse Edge Native Working Group","url":"https://edgenative.eclipse.org"}},"10077":{"name":"Darryl Hwang","title":"PAPRa Product Lead","organization":"Tetra Bio","photo":null,"biography":null,"website":{"name":"https://www.tetrabio.org/","url":"https://www.tetrabio.org/"}},"10078":{"name":"Antoni Ivanov","title":"Staff","organization":"VMWare ","photo":{"alt":null,"height":"823","width":"817","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/IMG_1665.png"},"biography":"Antoni Ivanov is Staff Engineer specializing in scalable big data systems and data analytics infrastructure. Antoni has been working on building VMware data analytics platform from its beginning. Antoni has been the technical lead of the recently Open source project Versatile Data Kit for the past two years. Versatile Data Kit has transformed data engineering at VMware towards being code-first, fully automated, and decentralized. Now he is working to bring that as open source software to all data practitioners in the community.","website":{"name":"Versatile Data Kit","url":"https://github.com/vmware/versatile-data-kit"}},"10081":{"name":"Dimira Petrova","title":null,"organization":"VMware","photo":{"alt":null,"height":"2048","width":"1366","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/Dimira_Badge_Photo.jpg"},"biography":null,"website":null},"10086":{"name":"axel simon","title":null,"organization":"Element","photo":{"alt":null,"height":"538","width":"538","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/2019-02-27-114202.jpg"},"biography":"Axel works by day as a solution architect for Element, helping grow open communications using the Matrix protocol in a siloed world. By night, he's a volunteer for La Quadrature du Net, a French non-profit defending fundamental freedoms in a digital world. He previously worked on open source security as part of the Red Hat Office of the CTO's Emerging Technologies Security team, where he worked on projects such as Enarx, Keylime and sigstore. He has studied economics, “done agile”, worked on the blockchain ecosystem, talked before the French Senate, been involved in open source communities for over a decade and in his spare time enjoys cooking, skating, martial arts and organising to protect fundamental rights.","website":{"name":"pesronal website","url":"https://axelsimon.net"}},"10088":{"name":"Sarah Newman","title":null,"organization":null,"photo":null,"biography":"Sarah Newman is currently working with embedded Linux. Formerly she ran a VPS hosting company and designed FPGA firmware using VHDL. She had her first taste of programming computers at the ripe age of 5 writing a number guessing game and reading books of games written in basic.","website":null},"10089":{"name":"William Perdue","title":"Software Engineer","organization":"Foursquare","photo":{"alt":null,"height":"401","width":"401","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/Screen%20Shot%202021-11-30%20at%201.23.30%20PM.png"},"biography":"William Perdue enjoys all things open source, automation, and containerization. He strongly believes everything is better in a container. With a history in IT automation and more recently site reliability and infrastructure software engineering, William enjoys finding ways to reduce toil, and increase developer happiness and productivity.","website":null},"10091":{"name":"Alexander Korotkov","title":"Founder","organization":"Oriole DB Inc.","photo":{"alt":null,"height":"1000","width":"999","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/118072265_4897578796934676_1946350595812960875_n.jpg"},"biography":"Alexander Korotkov is a PostgreSQL Major Contributor & Committer, and PhD in computer science. He contributed many fields of PostgreSQL including indexing, statistics, concurrency, extensibility, and more. In 2015 Alexander co-founded and became the technical chief and development officer at Postgres Professional in Moscow. He is the inventor behind OrioleDB who seeks to deliver the solutions of PostgreSQL wicked problems.","website":null},"10098":{"name":"Ana McTaggart","title":"Security Analyst","organization":"Red Hat","photo":{"alt":null,"height":"200","width":"200","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/mctaggart.png"},"biography":"Ana is a security analyst at Red Hat, focusing on storage security, both for containers and for distributed systems. They did a master's degree at UCSC, and have an undergraduate degree in math and computer science from Umass Amherst. In their free time, they enjoy hiking with their dog.","website":null},"10099":{"name":"Michael Hackett","title":"Senior Principal Product Experience Engineer","organization":"Red Hat","photo":{"alt":null,"height":"786","width":"818","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/hackett.png"},"biography":"Michael Hackett is a storage and SAN expert in customer support. He has been working on Ceph and storage-related products for over 12 years. Apart from this, he holds several storage and SAN-based certifications and prides himself on his ability to troubleshoot and adapt to new complex issues. Michael is currently working at Red Hat, based in Massachusetts, where he is a principal software maintenance engineer for Red Hat Ceph and the technical product lead for the global Ceph team. Michael lives in Massachusetts with his wife, Nicole, his two sons, and their dog. He is an avid sports fan and enjoys time with his family.","website":null},"10101":{"name":"Daniel Stemen","title":"Manager of Respiratory and Interventional Pulmonary Services","organization":"Keck Medical Center of USC","photo":{"alt":null,"height":"1400","width":"933","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/CE9A0439-C847-4C1A-84C8-CB0A19B5E62C.jpeg"},"biography":null,"website":null},"10102":{"name":"Nathaniel McCallum","title":"CTO","organization":"Profian","photo":{"alt":null,"height":"1385","width":"1385","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/avatar_0.jpeg"},"biography":"Profian CTO and Enarx co-founder, Nathaniel has been engineering systems at scale for more than 15 years, with an emphasis on cryptography and security. Previously the Virtualization Security Architect for Red Hat, he lives near Raleigh, NC.","website":{"name":"https://npmccallum.gitlab.io","url":"https://npmccallum.gitlab.io"}},"10104":{"name":"Evan Leibovitch","title":"Director of Community Development","organization":"Linux Professional Institute","photo":{"alt":null,"height":"1964","width":"1809","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/Evan-headshot-2018.jpg"},"biography":"Evan is LPI Director of Community Relations and one of the organizations' co-founders. A longtime advocate of open computing and open source, he was ZDNet's first Linux-specific columnist and has participated in numerous conferences, nonprofits, policy initiatives and white papers. Before re-joining LPI in 2017 he worked for the United Nations refugee agency (UNHCR) working to bring Internet access and work opportunities to refugee centres in Egypt, Uganda and Kenya. He was co-founder and first president of the Canada Chapter of the Internet Society, and first Chair of the the North American At-Large advisory body of ICANN. He is based in Toronto, Canada.","website":{"name":"LPI Home page","url":"https://www.lpi.org"}},"10109":{"name":"Anita Zhang","title":"Software Engineering Manager","organization":"Meta","photo":{"alt":null,"height":"800","width":"800","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/headshot2022_800.png"},"biography":"Anita Zhang is the software engineering manager of Meta's Linux Userspace team. Her team connects Meta's infrastructure with the open source community. She is active on the systemd project and continues to support systemd at Meta as part of their userspace efforts.","website":null},"10111":{"name":"Dan Isla","title":null,"organization":"itopia inc","photo":{"alt":null,"height":"1156","width":"1539","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/dan_barcelona.jpg"},"biography":"Dan Isla is the VP of Product at itopia inc. Before joining itopia, Dan worked at the NASA Jet Propulsion Laboratory, building rovers and launching rockets, he also spent 4 years at Google in Irvine as a Cloud Solutions Architect. Dan is the creator of the Open Source project, Selkies (), which enables stateful workload orchestration on Kubernetes and per-user containerized environments with GPUs and WebRTC streaming.\nDan has been attending SCALE for several years now and is passionate about the Linux ecosystem, web-based streaming technologies, containers, and making developers more productive in the cloud.\n \n \n \n https://selkies.io","website":{"name":"https://www.linkedin.com/in/danisla/","url":"https://www.linkedin.com/in/danisla/"}},"10120":{"name":"Esty Scheiner","title":"Security Engineer","organization":"Invoca","photo":{"alt":null,"height":"1638","width":"2048","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/42c2bb08-1fee-449b-934d-567a38df5335.JPG"},"biography":"Esty Scheiner CISSP is a recent SecureSet graduate currently working as a Security Engineer working at Invoca. She is a driven continuous learner with a creative approach to managing security, privacy, and risk. Recently she contributed to the Brakeman project and created a continuous security Integration for applications empowering modern development teams to find, fix and prevent vulnerabilities related to source code, open source libraries, secret management and cloud configuration.","website":null},"10128":{"name":"Justin Reock","title":"Field CTO","organization":"Gradle, Inc.","photo":{"alt":null,"height":"522","width":"916","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/New-headshot-transback-png.png"},"biography":"Justin Reock is the Chief Evangelist and Field CTO of Gradle Enterprise, and is an outspoken blogger, speaker, and free software evangelist. He has over 20 years of experience working in various software roles and has delivered enterprise solutions, technical leadership, and community education on a range of topics.","website":{"name":"Gradle","url":"https://gradle.com"}},"10152":{"name":"Aman Bhullar","title":"Chief Information Officer","organization":"Los Angeles County Registar-Recorder/County Clerk","photo":{"alt":null,"height":"372","width":"340","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/Screen%20Shot%202022-04-09%20at%2010.31.54%20AM.png"},"biography":"Aman Bhullar has over 25 years’ experience in technology implementations and consulting. He currently oversees the strategic planning and modernization initiatives of information technology, information security and data management for the Los Angeles County Registrar-Recorder/County Clerk. Mr. Bhullar has provided vision and leadership in the development and implementation of applications and infrastructure supporting the department’s more than 1,500 employee workforce that serves nearly 5.8 million voters. This includes the development, implementation and support of the Voting Solutions for All People (VSAP) – the largest voting system transformation of the largest election jurisdiction in the nation in history. He also provides vision and direction to develop, implement and support one of the largest repository of vital records in the nation, serving and more than 10 million constituents.","website":null},"10165":{"name":"Kat Cosgrove","title":"Staff Developer Advocate","organization":"Pulumi","photo":{"alt":null,"height":"400","width":"400","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/FmChitNh_400x400.jpg"},"biography":"Kat Cosgrove is a Developer Advocate, a CNCF Ambassador, and an actual cyborg. Her professional background has run the gamut from bartender, to video store clerk, to teacher, to software engineer. She credits this wide-ranging experience for her success as a speaker, developer, and advocate. You can usually find her speaking about DevOps or cloud native technologies, particularly 101-level content, in pursuit of her goal of increasing accessibility for these tools.","website":null},"10198":{"name":"Jaime Casanova","title":"Director of professional services","organization":"SystemGuards","photo":{"alt":null,"height":"618","width":"622","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/jcm.png"},"biography":"Jaime has been contributing to postgres the last 18 years. Mainly as patch reviewer and bug hunting, and a few little patches. Jaime also has experience with HA clusters and complex configurations from his time at 2ndQuadrant. Currently, Director of Professional Services at Systemguards, the only Latin America company providing high level support of postgres completely in spanish.","website":null},"10224":{"name":"Sean O'Dell","title":"Head of Developer Relations","organization":"Spacelift","photo":{"alt":null,"height":"2113","width":"2182","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/Sean.jpg"},"biography":"Sean is a reformed infrastructure administrator and architect with a passion for enabling Developers, SREs, and Application teams to succeed in a Multi-Cloud World. Sean also believes that traditional Enterprise IT organizations can and should develop a more modern approach focusing on DevSecOps practices and principles. Sean also enjoys getting on his soapbox to scream about how Applications should be built, managed, and operated where it makes sense for the organization. As the Head of Developer Relations at Spacelift, Sean ensures that DevSecOps practitioners have the tooling, community, content, and influence they need to deliver Infrastructure as Code at scale.","website":{"name":"The most flexible management platform for Infrastructure as Code","url":"https://spacelift.io/"}},"10243":{"name":"Ken Gilmer","title":"Engineer","organization":"Regolith Desktop","photo":null,"biography":"I am the founder and lead of the Regolith Desktop project.","website":{"name":"Regolith Desktop","url":"http://regolith-desktop.com"}},"10247":{"name":"Demetris Cheatham","title":"Senior Director, Diversity and Inclusion Strategy","organization":"GitHub","photo":{"alt":null,"height":"601","width":"600","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/Demetris%20Cheatham%20headshot.jpg"},"biography":"Demetris Cheatham is the Senior Director for Diversity and Inclusion Strategy at GitHub where she lead the strategy across four pillars: People/HR, Platform, Philanthropy and Policy. Beyond strategy development and execution, she spends her time working with external partners to advance diversity and inclusion within the open source ecosystem. In 2021, she launched All In, an open source community whose mission is to advance DEI in open source through access, community, equity and data. Prior to joining GitHub, Demetris led Global Diversity and Inclusion at Red Hat where she was responsible for implementing the diversity and inclusion strategy for the company and its 15K+ employees located around the world. Demetris lives in Raleigh, North Carolina and is a lecturer at North Carolina State University where she teaches Introduction to Entrepreneurship. She is also a member of the Board of Trustees and Executive Committee at Ravenscroft School and Chair of the DEI Committee.","website":{"name":"All In","url":"http://allinopensource.org"}},"10258":{"name":"Stephen Jazdzewski","title":"Owner","organization":"Advanced Database Networking","photo":{"alt":null,"height":"1024","width":"1024","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/StephenJazdzewski21JSQSCaLE.jpg"},"biography":"Stephen Jazdzewski has over 42 years of experience in computers and electronics. Today he owns his own consulting firm and specializes in Software Architecture, Programming, Data Modeling, Databases, TDD, Interfaces, and IT Architecture. At the start of his career in the early 1980's, he ported Peachtree accounting software to the Apple ][. He then became the first employee of Central Point Software in 1981, which developed Copy II+ and PCTools. He went on to write software for the wholesale lumber industry in DB2/Clipper. In the mid-90's, Stephen started \"Cool Jargon of the Day,\" listed in PC Computing's \"Best of the InterNet: Top 1000 Websites.\" In 2015, Stephen released the first iteration of his OpenSource SQL Schema, NoCRUD.com.","website":{"name":"Personal Page","url":"http://jazd.com"}},"10262":{"name":"Ibrar Ahmed","title":"Principle Software Engineer","organization":"Percona LLC","photo":{"alt":null,"height":"640","width":"640","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/pp.jpeg"},"biography":null,"website":null},"10263":{"name":"Sarah Conway","title":"Cloud Evangelist","organization":"EnterpriseDB","photo":{"alt":null,"height":"2559","width":"2447","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/D3AC544D-22EE-40AE-B3BA-1AE79EB877B8.jpeg"},"biography":"Senior software engineer, frontend web developer, senior website manager, technical support engineer, developer advocate, conference organizer, diversity committee chair, program organizer, social media manager, and copy editor are just some of the technical hats I've worn in 10+ years of professional experience working as sole project manager as well as in collaboration with hybrid/remote, distributed, & global teams. For a personal look into who I am and my involvement in the open source community, check out my interview featured in #PostgresFriends “PostgreSQL Person of the Week”. \n \n https://postgresql.life/post/sarah_conway_schnurr/","website":{"name":"Sarah in San Diego - Portfolio","url":"https://sarahinsandiego.github.io/portfolio/"}},"10267":{"name":"Vint Cerf","title":"Chief Internet Evangelist","organization":"Google","photo":{"alt":null,"height":"1102","width":"960","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/VGC%20OFFICIAL%20PHOTO%20%2813%29%20%283%29_0.jpeg"},"biography":"Vinton G. Cerf is vice president and chief Internet evangelist for Google. Cerf has held positions at MCI, the Corporation for National\nResearch Initiatives, Stanford University, UCLA and IBM. Vint Cerf served as chairman of the board of the Internet Corporation for\nAssigned Names and Numbers (ICANN) and was founding president of the Internet Society. He served on the US National Science\nBoard from 2013-2018.\n \n \n \n \n \n \n \n    Widely known as one of the \"Fathers of the Internet,\" he received the U.S. National Medal of Technology in 1997, the Marconi\nFellowship in 1998 and the ACM Alan M. Turing award in 2004. In November 2005, he was awarded the Presidential Medal of\nFreedom, in April 2008 the Japan Prize and in March 2013, the Queen Elizabeth II Prize for Engineering.","website":null},"10295":{"name":"Dan Lines","title":null,"organization":"LinearB","photo":{"alt":null,"height":"399","width":"399","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/dan.jpg"},"biography":"Dan here. A few things about me… First of all, the only thing I find more awkward than writing a bio about myself is asking someone else to write one about me. So first person it is! I’m a software engineer at heart. Two years ago I started a company with another engineer, my co-founder Ori Keren. I pulled the short straw so actually at the moment I’m responsible for customer success, marketing and sales. Which is crazy because I had never done any of those things before LinearB. I wish I had more time to write code but I love being customer facing because I’m learning a lot of new stuff. Before LinearB I was a dev team lead, and VP of Engineering. I’m obsessed with how dev teams work together. Like what makes great culture? And how can engineering leaders be data-driven without being performance tyrants? And why can cars drive themselves but I have to spend 30 minutes every day manually updating my project tickets?","website":null},"10297":{"name":"Tony Loehr","title":"Developer Advocate","organization":"Cycode","photo":null,"biography":"Tony Loehr is the Developer Advocate for Cycode. Their prerogative is to make it easy for developers to use the Cycode platform, and to help protect data through knowledge sharing. They have professional experience with engineering, marketing, and sales and bring a unique perspective on how to implement comprehensive cybersecurity solutions. They value being a lifelong learner, and aim to help teach cybersecurity solutions to people with varying degrees of technical knowledge. In their free time, Tony enjoys tending houseplants, freestyle rapping, and working on various side projects.","website":null},"10323":{"name":"Ben Michel","title":"Technical Evangelist","organization":"Datadog","photo":{"alt":null,"height":"400","width":"400","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/avatar_0.jpg"},"biography":"Ben cares about enabling developers, and supporting open source projects that push the Web forward (OpenJS Foundation, Node.js, tc39, Unicode Consortium). As a Technical Evangelist at DataDog, he’s helping devs create delightful experiences by using real user monitoring, and distributed synthetic testing. Ben has also led JavaScript meetups over the years (PDXNode, WebAudioPDX), and occasionally produces music.","website":{"name":"Personal site / blog","url":"https://obensource.com/"}},"10346":{"name":"Eric Smalling","title":"Sr. Developer Advocate","organization":"Snyk","photo":{"alt":null,"height":"3873","width":"3099","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/Headshot%20The%20Eye-styleized.jpg"},"biography":"Eric is a 30+ year enterprise software engineer with over a decade of consulting in the DevOps space.  He is a Docker Captain, has been an OSS contributor since the mid-2000s, and holds CKA, CKAD, and CKS certifications from the CNCF.","website":null},"10383":{"name":"Joel Groen","title":"Product Manager","organization":"Chronosphere","photo":{"alt":null,"height":"238","width":"182","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/jg_headshot.jpg"},"biography":"Joel Groen is a member of the product team at Chronosphere. Joel is a product veteran and has guided a series of early stage companies to success in emerging markets. He has a passion for building new products in conjunction with disruptive technology.","website":null},"10387":{"name":"Michael Brewer","title":"Web Developer Principal ","organization":"Franklin OIT: The University of Georgia","photo":{"alt":null,"height":"400","width":"400","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/Michael-Brewer_1.png"},"biography":"Michael Brewer is a Web Developer Principal for the Franklin College Office of Information Technology at The University of Georgia; he also serves as Secretary for the United States PostgreSQL Association (PgUS). He has worked in open source for over two decades and has spoken at regional, national, and international conferences.","website":null},"10388":{"name":"Chip Zoller","title":"Technical Product Manager","organization":"Nirmata","photo":{"alt":null,"height":"400","width":"400","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/ChipHeadshot.jpg"},"biography":"Chip Zoller is a technologist, maintainer, and contributor to the Kyverno project where his primary focus is on process, enablement, documentation, automation, policy design and authoring, and community. Chip's background is as an architect, engineer, and cloud native consultant having spent over twenty years fulfilling roles spanning the gamut in companies from small to large, most recently Dell Technologies where he was a lead system architect for edge computing. Prior to dedicating himself full time to technology, he previously was a classical musician and holds a doctorate in performance. He is a maintainer and contributor to several other open source projects in the CNCF, is active in the broader Kubernetes community, and blogs at neonmirrors.net. Chip is a technical product manager at Nirmata and lives in central Kentucky with his wife and two rescue dogs.","website":{"name":"Neon Mirrors","url":"https://neonmirrors.net/"}},"10403":{"name":"Matthew Boehm","title":null,"organization":"Percona","photo":{"alt":null,"height":"960","width":"720","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/selfPic_2018_0.jpg"},"biography":"Matthew has held dual roles of Senior Architecture and Senior Instructor at Percona for over 9 and a half years. During that time, he’s traveled (almost) around the world delivering top-notch MySQL training, and helping clients from 20 person start-ups to 10,000+ MySQL server corporations. In his spare time, he enjoys recurve archery, video games with his kids, and competitive swing dancing.","website":null},"10405":{"name":"Tony Wilmer","title":"Sr. Solution Architect","organization":"CloudBees","photo":{"alt":null,"height":"1333","width":"2000","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/Wed-2022-03-09%2009.58.39-Bay%202%2000150-.jpg"},"biography":"Tony is a Senior Solutions Architect at CloudBees and a specialist in Software Delivery Automation (SDA).  He has designed and implemented DevOps solutions in many technical sectors including, Software, Financial/Insurance, Defense, Health Care.  His previous experience as a long time customer  of CloudBees solutions gives him the experience and knowledge to help CloudBees provide an SDA platform that addresses real world problems and delivers value to the customer.","website":null},"10406":{"name":"Bill Garrett","title":"Principal Solution Architect","organization":"CloudBees","photo":{"alt":null,"height":"400","width":"400","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/portrait-bg-2018sep.jpg"},"biography":"​​​​Bill Garrett is a Principal Solution Architect at CloudBees, where he's worked for 5 years. Prior to that he’s worked in the DevOps space since before we even had the term “DevOps”. Things you may not know about Bill include that he likes to dress up as Jenkins and is a licensed wedding minister. Bill has not combined these two hobbies… yet.","website":null},"10416":{"name":"Allan Mason","title":"Lead Database Consultant","organization":"Pythian","photo":{"alt":null,"height":"710","width":"710","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/allan_mason.jpeg"},"biography":"I've been technically leading, mentoring, and managing a team, helping companies and people with current and future needs, starting from SW engineering to everything database, currently focused around MySQL.  I work for Pythian doing what I love, in a challenging environment.  I'm passionate about leadership, mentoring, and data.","website":null},"10427":{"name":"Amanda Brock","title":"CEO","organization":"OpenUK","photo":{"alt":null,"height":"1280","width":"853","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/Amanda%20Brock%20July%2021%20headshot.jpeg"},"biography":"Amanda Brock is CEO of OpenUK, the UK organisaton for the business of Open Technology; Board Member, Open Source Initiative; UK Cabinet Office Open Standards Board Member; Advisory Board Member: KDE, Free BSD, Planet Crust, Everseen, and Mimoto; Charity Trustee, Creative Crieff and GeekZone; and European Representative of the Open Invention Network. Amanda was awarded the 2022 UK Lifetime Achievement Award in the Women, Influence and Power Awards,included in Computer Weekly’s Most influential Women in Tech Long listnit2021 and in their UK Tech50 longlist for 2022. She is the editor of Open Source, Law, Policy and Practise, being published open access by OUP in September 2022. A lawyer of 25 years’ experience, she previously chaired theOpen Source and IP Advisory Group of the United Nations Technology Innovation Labs, sat on theOASIS Open Projects and UK Government Energy Sector Digitalisation Task Force. Advisory Boards. She was General Counsel ofCanonical for 5 years.","website":null},"10431":{"name":"Daniel Hix","title":"Software Engineer 2 | Storage","organization":"DigitalOcean","photo":{"alt":null,"height":"460","width":"460","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/DanielHixHeadhshot.jpeg"},"biography":"Graduating from West Texas A&M and getting his Masters at Georgia Tech Daniel loves software development, and also has a strong interest in Open Source Software. After working at various companies Daniel got a job at DigitalOcean on the Storage team where he works on an internal platforms team building a Kubernetes platform to better help container orchestration for the storage team at DigitalOcean.","website":null},"10439":{"name":"Grant Birkinbine","title":"Security Engineer","organization":"GitHub","photo":{"alt":null,"height":"3024","width":"4032","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/IMG_3733.jpg"},"biography":"Grant is a technology, security, and open source enthusiast. His core passions in technology stem from devops and being able to improve workflows for others, while making the process seamless and secure. Grant currently works at GitHub on their security team but has had previous experience making ci/cd pipelines, working on edge computing, and making wacky web apps. In his free time, he enjoys working on open source projects with his friends and playing PC games.","website":{"name":"My personal website","url":"https://birki.io"}},"10440":{"name":"Aeva Black","title":"Office of the CTO, Azure","organization":"Microsoft","photo":{"alt":null,"height":"1500","width":"1500","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/aeva.jpeg"},"biography":"Aeva Black is an incurably queer geek with a penchant for ancient languages, who was briefly a physics major and may have solved time travel¹. Today, they're an open source hacker in Azure's Office of the CTO, focusing on supply chain security and community safety while holding seats on the OSI Board and the OpenSSF TAC. On a previous timeline, they were a database admin and hardware hacker who wrote a lot of code and founded the OpenStack Ironic project. (¹ not really)","website":{"name":"https://aeva.online/about/","url":"https://aeva.online/about/"}},"10444":{"name":"Taylor Dolezal","title":"Head of Ecosystem","organization":"CNCF","photo":{"alt":null,"height":"800","width":"800","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/dole.jpeg"},"biography":"I work on infrastructure tools that enable innovation. I specialize in Kubernetes, Terraform, public clouds, and distributed systems. You can also find me buried deep in a book, preparing a technical talk, or out for a hike in the hills of Los Angeles.","website":{"name":"https://cncf.io","url":"https://cncf.io"}},"10452":{"name":"Steve Pereira","title":null,"organization":null,"photo":{"alt":null,"height":"400","width":"400","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/steve.jpeg"},"biography":"Steve is obsessed with making tech human, and leveraging it to deliver continuous value. He shows teams how to use simple tools and techniques to make big changes. For the past 20 years, his focus has been on sharing mapping techniques to guide ambitious and struggling teams towards their true north. He’s a former startup CTO, agency consultant, systems and release engineer, finance IT manager, tech support phone jockey, and pizza maker. All focused on the flow of value, all the time.","website":null},"10461":{"name":"Chris Crocco","title":"Staff Solutions Engineer","organization":"Splunk","photo":null,"biography":"Chris Crocco is a Staff Consulting Solutions Engineer at Splunk with a focus on helping customers solve IT and Observability problems using the power of data. When he's not nerding out on Splunk, Chris likes to enjoy all the best parts of living in Denver including rock climbing, hiking, and brewing his own beer (yes, really!).","website":null},"10462":{"name":"Niall Deehan","title":"Senior Developer Advocate","organization":"Camunda","photo":{"alt":null,"height":"800","width":"800","src":"https://www.socallinuxexpo.org/sites/default/files/speakers/niall.jpeg"},"biography":"Niall is a Developer Advocate for Camunda’s Open Source platform. This means he spends his time helping developers learn how to use Camunda to orchestrate their backend and front-end services through workflow automation. He does this by speaking at conferences and user groups, building examples and reviewing architectures.","website":null}}