{
  "54": {
    "name": "Owen DeLong",
    "title": "Senior Manager of Network Architecture",
    "organization": "Akamai",
    "photo": {
      "alt": null,
      "height": "512",
      "width": "497",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Breakwater-small.jpg"
    },
    "biography": "Owen DeLong is a Senior Manager of Network Architecture at Akamai Technologies and a member of the ARIN Advisory Council. Owen brings more than 30 years of industry experience. He is an active member of the systems administration, operations, and IP Policy communities. In the past, Owen was an IPv6 Evangelist at Hurricane Electric and has worked at Tellme Networks (Senior Network Engineer), Exodus Communications (Senior Backbone Engineer) where he was part of the team that took Exodus from a pre-IPO start up with 2 data centers to a major global provider of hosting services, Netcom Online (Network Engineer) where he worked on a team that moved the internet from an expensive R&E tool to a widely available public access system accessible to anyone with a computer, Sun Microsystems (Senior Systems Administrator), and more. He can be reached as owen at akamai dot com.",
    "website": {
      "name": "Akamai Technologies",
      "url": "http://www.akamai.com"
    }
  },
  "62": {
    "name": "Kyle Rankin",
    "title": "Security and Infrastructure Professional, Author",
    "organization": null,
    "photo": {
      "alt": null,
      "height": "500",
      "width": "500",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/headshot4.png"
    },
    "biography": "Kyle Rankin is a security and infrastructure expert with over two decades of professional Linux experience. He is the author of How To Write A Tech Book, The Best of Hack and /: Linux Admin Crash Course, Linux Hardening in Hostile Networks, DevOps Troubleshooting, The Official Ubuntu Server Book, Third Edition, Knoppix Hacks, 2nd Edition, and Ubuntu Hacks, among other books. Rankin was an award-winning columnist and tech editor for Linux Journal, and speaks frequently on Free and Open Source software including at SCALE, FOSDEM, O’Reilly Security Conference, Linux Fest NorthWest, OpenWest, BSidesLV, CactusCon, OSCON, Linux World Expo, and Penguicon.",
    "website": {
      "name": "My Personal Site",
      "url": "https://kylerank.in"
    }
  },
  "254": {
    "name": "Nuri Halperin",
    "title": "Owner",
    "organization": "+N Consulting Inc.",
    "photo": {
      "alt": null,
      "height": "1448",
      "width": "1448",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/portraitskcdc0300_square_1448.png"
    },
    "biography": "Nuri Halperin is a software architect, speaker, and author. He helps companies design scalable systems, websites, and business applications. He’s been turning projects into success stories for a variety of clients for over 2 decades. He authored of several Pluralsight.com courses. He's also a MongoDB Champions member, a Microsoft MVP alum, and recipient of MongoDB's William Zola Award for Community Excellence. He enjoys tinkering with Arduinos, 3D printing, and robotics.",
    "website": {
      "name": "Plus N Consulting",
      "url": "https://www.plusnconsulting.com"
    }
  },
  "265": {
    "name": "Robert Reselman",
    "title": "Principal",
    "organization": "CogArtTech",
    "photo": {
      "alt": null,
      "height": "1185",
      "width": "1629",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/reselbob-headshot-05.jpg"
    },
    "biography": "Bob Reselman is an internationally known software developer, system architect, industry analyst, courseware developer and technical writer/journalist. He is presently Senior Technical Analyst at Blockchain Journal. Bob has written a number of books and hundreds of articles on a variety of indepth technical topics for publications such as Red Hat Architect, DevOps.com, TechTarget, and DZone to name a few.  Bob is one of Instruqt's premiere development partners. He has also designed technical courseware for companies such as Red Hat, VMWare, and Cisco, among others. Bob's latest book is titled, The Impact of Automation, Essays on Artificial Intelligence and Thinking Machines on the Human Experience available from TechStrong Research.",
    "website": {
      "name": "Facebook",
      "url": "http://www.facebook.com/BobReselman"
    }
  },
  "279": {
    "name": "Carlos Sanchez",
    "title": "Principal Scientist",
    "organization": "Adobe",
    "photo": {
      "alt": null,
      "height": "2000",
      "width": "2000",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/75ebccdeae70ab23c2f9a117fd6646e3.jpeg"
    },
    "biography": "Carlos Sanchez is a Principal Scientist at Adobe Experience Manager, specializing in software automation, from build tools to Continuous Delivery and Progressive Delivery. Involved in Open Source for over 15 years, he is the author of the Jenkins Kubernetes plugin and a member of the Apache Software Foundation amongst other open source groups, contributing to several projects, such as Jenkins or Apache Maven.",
    "website": {
      "name": "Blog",
      "url": "http://blog.csanchez.org"
    }
  },
  "303": {
    "name": "KC Braunschweig",
    "title": null,
    "organization": null,
    "photo": {
      "alt": null,
      "height": "2384",
      "width": "2107",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/IMG_20181231_191303.jpg"
    },
    "biography": "KC Braunschweig has spent the last 12 years as a production engineer working on Facebook/Meta infrastructure. He's currently working on public cloud infrastructure and tooling. He's previously worked in areas including logging, stream processing, distributed coordination, search infrastructure and configuration management. He's been a SCaLE attendee and volunteer since SCaLE 1x.",
    "website": null
  },
  "380": {
    "name": "John Willis",
    "title": "Distinguished Researcher",
    "organization": "Kosli",
    "photo": {
      "alt": null,
      "height": "389",
      "width": "378",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/John_Willis.jpg"
    },
    "biography": "John Willis has worked in the IT management for over 40 years. He is researching DevOps, DevSecOps, IT risk, modern governance, and audit compliance. Previously, he was an Evangelist at Docker Inc., VP of Solutions for Socketplane (sold to Docker) and Enstratius (sold to Dell), and VP of Training & Services at Opscode, where he formalized the training, evangelism, and professional services functions at the firm. Additionally, Willis founded Gulf Breeze Software, an award-winning IBM business partner specializing in Tivoli technology deployment. As an author, Willis has written six IBM Redbooks on enterprise systems management and four books for IT Revolution, including the DevOps Handbook. He is working on his latest book, The Operational History of Generative AI.",
    "website": null
  },
  "386": {
    "name": "Dawn Foster",
    "title": "Director of Data Science",
    "organization": "CHAOSS",
    "photo": {
      "alt": null,
      "height": "1320",
      "width": "1150",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/dawn_May_2021_sq.jpg"
    },
    "biography": "Dr. Dawn Foster works as the Director of Data Science for CHAOSS where she is also a board member / maintainer. She is co-chair of CNCF TAG Contributor Strategy and an OpenUK board member. She has 20+ years of experience at companies like VMware and Intel with expertise in community, strategy, governance, metrics, and more. She has spoken at over 100 industry events and has a BS in computer science, an MBA, and a PhD. In her spare time she enjoys reading science fiction, running, and traveling.",
    "website": {
      "name": "Fast Wonder",
      "url": "http://fastwonderblog.com/"
    }
  },
  "457": {
    "name": "Jathan McCollum",
    "title": "Core Maintainer",
    "organization": "Nautobot",
    "photo": null,
    "biography": "I am a Principal Software Engineer for AOL's Network Architecture & Automation team. I have been helping to run AOL's network for over 12 years from every aspect to network security, architecture, performance and automation. I am the lead developer for Trigger, a network engineering toolkit written in Python, which we open sourced in April of 2012. Trigger was designed to increase the speed and efficiency of managing network configuration while reducing human error, and is the bread and butter of how we manage the large-scale network at AOL.",
    "website": null
  },
  "460": {
    "name": "Richard Gaskin",
    "title": "Ambassador",
    "organization": "Fourth World Systems",
    "photo": {
      "alt": null,
      "height": "192",
      "width": "192",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/RichardGaskin192.jpg"
    },
    "biography": "Richard Gaskin is the owner of Fourth World Systems, a software design and development consultancy in Los Angeles.  Since founding the company in 1994, he's developed dozens of commercial and open source applications used by a wide range of organizations, including FedEx, AOL, the US Library of Congress, and thousands of hospitals and universities around the world. Although he started his career with Mac OS, Richard has since delivered applications for Irix, every version of Windows, and has been developing for Linux for the last two years. Richard has spoken at dozens of tech conferences, including SCaLE, LiveCode Developer Conference, and MacTech where he had the distinction of being the only presenter using Ubuntu.",
    "website": {
      "name": "Fourth World Systems",
      "url": "http://www.fourthworld.com"
    }
  },
  "461": {
    "name": "Karsten Wade",
    "title": "Partner & Chief Community Architect",
    "organization": "Open Community Architects",
    "photo": {
      "alt": null,
      "height": "1910",
      "width": "1489",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Karsten-2022-headshot.jpg"
    },
    "biography": "Karsten has over 20 years leading and working hands-on in a range of Open Source projects in the private, public, academic, research, and non-profit spaces. His nearly three decade career in IT includes almost six years in three professional service organizations. Karsten is founder, partner, and Chief Community Architect for the consultancy Open Community Architects (OCA) \n \n https://OpenCommAr.ch",
    "website": {
      "name": "Open Community Architects",
      "url": "https://OpenCommAr.ch"
    }
  },
  "477": {
    "name": "Federico Lucifredi",
    "title": "Product Management Director",
    "organization": "Red Hat",
    "photo": {
      "alt": null,
      "height": "1152",
      "width": "946",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/F2%20Hedcut%20by%20Kevin%20Sprouls%20.jpg"
    },
    "biography": "Federico Lucifredi is the Product Management Director for Ceph Storage at Red Hat and a co-author of O'Reilly's \"Peccary Book\" on AWS System Administration. Previously, he was the Ubuntu Server product manager at Canonical, where he oversaw a broad portfolio and the rise of Ubuntu Server to the rank of most popular OS on Amazon AWS. A software engineer-turned-manager at the Novell corporation, he was part of the SUSE Linux team, overseeing the update lifecycle and delivery stack of a $150 million maintenance business. A CIO and a network software architect at advanced technology and embedded Linux startups, Federico was also a lecturer for over 200 students in Boston University's graduate and undergraduate programs, and simultaneously a consultant for MIT implementing fluid-dynamics simulations in Java.",
    "website": null
  },
  "547": {
    "name": "Lori Barfield",
    "title": "Chair",
    "organization": "SCaLE",
    "photo": {
      "alt": null,
      "height": "191",
      "width": "210",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Barfield_0.jpg"
    },
    "biography": "Lori joined her first Internet startup as a senior UNIX system administrator at a company that eventually went public. This got her hooked on the thrilling growth and success process and eventually she started an international executive consulting practice. In 2017 she co-founded the ShellCon infosec conference in Southern California and developed RaiseMe, a unique career development effort for nonprofits. RaiseMe has successfully helped people re-career into their first infosec engineering roles and offers IT leadership training courses. Lori is a mother of five, most of whom have unsuccessfully avoided careers in engineering. :-)",
    "website": null
  },
  "927": {
    "name": "Joe Conway",
    "title": "Head of PostgreSQL Contributors Team",
    "organization": "Amazon Web Services (AWS)",
    "photo": {
      "alt": null,
      "height": "960",
      "width": "960",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/jconway-new.jpg"
    },
    "biography": "Joe Conway is a technology executive with skills in a wide array of disciplines and extensive international business experience. He has been involved with the PostgreSQL community since 1998, presently as a PostgreSQL Committer, Major Contributor, and Infrastructure Team member. He is also the author and maintainer of a PostgreSQL procedural language handler for the R language, PL/R. Joe is currently Head of the PostgreSQL Contributors Team at Amazon Web Services, RDS Open Source Databases.",
    "website": null
  },
  "948": {
    "name": "Elizabeth K. Joseph",
    "title": "Global Head, OSPO for IBM Z",
    "organization": "IBM",
    "photo": {
      "alt": null,
      "height": "533",
      "width": "533",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/ekrumbach_056_533x533.png"
    },
    "biography": "Elizabeth K. Joseph leads the Open Source Program Office for IBM Z (mainframes!). Previously, she spent time working on Apache Mesos, and four years as a systems engineer on the OpenStack Infrastructure team and six years on the Ubuntu Community Council and has held various roles in the Ubuntu community and is the co-author of The Official Ubuntu Book, 8th and 9th Editions. At home in San Francisco, she sits on the Board of Directors for Partimus.org, a non-profit in the Bay Area providing Linux-based computers to schools in need.",
    "website": {
      "name": "princessleia.com",
      "url": "http://www.princessleia.com"
    }
  },
  "1129": {
    "name": "Nova King",
    "title": null,
    "organization": null,
    "photo": {
      "alt": null,
      "height": "4608",
      "width": "3456",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/IMG_20200606_150727%20%282020_06_06%2021_01_58%20UTC%29.jpg"
    },
    "biography": null,
    "website": {
      "name": "Stardust XR",
      "url": "https://stardustxr.org/"
    }
  },
  "3632": {
    "name": "Corey Quinn",
    "title": "Chief Cloud Economist",
    "organization": "The Duckbill Group",
    "photo": {
      "alt": null,
      "height": "500",
      "width": "500",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Corey_Quinn_2019_02-2.png"
    },
    "biography": "Corey is the Chief Cloud Economist at The Duckbill Group, where he specializes in helping companies improve their AWS bills by making them smaller and less horrifying. He also hosts the \"Screaming in the Cloud\" and \"AWS Morning Brief\" podcasts; and curates \"Last Week in AWS,\" a weekly newsletter summarizing the latest in AWS news, blogs, and tools, sprinkled with snark and thoughtful analysis in roughly equal measure.",
    "website": {
      "name": "Last Week in AWS",
      "url": "https://www.lastweekinaws.com"
    }
  },
  "3673": {
    "name": "Jess Males",
    "title": "Sr Devops Engineer",
    "organization": "TriumphPay",
    "photo": null,
    "biography": "Having had his parents murdered before his eyes, as the family was going to the theatre, young Jess dedicated his life to fight crime. He now works as a systems administrator.",
    "website": {
      "name": "X47 Industries",
      "url": "http://www.x47industries.com/"
    }
  },
  "3740": {
    "name": "Peter Zaitsev",
    "title": "Founder",
    "organization": "Percona ",
    "photo": {
      "alt": null,
      "height": "1024",
      "width": "768",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/pz-768x1024.jpg"
    },
    "biography": "Peter Zaitsev is an entrepreneur and co-founder of Percona. As one of the foremost experts on Open Source strategy and database optimization, Peter leveraged both his technical vision and entrepreneurial skills to grow Percona from a two-person shop to one of the most respected open source companies in the business with staff members more than 350. Now Peter continues as a Board Member & Advisor in a range of open source startups. Peter is a co-author of High Performance MySQL: Optimization, Backups, and Replication, one of the most popular books on MySQL performance.",
    "website": {
      "name": "Percona",
      "url": "http://www.percona.com"
    }
  },
  "3759": {
    "name": "Scott Williams",
    "title": "Linux DevOps Engineer",
    "organization": "University of California Santa Barbara",
    "photo": {
      "alt": null,
      "height": "1938",
      "width": "1389",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/IMG_20220324_181625_023.jpg"
    },
    "biography": "Scott Williams is a senior DevOps Engineer at University of California (previously Azusa Pacific University and Claremont McKenna College).  He contributes to a number of open source software projects and Linux distributions and is an Ambassador for the Fedora Project, representing Fedora at SCaLE since 2010.",
    "website": null
  },
  "3867": {
    "name": "Gregory Farnum",
    "title": "CephFS Engineering Manager",
    "organization": "IBM",
    "photo": {
      "alt": null,
      "height": "2743",
      "width": "3938",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/IMG_0301.JPG"
    },
    "biography": "Greg Farnum is a long-standing member of the core Ceph development team, having joined the project as the third full-time engineer after graduating from Harvey Mudd College in 2009. He has served in many roles as Ceph grows, is one of the original Inktank engineers, and is currently a member of the technical Ceph Leadership Team and manager of IBM's CephFS group. Greg is passionate about solving problems in distributed computing and expanding the Ceph community.",
    "website": null
  },
  "4056": {
    "name": "Michael Starch",
    "title": "Flight Software Engineer",
    "organization": "Jet Propulsion Laboratory, California Institute of Technology",
    "photo": {
      "alt": null,
      "height": "716",
      "width": "608",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/portrait.jpg"
    },
    "biography": "Many years ago amongst the snow drifts and tundra of the great frozen north, Michael Starch earned his Bachelor’s degree in Computer Engineering from the University of Michigan. Leaving his beloved homeland behind, he started a career at NASA's Jet Propulsion Laboratory in sunny Pasadena. He has remained there ever since working as a developer, operator, engineer, and open source community manager on a myriad of projects and missions. He also mentors at San Marino High School on Fridays. Over the years, Michael has dabbled in big data research, ultra scale cloud computing, high-end data systems, and software destined for space. Currently he is working on embedded frameworks applicable to NASA's small-scale spacecraft, and is applying those frameworks to robots bound for other worlds. Michael is a member of the Apache Software foundation and has volunteered for the ScaleAV team for many years right here at the Southern California Linux Expo.",
    "website": null
  },
  "4063": {
    "name": "Alison Chaiken",
    "title": null,
    "organization": null,
    "photo": {
      "alt": null,
      "height": "222",
      "width": "219",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/headshot_Jul2023.jpg"
    },
    "biography": "Alison is an automotive systems programmer and kernel engineer and has worked at Nokia, Mentor Graphics, Peloton Technology and Aurora Innovation. In 2014-2015, she collaborated on-site with a customer in Germany. Alison has spoken at events including ELC and ELCE, USENIX, LibrePlanet, linux.conf.au, Automotive Linux Summit, SCALE and Maker Faire.  She lives in Mountain View , CA where she rides bikes, attends concerts, drinks beer and studies German.",
    "website": {
      "name": "she-devel.com",
      "url": "http://she-devel.com/"
    }
  },
  "4302": {
    "name": "Nathan Haines",
    "title": "Community Council Member",
    "organization": "Ubuntu",
    "photo": {
      "alt": null,
      "height": "1920",
      "width": "1920",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/P1388706_glasses_fix-square-scale.jpg"
    },
    "biography": "Nathan Haines is an author, instructor, and computer consultant who fell in love with Ubuntu in 2005, and helped found the Ubuntu California Local Community Team to share that excitement with others. As the leader of the California team and a member of the Ubuntu Local Community Council, he works to help others support and share Ubuntu worldwide. His mission to educate and excite people about Free Software and Ubuntu continues with his book, Beginning Ubuntu for Windows and Mac Users.",
    "website": {
      "name": "nhaines.com",
      "url": "https://www.nhaines.com/"
    }
  },
  "4895": {
    "name": "Keith Fiske",
    "title": "Senior Database Engineer",
    "organization": "Crunchy Data",
    "photo": null,
    "biography": "Senior Database Engineer with Crunchy Data Solutions. Author of several popular 3rd-party PostgreSQL tools such as pg_partman, mimeo, & pg_extractor",
    "website": {
      "name": "http://www.keithf4.com",
      "url": "http://www.keithf4.com"
    }
  },
  "4908": {
    "name": "Brian Monroe",
    "title": "Ambassador",
    "organization": "Fedora",
    "photo": {
      "alt": null,
      "height": "526",
      "width": "649",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/coffee.png"
    },
    "biography": "I'm a recovering Music Education major that's currently working as a SysAdmin for University of California. Been a Fedora user since Fedora 12 and an Ambassador since Fedora 15. I've been a Fedora Jam (Pro Audio focused spin) contributor since it's conception, and I own way too many guitars.",
    "website": {
      "name": "Fedora",
      "url": "http://www.fedoraproject.org"
    }
  },
  "4919": {
    "name": "Perry Rivera",
    "title": null,
    "organization": null,
    "photo": {
      "alt": null,
      "height": "1374",
      "width": "1374",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/PERRY.jpg"
    },
    "biography": "I motivate, mobilize, and connect cross-functional teams with technical solutions and support and provide customer-focused Computer Professional services with System Administrator experience in commercial and non-profit industries. I deliver system, network, and security support in a wide variety of business and home environments. I partner with clients for training and end-developer support efforts, especially in the areas of configuration management, operating system integration efforts and cluster computing.",
    "website": null
  },
  "4930": {
    "name": "Michael Coté",
    "title": null,
    "organization": "Pivotal",
    "photo": {
      "alt": null,
      "height": "256",
      "width": "204",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/9606152719_c2659a40c9_b.jpg"
    },
    "biography": "Michael Coté works at Pivotal in technical marketing. He’s been an industry analyst at 451 Research and RedMonk, worked in corporate strategy and M&A at Dell in software and cloud, and was a programmer for a decade before all that. He blogs and podcasts at Cote.io and is @cote in Twitter.",
    "website": {
      "name": "http://www.cote.io",
      "url": "http://www.cote.io"
    }
  },
  "4942": {
    "name": "Duane O'Brien",
    "title": "Head of Open Source",
    "organization": "Indeed, Inc",
    "photo": {
      "alt": null,
      "height": "800",
      "width": "800",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Duane-Headshot-Small-2019.jpg"
    },
    "biography": "Duane O’Brien is the Head of Open Source at , the world’s #1 jobs site. He is passionate about helping companies responsibly participate in the open source community. He is the creator of the , a program that enables open source contributors to direct financial support to free and open source software used by their employers.\n \n \n Indeed.com FOSS Contributor Fund",
    "website": null
  },
  "4967": {
    "name": "Harlan Stenn",
    "title": "Founder",
    "organization": "Network Time Foundation",
    "photo": {
      "alt": null,
      "height": "2049",
      "width": "1537",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/HarlanDeskCartoon.jpg"
    },
    "biography": "A well-versed entrepreneur, Harlan has blah blah blah for decades.  At some point during the 1980s, he started using and submitting bug fixes and portability improvements to the Network Time Protocol codebase.  He has worked directly with NTP since 1992, and in 1996 became NTP’s Project Manager and Release Engineer. In 2011 he created Network Time Foundation to provide bring together and nurture collaborative Open Source projects that focus on Network Time.\nThe first project to join was, of course, the NTP Project.  Shortly thereafter the PTPd, RADclock and Linux PTP projects joined, followed by NTF's General Timestamp API Project, the Ntimed Project, the libptpmgmt Project, the Khronos Project, and several SyncE projects. He has been active in open-source communities since 1976.",
    "website": {
      "name": "Network Time Foundation",
      "url": "http://www.networktimefoundation.org"
    }
  },
  "5081": {
    "name": "Dave Nielsen",
    "title": "Senior Director, Developer Relations - Head of AI Community Engagement",
    "organization": "MongoDB",
    "photo": {
      "alt": null,
      "height": "1799",
      "width": "1799",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/dave_nielsen_look.jpeg"
    },
    "biography": "As Head of AI Community Engagement, Dave runs events such as hackathons that help developers learn how to use GenAI developer tools like LLMs and MongoDB Vector Search.  Dave graduated from Cal Poly: SLO and has worked in developer relations at companies like PayPal, Strikeiron, Redis, Intel, Traceable, Dremio, Harness and now MongoDB. Dave gained modest notoriety when he proposed to his girlfriend in the book \"PayPal Hacks\"",
    "website": {
      "name": "MongoDB AI Community",
      "url": "http://mongodb.com/community/ai"
    }
  },
  "5100": {
    "name": "maddog Hall",
    "title": "President",
    "organization": "Linux International",
    "photo": {
      "alt": null,
      "height": "475",
      "width": "700",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/535788_10150859226682025_1722401621_n.jpg"
    },
    "biography": "Jon \"maddog\" Hall is the President and Executive Director of Linux International (), an association of computer users who wish to support and promote the Linux Operating System.  maddog is also the Board Chair of the Linux Professional Institute (lpi.org).\n \n www.li.org During his career in commercial computing which started in 1969, Mr. Hall has been a programmer, systems designer, systems administrator, product manager, technical marketing manager, author and educator. \n    He has worked for such companies as Western Electric Corporation, Aetna Life and Casualty, Bell Laboratories, Digital Equipment Corporation, VA Linux Systems, SGI and Linaro. He currently works as an independent consultant, and is currently involved with bringing environmentally friendly computing to emerging marketplaces through Project Cauã ().\n \n www.projectcaua.org",
    "website": null
  },
  "5109": {
    "name": "David vonThenen",
    "title": "Software Engineer/Developer Advocate",
    "organization": "Deepgram",
    "photo": {
      "alt": null,
      "height": "599",
      "width": "660",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/head-shot-small.png"
    },
    "biography": "Lead Software Engineer/Developer Advocate in AI/ML who enables others to be successful by being a partner in building projects, products, and integrations through writing code, documentation, and videos to provide understanding via easy-to-consume content. I have a background in storage drivers/firmware/management, backup and recovery solutions for virtualized environments, I'm a contributor to Kubernetes and many Cloud Native Computing Foundation (CNCF) projects, and I'm currently in the Conversational AI/ML field! Please reach out and ask me anything! \n    Open Source Contributions: \nFollow me on Twitter: \nLinkedIn: \nBlog: \n \n \n \n \n \n \n \n \n \n \n http://www.github.com/dvonthenen http://www.twitter.com/dvonthenen https://linkedin.com/in/davidvonthenen https://davidvonthenen.com",
    "website": {
      "name": "David's Technobabble Blog",
      "url": "https://davidvonthenen.com/"
    }
  },
  "5167": {
    "name": "Magnus Hagander",
    "title": null,
    "organization": "Redpill Linpro",
    "photo": null,
    "biography": "Magnus Hagander is a member of the PostgreSQL Core Team and a developer and code committer in the PostgreSQL Global Development Group. Magnus is one of the original developers of the Windows port of PostgreSQL. These days, he mostly works on other parts of the PostgreSQL backend, recently with a focus on security features, monitoring and backup/replication interfaces and tools. He is also one of the core members of the postgresql.org infrastructure team, maintaining the servers that power the project, and one of the maintainers of the postgresql.org website. He's been a PostgreSQL user since version 6 (with some non-serious use of Postgres 95 before that), and currently serves on the Core Team and as President of the Board for PostgreSQL Europe. To pay the bills, he is a PostgreSQL and open source software consultant at Redpill Linpro in Stockholm, Sweden, where he works on consulting, support and training service.",
    "website": {
      "name": "https://blog.hagander.net/",
      "url": "https://blog.hagander.net/"
    }
  },
  "5232": {
    "name": "Nina Kin",
    "title": "Tech Lead",
    "organization": "LA Metro",
    "photo": {
      "alt": null,
      "height": "682",
      "width": "683",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/headshot_17.jpg"
    },
    "biography": "Nina Kin is the Technical Lead for LA Metro’s Digital Services Team. With over 15 years in local government and a background in software engineering, she is determined to make government work better for the public. Outside of Metro, Nina serves as a Board Member for MobilityData and is on the organizing team for several government/tech/data events, such as Data + Donuts LA, MaptimeLA, the LA Arts Datathon, and the International Humanitarian Mapathon. When she’s not in front of a computer, you’ll find Nina exploring neighborhoods by foot, bike, or public transit. She also enjoys learning new crafting skills, playing the violin, and practicing taiko drumming with the JTown Taiko Club. A proud alumna of UC Berkeley, Nina holds a B.S. in Electrical Engineering and Computer Science.",
    "website": null
  },
  "5305": {
    "name": "Chris McKenzie",
    "title": "programmer",
    "organization": null,
    "photo": {
      "alt": null,
      "height": "2005",
      "width": "1399",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/PXL_20220919_071323558.PORTRAIT_2%20%281%29.jpg"
    },
    "biography": "Chris has been a Linux user since the 90s, is a computer historian and has given talks and manned booths in Scales past. He's been involved in LUGs off and on since about 2000, an avid open source developer and deeply values accurate historical narratives.",
    "website": {
      "name": "personal homepage",
      "url": "http://9ol.es"
    }
  },
  "5307": {
    "name": "Tejun Heo",
    "title": "Software Engineer",
    "organization": "facebook inc",
    "photo": {
      "alt": null,
      "height": "960",
      "width": "960",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/12417712_1018703618168561_7605952801434749317_n.jpg"
    },
    "biography": "Tejun has been working on various aspects of Linux kernel since 2005 and is currently maintaining libata, percpu memory allocator, workqueue, and control group. He currently works as a software engineer for Facebook.",
    "website": null
  },
  "5419": {
    "name": "Michael Gat",
    "title": "Technology Program Manager",
    "organization": "x-AWS",
    "photo": {
      "alt": null,
      "height": "800",
      "width": "800",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/MichaelGat-Oct07-052_800sq.jpg"
    },
    "biography": "Michael Gat was a Tech Program Manager at AWS, where he managed capacity and efficiency programs for the Application Networking organization, and later worked for customer billing. Previously, Michael consulted to midsize businesses transitioning to cloud architectures and was a developer of financial systems. Michael has a BA in CS from Columbia and an MBA from UCLA. He serves on the SCaLE Program Committee, lives in Seattle, and attends to the whims of multiple cats.",
    "website": {
      "name": "Michael Gat Blog",
      "url": "https://michaelgat.com"
    }
  },
  "5459": {
    "name": "Darren Cole",
    "title": " Software Developer",
    "organization": null,
    "photo": {
      "alt": null,
      "height": "2448",
      "width": "1882",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/20230307%20Coloring%20FILE%20SIZE%20SHRINK.jpg"
    },
    "biography": "Husband, Father, Computer Programmer. 20+ years experience in software development. 20+ of technology and programming as a hobby. Always tended towards trying to make his software deploy better. Doing DevOps coming from programmer side even before it was called that. Security perspective permanently bent from work on MLS high assurance trusted operating systems.",
    "website": null
  },
  "5545": {
    "name": "Guinevere Saenger",
    "title": "Software Engineer",
    "organization": "Samsung SDSA",
    "photo": {
      "alt": null,
      "height": "1668",
      "width": "1583",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/guin_portrait.png"
    },
    "biography": "In 2016, Guinevere Saenger transitioned from being a full-time professional pianist to a career in tech. To do so, she obtained a spot at the highly competitive Ada Developers Academy in Seattle, a year-long, tuition-free, bootcamp-style software development training program for women and nonbinary people making a mid-life career switch into tech. As part of her training, Guinevere interned at Samsung SDS on the Cloud Native Computing Team, where, after graduating in July 2017, she accepted a full-time software engineer position working on Kubernetes deployment tools such as Kraken. Making her home in the beautiful Pacific Northwest, Guinevere enjoys music, food, and the outdoors.",
    "website": {
      "name": "https://guincodes.blogspot.com/",
      "url": "https://guincodes.blogspot.com/"
    }
  },
  "5595": {
    "name": "Brian Six",
    "title": "Technical Sales Engineer",
    "organization": "SUSE",
    "photo": null,
    "biography": "Brian Six is a 20+ year veteran at SUSE/Micro Focus/Novell.   As a Computer Science major, Brian has gone from developer to consultant to systems engineer.  When he is not traveling for SUSE, he is either shuttling his grade school kids to their activities or walking his Avocado grove making sure the trees are happy.  Mixing the tech world with family and the farm.",
    "website": null
  },
  "5616": {
    "name": "Matthias Crauwels",
    "title": "Enterprise Customer Engineer",
    "organization": "PlanetScale",
    "photo": {
      "alt": null,
      "height": "2048",
      "width": "1853",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/11357147_10153265154758686_39859391293096838_o.jpg"
    },
    "biography": "Since the age of 10 I’ve always been passionate about computers. I’ve been working with them ever since. In 2005 I got my degree in computer science. I used to work at a major Belgian university where I was developing the e-learning applications. In that position, I was the one who looked after the databases. From there on I grew to be their MySQL DBA. In 2017 I left the university and joined Pythian as a MySQL Database Consultant. Currently I am working at PlanetScale to support large enterprise type customers running MySQL at scale.",
    "website": null
  },
  "5618": {
    "name": "Kyler Chin",
    "title": "Executive Director",
    "organization": "Catenary Maps",
    "photo": {
      "alt": null,
      "height": "1036",
      "width": "843",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Screenshot_20240102_104144_Chrome.jpg"
    },
    "biography": null,
    "website": null
  },
  "5644": {
    "name": "Tyler Menezes",
    "title": "Executive Director",
    "organization": "CodeDay",
    "photo": {
      "alt": null,
      "height": "1000",
      "width": "1000",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/press_1_sq.jpg"
    },
    "biography": "Tyler Menezes is the Executive Director at CodeDay, where he works to increase diverse Computer Science enrollment across North America by inspiring underrepresented students to give coding a try. Born in Canada but raised in the Pacific Northwest, he briefly attended the University of Washington before dropping out to start a Y Combinator and venture-backed social video startup in 2011. This, combined with stints working in machine learning at Microsoft Research and as a programmer at several Seattle startups, led to his work finding data-driven solutions to increasing CS diversity and enrollment since 2014.",
    "website": {
      "name": "Website",
      "url": "https://www.codeday.org/"
    }
  },
  "5701": {
    "name": "Robert Hernandez",
    "title": "Software Engineer",
    "organization": "Martincoit Networks",
    "photo": {
      "alt": null,
      "height": "400",
      "width": "400",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/profile-400.jpg"
    },
    "biography": "Rob is an engineer at Martincoit Networks working to build next generation applications atop next generation networks such as SCION. He received his B.S. in Computer Information Systems from Chapman University. In his free time, he volunteers for the open source community-run conference: Southern California Linux Expo. If he’s not contributing to open source projects, you can catch him participating in sailing races around California or tinkering with digital modes on his HAM radio.",
    "website": {
      "name": "Github",
      "url": "https://github.com/sarcasticadmin/"
    }
  },
  "5752": {
    "name": "Jonathan Haddad",
    "title": "Consultant",
    "organization": "Rustyrazorblade Consulting",
    "photo": {
      "alt": null,
      "height": "190",
      "width": "190",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/jon-haddad.png"
    },
    "biography": "Jon Haddad has 20 years experience in both development and operations. Jon has worked on the database teams at both Apple and Netflix as well as helped hundreds of organizations as a consultant working with Apache Cassandra.",
    "website": {
      "name": "rustyrazorblade",
      "url": "http://rustyrazorblade.com/"
    }
  },
  "5771": {
    "name": "Jonathan Katz",
    "title": "Principal Product Manager - Technical",
    "organization": "AWS",
    "photo": {
      "alt": null,
      "height": "128",
      "width": "114",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/headshot17.jpg"
    },
    "biography": "Jonathan Katz is a Principal Product Manager Technical at AWS for Amazon RDS. Prior to this, he was the VP of Platform Engineering at Crunchy Data, focused on managing PGO, an open source Postgres Operator. Jonathan is a member of the PostgreSQL Core Team and involved in various governance aspects of the PostgreSQL Global Development Group. He serves as a Secretary and Director of the nonprofit PostgreSQL Community Association of Canada and is a Director of the nonprofit United States PostgreSQL Association. Jonathan enjoys building applications with PostgreSQL and revels in showing off all of the wonderful features of PostgreSQL. Prior to Crunchy Data, Jonathan was CTO at VenueBook, and before that, VP of Technology at Paperless Post. At both companies Jonathan developed robust platforms using PostgreSQL, taking advantage of its many features, from complex data types to its ability to stream logical changes. Jonathan graduated from Tufts University with a B.S. in Mathematics.",
    "website": {
      "name": "AWS",
      "url": "https://aws.amazon.com/"
    }
  },
  "5783": {
    "name": "Cornelius Kölbel",
    "title": null,
    "organization": "privacyIDEA project",
    "photo": {
      "alt": null,
      "height": "1060",
      "width": "1590",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/web_cornelius.jpg"
    },
    "biography": "Cornelius is into multi factor authentication since 2004. He is the project lead of the MFA system privacyIDEA. As a consultant he learnt to unterstand customers requirements in heterogenous networks. He planned and implemented several PKIs for smartcard usage and was one of the first to work on the interoperability of the Aladdin eToken. In 2006 he started one of the the first open source one time password systems. In 2009 he initiated an enterprise OTP solution. In 2014 he kicked off the privacyIDEA project. It is a vendor independent authentication system, which can be used to manage arbitrary authentication objects for multi factor authentication. privacyIDEA supports authentication protocols like PAM, RADIUS, SAML or LDAP. In 2014 he also founded the company NetKnights to provide consultancy for strong authentication. Cornelius spoke at several conferences in Germany, in the Netherlands, in Belgium (FOSDEM), in Denmark and in the U.S.",
    "website": {
      "name": "privacyIDEA project",
      "url": "https://privacyidea.org"
    }
  },
  "5883": {
    "name": "Richard Yen",
    "title": "Principal Support Engineer",
    "organization": "EnterpriseDB",
    "photo": {
      "alt": null,
      "height": "200",
      "width": "200",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/d2583945d34a001495d01fcd2266c86f.jpg"
    },
    "biography": "Richard has been using PostgreSQL since v. 7.4 in 2003.  He is a Principal Support Engineer at EnterpriseDB, providing technical support to DBAs and developers around the world, and works with many clients ranging from private corporations to government organizations and financial institutions.",
    "website": {
      "name": "http://richyen.com",
      "url": "http://richyen.com"
    }
  },
  "5907": {
    "name": "Nicolas Fränkel",
    "title": "Head of Developer Advocacy",
    "organization": "Apache APISIX",
    "photo": {
      "alt": null,
      "height": "1490",
      "width": "1862",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/id_7.jpeg"
    },
    "biography": "Developer Advocate with 15+ years experience consulting for many different customers, in a wide range of contexts (such as telecoms, banking, insurances, large retail and public sector). Usually working on Java/Java EE and Spring technologies, but with focused interests like Rich Internet Applications, Testing, CI/CD and DevOps. Also double as a trainer and triples as a book author.",
    "website": {
      "name": "Personal Blog",
      "url": "https://blog.frankel.ch/"
    }
  },
  "5930": {
    "name": "Rob Weber",
    "title": "Embedded Software Engineer",
    "organization": "Cents",
    "photo": {
      "alt": null,
      "height": "180",
      "width": "180",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/IMG_7532%281%29.jpg"
    },
    "biography": "Rob Weber is an Embedded Software Engineer with several years of development experience in the consumer electronics industry. He enjoys building transformative IoT products that integrate hardware features with cloud services, especially if it can be built using Go. Rob became an embedded software engineer with the help of the e-ALE course at SCALE 16x, and loves the challenges and excitement of embedded development.\nRob joined Cents in the Spring of 2023 to help build powerful software tools and hardware solutions for improving laundry businesses. He works with Go, C, Yocto, Linux, and custom hardware on a daily basis. When he's not coding, you can find him biking around Los Angeles, enjoying live music, or relaxing on the beach.",
    "website": {
      "name": "@robbawebba",
      "url": "https://github.com/robbawebba"
    }
  },
  "6018": {
    "name": "Gareth J. Greenaway",
    "title": "Senior Software Engineer",
    "organization": "VMware",
    "photo": {
      "alt": null,
      "height": "768",
      "width": "615",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/sched-headshot-small.jpg"
    },
    "biography": "Gareth is the senior software developer at VMware working on the Salt project.  Gareth lives in Southern California with his wife, where they are owned by several pets.",
    "website": {
      "name": "VMware",
      "url": "https://saltproject.io/"
    }
  },
  "6031": {
    "name": "Heather Osborn",
    "title": "Sr. Dir. DevOps",
    "organization": "Cerebral",
    "photo": {
      "alt": null,
      "height": "3600",
      "width": "2400",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/JS9_3215.jpg"
    },
    "biography": "Heather Osborn, Sr. Director DevOps, Cerebral Heather Osborn has been working in technology as a system and operations engineer and manager for the last 25 years, moving from physical to cloud infrastructure.  Heather is an avid long distance runner who has lots of time to think about these things while pounding the pavement.",
    "website": null
  },
  "6034": {
    "name": "Alvaro Leiva",
    "title": null,
    "organization": "Meta",
    "photo": {
      "alt": null,
      "height": "1890",
      "width": "1262",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/received_433747241797907.jpeg"
    },
    "biography": "I love Coding, I grew up in a small town in Chile and one weekend, 16 years ago, I had the flu and could not go out. I decided to learn how to code in Python and that was the beginning of the road that would moved us all to the Northern California so that I could join the Production Engineering team at Instagram. Also like eating, drinking and cooking (in that order).",
    "website": null
  },
  "6036": {
    "name": "Jon Cruz",
    "title": "Chief Agitator",
    "organization": "Inkscape",
    "photo": {
      "alt": null,
      "height": "256",
      "width": "256",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Cruz_Jon_sm.jpg"
    },
    "biography": "Jon A. Cruz is a professional developer with over 20 years of experience, working extensively in multimedia, including programming and 3D art creation, and has developed for a wide variety of platforms. Work includes R&D for mobile and other devices, servers for large mail and messaging systems, enterprise security applications, and user interface design and development.. He had participated as a mentor in Google's Summer of Code since its first year with Inkscape and recently also for OpenICC. He has presented at many conferences including Linux.conf.au, the Libre Graphics Meetings, OSCON and others including the SCALE where he also a common presence in the expo hall helping to represent Inkscape and other Libre Graphics efforts..",
    "website": null
  },
  "6059": {
    "name": "Davide Cavalca",
    "title": "Production Engineer",
    "organization": "Meta",
    "photo": null,
    "biography": "Davide Cavalca is a Production Engineer at Meta on the Linux team. Davide has been working in the systems space for over 15 years, always with a strong focus towards open source and automation.",
    "website": {
      "name": "Meta Linux Open Source",
      "url": "https://opensource.fb.com/linux/"
    }
  },
  "6203": {
    "name": "John Engelke",
    "title": "Senior Data Systems Software Dev Specialist",
    "organization": "Jet Propulsion Laboratory,  California Institute of Technology",
    "photo": {
      "alt": null,
      "height": "200",
      "width": "200",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/test-head.jpg"
    },
    "biography": "With experience writing software and managing teams for leading Web companies (Edmunds, Intuit), plus new concept startups, John has a strong background in Web software engineering and release management. He has worked with concurrent, real-time systems developing DB-enabled Java and Python applications. John currently serves as lead developer for  and devops specialist for the  at . Recent experience managing devops teams for a gaming startup inspired innovative solutions to multiplatform problems. Past experience also includes stints as a systems administrator at a regional university. \n \n \n \n NASA's Exoplanet Watch Mars 2020 Perseverance Rover Jet Propulsion Laboratory",
    "website": {
      "name": "NASA Exoplanet Watch",
      "url": "https://exoplanets.nasa.gov/exoplanet-watch/"
    }
  },
  "6658": {
    "name": "Jen Diamond",
    "title": "software developer",
    "organization": "UCLA",
    "photo": {
      "alt": null,
      "height": "3264",
      "width": "2448",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/PXL_20231030_184342199.PORTRAIT_0.jpg"
    },
    "biography": "Jen Diamond works on the application team at UCLA's Digital Initiatives and Information Technology Department. She is part of a team that is building the UCLA Digital Library. She has a background as a community organizer, instructor and an advocate to get more women into the programming world by organizing workshops like Rails Girls Los Angeles, Railsbridge and Kids Ruby.",
    "website": {
      "name": "UCLA Digital Library",
      "url": "https://digital.library.ucla.edu/"
    }
  },
  "9686": {
    "name": "Mark Wong",
    "title": "Major Contributor",
    "organization": "PostgreSQL",
    "photo": {
      "alt": null,
      "height": "866",
      "width": "866",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/mark-sq_1.png"
    },
    "biography": "Mark Wong is a Performance Engineer at EDB and is a PostgreSQL Major Contributor. He first introduced himself to the PostgreSQL community in 2003 with open source benchmarking kits and performance data. Since then, he has continued to contribute to various aspects of the community such as a Google Summer of Code mentor, Conference Organizer, Portland PostgreSQL Users Group Co-Organizer, PostgreSQL Fundraising Group Member, and a Director on the Board of the United States PostgreSQL.",
    "website": null
  },
  "9719": {
    "name": "Cali Dolfi",
    "title": "Data Scientist ",
    "organization": "Red Hat ",
    "photo": {
      "alt": null,
      "height": "2985",
      "width": "3050",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/CD.jpg"
    },
    "biography": "Cali Dolfi is a Data Scientist in the Open Source Program Office at Red Hat. Her work focuses on changing the way we look at open source communities through the lens of data science and machine learning. Outside of data science, her passion lies in making careers in technology more accessible for underrepresented groups by mentoring college students and developing accessible academic resources. Cali is a recent graduate of Boston University where she was a Teachers Fellow, collegiate athlete, and focused her studies on cryptography and data ethics. In her free time, she loves to weightlift, hike, and cook.",
    "website": {
      "name": "Linkedin ",
      "url": "http://www.linkedin.com/in/calidolfi"
    }
  },
  "9835": {
    "name": "David Southwell",
    "title": "Founder",
    "organization": "Deft Computing",
    "photo": {
      "alt": null,
      "height": "3088",
      "width": "2316",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/IMG_8112.jpg"
    },
    "biography": "Dave's favorite questions are, how does it work, how can I help and how can we make it beautiful and he's been using these questions to guide him throughout his life.  Going back to his childhood days plunking away at his Pop's IBM 5150 or Grandpa's TRS 80 he's been fascinated with technology and parlayed that early experience into various engineering positions at Sun Microsystems, Oracle and many others after.  More recently you'll find him talking about his love of abstractions and how they relate to computing in the form of the cloud... Kubernetes, Containers, Jails, LDOMS, oh my.  He has strong opinions, held weakly and believes that honest, vigorous debate is the ideal way to acquire knowledge.  He's no stranger to the stage or spotlight and looks forward to contributing SCALE as a presenter.",
    "website": null
  },
  "10058": {
    "name": "Brittany Istenes",
    "title": "Manager - Open Source Program Office",
    "organization": "Fannie Mae",
    "photo": {
      "alt": null,
      "height": "534",
      "width": "524",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Screen%20Shot%202021-04-21%20at%201.07.20%20PM%20copy.png"
    },
    "biography": "Brittany has led open source advisory councils, open source ambassador programs, open source contributions, InnerSource programs and the OSS gray areas in between at scale within large companies. Brittany currently is the co-chair for both the FINOS Open Source Readiness SIG and InnerSource SIG as well as sits on the Steering Committee with the ToDo Group.  At Fannie Mae as the OSPO strategist, Brittany is sharing these best practices for OSS and InnerSource with the teams across the enterprise. Her main goal is to create a frictionless developer/centric environment in a way helps development to be better, faster, secure and innovative within FINTECH.",
    "website": {
      "name": "LinkedIn",
      "url": "https://www.linkedin.com/in/brittany-istenes-91b902152/"
    }
  },
  "10065": {
    "name": "Kyle Davis",
    "title": "Senior Developer Advocate",
    "organization": "AWS",
    "photo": {
      "alt": null,
      "height": "160",
      "width": "120",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/headshot_0.jpeg"
    },
    "biography": "Kyle Davis is the Senior Developer Advocate for Bottlerocket at AWS. Kyle has a long history with software development and databases and was a founding contributor to the OpenSearch project. When not working, Kyle enjoys 3D printing, and getting his hands dirty in his Edmonton, Alberta-based home garden.",
    "website": {
      "name": "Mastodon",
      "url": "https://fosstodon.org/@linux_mclinuxface"
    }
  },
  "10077": {
    "name": "Darryl Hwang",
    "title": "PAPRa Product Lead",
    "organization": "Tetra Bio",
    "photo": null,
    "biography": null,
    "website": {
      "name": "https://www.tetrabio.org/",
      "url": "https://www.tetrabio.org/"
    }
  },
  "10109": {
    "name": "Anita Zhang",
    "title": "Software Engineering Manager",
    "organization": "Meta",
    "photo": {
      "alt": null,
      "height": "800",
      "width": "800",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/headshot2022_800.png"
    },
    "biography": "Anita Zhang is the software engineering manager of Meta's Linux Userspace team. Her team connects Meta's infrastructure with the open source community. She is active on the systemd project and continues to support systemd at Meta as part of their userspace efforts.",
    "website": null
  },
  "10276": {
    "name": "Carl George",
    "title": null,
    "organization": null,
    "photo": {
      "alt": null,
      "height": "300",
      "width": "300",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/carl-2023-square.jpg"
    },
    "biography": "Carl George is the EPEL team lead in the Community Platform Engineering (CPE) group at Red Hat.  He is active in the EPEL, Fedora, and CentOS communities.",
    "website": null
  },
  "10297": {
    "name": "Tony Loehr",
    "title": "Developer Advocate",
    "organization": "Cycode",
    "photo": null,
    "biography": "Tony Loehr is the Developer Advocate for Cycode. Their prerogative is to make it easy for developers to use the Cycode platform, and to help protect data through knowledge sharing. They have professional experience with engineering, marketing, and sales and bring a unique perspective on how to implement comprehensive cybersecurity solutions. They value being a lifelong learner, and aim to help teach cybersecurity solutions to people with varying degrees of technical knowledge. In their free time, Tony enjoys tending houseplants, freestyle rapping, and working on various side projects.",
    "website": null
  },
  "10557": {
    "name": "Mandi Walls",
    "title": "DevOps Advocate",
    "organization": "PagerDuty",
    "photo": {
      "alt": null,
      "height": "800",
      "width": "735",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/MandiWalls-735x800.jpg"
    },
    "biography": "Mandi Walls is a DevOps Advocate at PagerDuty. For PagerDuty, she helps technology organizations increase their effectiveness with modern IT practices and unplanned incidents. She is a regular speaker at technical conferences when she isn’t podcasting, streaming, or writing about PagerDuty. She is interested in the emergence of new tools and workflows to make the task of operating large complex computing systems more approachable.",
    "website": {
      "name": "About Me",
      "url": "https://about.me/lnxchk"
    }
  },
  "10610": {
    "name": "Fatima Taj",
    "title": "Senior Software Engineer",
    "organization": "Yelp",
    "photo": {
      "alt": null,
      "height": "1058",
      "width": "1080",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Profile%20Picture.jpeg"
    },
    "biography": "Fatima is a graduate of the University of Waterloo, Canada. Post graduation, she's worked full-time as a Software Developer at DRW, a trading firm, and currently works at Yelp as a Senior Software Engineer.",
    "website": null
  },
  "10628": {
    "name": "Kerim Satirli",
    "title": "Sr. Developer Advocate",
    "organization": "HashiCorp",
    "photo": {
      "alt": null,
      "height": "533",
      "width": "533",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/kerim-satirli.jpg"
    },
    "biography": "Kerim is a senior developer advocate at HashiCorp, where he coaches operators and developers on sustainable infrastructure and orchestration workflows. Before he joined HashiCorp, Kerim worked on Industrial IoT for the Amsterdam airport and helped museums bring more of their collections online. When Kerim isn't working, he's either spending time with his daughter, enjoying aerial photography, or baking a cake.",
    "website": null
  },
  "10630": {
    "name": "Scott Stroz",
    "title": "MySQL Developer Advocate",
    "organization": "Oracle",
    "photo": {
      "alt": null,
      "height": "500",
      "width": "500",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/me_7.jpg"
    },
    "biography": "Scott is a developer with over 20 years of experience in various languages. During that time, the only constant in his development stack has been MySQL. He has a passion for sharing what he has learned on his coding journey so others may learn from his mistakes.",
    "website": {
      "name": "Scott Stroz",
      "url": "https://scottstroz.com"
    }
  },
  "10652": {
    "name": "Franck Pachot",
    "title": "Developer Advocate",
    "organization": "Yugabyte",
    "photo": {
      "alt": null,
      "height": "128",
      "width": "122",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/white.jpg"
    },
    "biography": "Developer Advocate for YugabyteDB, distributed SQL database using PostgreSQL query layer. Franck has a passion for learning and sharing in blog posts (blog.pachot.net), articles, conferences, and tech communities (AWS Data Hero and Oracle ACE Alumni)",
    "website": {
      "name": "blog",
      "url": "https://dev.to/franckpachot"
    }
  },
  "10662": {
    "name": "Nicolas Vermande",
    "title": "Head of Devrel",
    "organization": "Spectro Cloud",
    "photo": {
      "alt": null,
      "height": "596",
      "width": "833",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Screen%20Shot%202022-09-15%20at%2012.01.17%20PM.png"
    },
    "biography": "Nicolas is an experienced hands-on technologist, evangelist and product owner who has been working in the fields of Cloud-Native technologies, Open Source Software, Virtualization and Datacenter networking for the past 18 years. Passionate about enabling users and building cool tech solving real-life problems, you'll often see him speaking at global tech conferences and online events, spreading the word and walking the walk with customers and users.",
    "website": null
  },
  "10702": {
    "name": "Chunxu Tang",
    "title": null,
    "organization": null,
    "photo": {
      "alt": null,
      "height": "1280",
      "width": "1702",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/profile_13.jpg"
    },
    "biography": "Chunxu Tang is a Research Scientist at Alluxio and a committer of PrestoDB. Prior to Alluxio, he served as a Senior Software Engineer in Twitter’s data platform team, where he gained extensive experience with a wide range of data systems, including Presto, Zeppelin, BigQuery, and Druid. He received his Ph.D. in computer engineering from Syracuse University, where he conducted research on distributed collaboration systems and machine learning applications.",
    "website": null
  },
  "10712": {
    "name": "Nicholas Morey",
    "title": "Developer Advocate",
    "organization": "Akuity",
    "photo": {
      "alt": null,
      "height": "400",
      "width": "400",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/avitar.jpeg"
    },
    "biography": "Nicholas Morey is a Platform Engineer with a passion for DevOps practices. He is on the team at Akuity as a Developer Advocate, talking with the community about anything Argo Project related. He is an experienced Argo CD operator and a Certified Kubernetes Administrator.",
    "website": null
  },
  "10713": {
    "name": "Dwayne McDaniel",
    "title": "Developer Advocate",
    "organization": "GitGuardian",
    "photo": {
      "alt": null,
      "height": "900",
      "width": "600",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/dwayne-headshot.jpg"
    },
    "biography": "Dwayne has been working as a Developer Relations professional since 2015 and has been involved in tech communities since 2005. He loves sharing his knowledge, and he has done so, by giving talks at over a hundred events worldwide. Dwayne currently lives in Chicago. Outside of tech, he loves karaoke, live music, and performing improv.",
    "website": {
      "name": "Personal Website",
      "url": "https://dwayne-mcdaniel.com/"
    }
  },
  "10736": {
    "name": "Christopher Travers",
    "title": null,
    "organization": null,
    "photo": null,
    "biography": "Chris Travers has over twenty years of experience working with PostgreSQL as an application developer, database administrator and engineer, and IT manager.  He has worked with (and overseen teams which worked with) petabyte-scale implementations of PostgreSQL often replacing technologies like Elastic Search when scalability limits were reached there. At Adjust, Chris oversaw teams supporting the infrastructure and data management platforms that supported 700k requests a second and data environments storing over ten petabytes of data at high velocity.  He has also worked as a principal engineer at Delivery Hero, and at several other firms.",
    "website": null
  },
  "10752": {
    "name": "Kevin Dubois",
    "title": "Principal Developer Advocate",
    "organization": "Red Hat",
    "photo": {
      "alt": null,
      "height": "1963",
      "width": "1616",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/kevin.jpg"
    },
    "biography": "Kevin is a software engineer, author and international speaker with a passion for Open Source, Java (Quarkus), and Cloud Native Development & Deployment practices. He currently works as developer advocate at Red Hat where he gets to enjoy working with Open Source projects and improving the developer experience. He previously worked as a (Lead) Software Engineer at a variety of organizations across the world ranging from small startups to large enterprises and even government agencies. Kevin is actively involved in Open Source communities, contributing to projects such as Quarkus, Knative, Apache Camel, and Podman (Desktop); and as a member of the Belgian CNCF chapter as well as the Belgian Java User Group. Kevin speaks English, Dutch, French and Italian fluently and is currently based in Belgium, having lived in Italy and the USA as well. In his free time you can find Kevin somewhere in the wild hiking, gravel biking, snowboarding or packrafting.",
    "website": {
      "name": "Personal Blog",
      "url": "https://kevindubois.com/"
    }
  },
  "10755": {
    "name": "Chanchal Gupta",
    "title": null,
    "organization": "Edmunds",
    "photo": {
      "alt": null,
      "height": "600",
      "width": "600",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/IMG_2712_exif_clerared_low_ressed_resized_cloaked.png"
    },
    "biography": "Chanchal is a founding member of the Site Reliability Engineering (SRE) team at Edmunds.  He loves solving complex problems using technology and data.  He enjoys traveling, nature, and hiking in national parks.",
    "website": null
  },
  "10759": {
    "name": "Paige Cruz",
    "title": "Senior Developer Advocate",
    "organization": "Chronosphere",
    "photo": {
      "alt": null,
      "height": "320",
      "width": "229",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/KC%2BCNC_NA_headshot_231107_Paige_Cruz_4094%20Small.jpeg"
    },
    "biography": "Paige Cruz is a Senior Developer Advocate at Chronosphere passionate about cultivating sustainable on-call practices and bringing folks their aha moment with observability. She started as a software engineer at New Relic before switching to Site Reliability Engineering holding the pager for InVision, Lightstep, and Weedmaps. Off-the-clock you can find her spinning yarn, swooning over alpacas, or watching trash TV on Bravo.",
    "website": {
      "name": "Personal Site",
      "url": "https://www.paigerduty.com"
    }
  },
  "10761": {
    "name": "Tatiana Krupenya",
    "title": "CEO",
    "organization": "DBeaver Corporation",
    "photo": {
      "alt": null,
      "height": "400",
      "width": "400",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/small.png"
    },
    "biography": "Tatiana Krupenya has been the CEO of DBeaver for the last 6 years. She is a regular speaker and active participant in various open-source conferences. DBeaver is the main contributor and maintainer of the DBeaver Community Edition, an open-source product, a universal interface for working with almost all existing data sources. DBeaver is widely used globally. These days, more than 8 million users run DBeaver daily to connect to their databases.",
    "website": {
      "name": "dbeaver.com",
      "url": "https://dbeaver.com/"
    }
  },
  "10766": {
    "name": "Alkin Tezuysal",
    "title": "EVP - Global Services",
    "organization": "ChistaDATA Inc. ",
    "photo": {
      "alt": null,
      "height": "2661",
      "width": "2391",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/studyo%20objektif%20%281Mb%29.jpg"
    },
    "biography": "Alkin Tezuysal has extensive experience in open-source relational databases, working in various sectors for large corporations. With over 25 years of industry experience, he has acquired skills for managing large projects from the ground up to production. For the past decade, he's been focused on e-commerce, SaaS, and MySQL technologies. Alkin has managed and architected database topologies for high-volume sites. He has several years of experience in 24X7 support and operational tasks and improving database systems for major companies. He has led global operations teams on Tier 1/2/3 support for MySQL customers. He currently holds the EVP - Global Services position at fast-growing startup ChistaDATA Inc. He's also co-author of the  MySQL Cookbook 4th Edition.",
    "website": {
      "name": "ChistaDATA",
      "url": "http://www.chistadata.com"
    }
  },
  "10785": {
    "name": "Ryan Booz",
    "title": "PostgreSQL Advocate",
    "organization": "Redgate",
    "photo": {
      "alt": null,
      "height": "619",
      "width": "600",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/ryanb_headshot_square.jpg"
    },
    "biography": "Ryan is an Advocate at Redgate focusing on PostgreSQL. Ryan has been working as a PostgreSQL advocate, developer, DBA and product manager for more than 20 years, primarily working with time-series data on PostgreSQL and the Microsoft Data Platform. Ryan is a long-time DBA, starting with MySQL and Postgres in the late 90s. He spent more than 15 years working with SQL Server before returning to PostgreSQL full-time in 2018. He’s at the top of his game when he's learning something new about the data platform or teaching others about the technology he loves.",
    "website": {
      "name": "Software And Booz",
      "url": "https://www.softwareandbooz.com"
    }
  },
  "10792": {
    "name": "George Mulak",
    "title": "CTO",
    "organization": "TecKnowCare",
    "photo": {
      "alt": null,
      "height": "300",
      "width": "300",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/George%20Mulak%20Bio%20Pic.png"
    },
    "biography": "Having worked with technology for over 30 years I have been able to help a lot of people.  I have promoted customer computers.  I have set up and worked in computer labs and been an Ubuntu advocate for over 11 years.",
    "website": {
      "name": "Tec Know Care",
      "url": "http://www.tecknowcare.com"
    }
  },
  "10829": {
    "name": "Daniel Baker",
    "title": "Engineer",
    "organization": "Tweag",
    "photo": {
      "alt": null,
      "height": "800",
      "width": "800",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/IMG_4983_square_med.png"
    },
    "biography": "Daniel is engineer and mathematician turned software developer. He found a new passion in reproducible build systems and joined Tweag to create software focused on reproducibility. For the last year, he has been working on jupyterWith, a tool to make JupyterLab reproducible using the Nix ecosystem.",
    "website": null
  },
  "10846": {
    "name": "andrew fong",
    "title": "CEO",
    "organization": "Prodvana",
    "photo": {
      "alt": null,
      "height": "400",
      "width": "400",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/andrew.jpg"
    },
    "biography": "Andrew is currently one of the co-founders and CEO of Prodvana. Prodvana is on a mission to intelligently delivery your software with zero overhead. Previously Andrew was CTO of Vise, Vice President of Infrastructure at Dropbox, and spent time at YouTube and AOL. Additionally, he has contributed to the SRE community as a founding member of SRECon and has written a chapter in Orielly's Seeking SRE book.",
    "website": {
      "name": "Prodvana",
      "url": "http://www.prodvana.io"
    }
  },
  "10847": {
    "name": "Drew Gurkowski",
    "title": "Marketing Coordinator",
    "organization": "The FreeBSD Foundation",
    "photo": {
      "alt": null,
      "height": "1875",
      "width": "1500",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Drew_Gurkowski%20copy.jpg"
    },
    "biography": "Drew started working for the foundation as an intern in 2015 and continued as a consultant starting in 2018. He now works as a full-time marketing coordinator for the foundation.",
    "website": null
  },
  "10853": {
    "name": "Brendan O'Leary",
    "title": "Head of Community",
    "organization": "Project Discovery",
    "photo": {
      "alt": null,
      "height": "422",
      "width": "422",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/KC%2BCNC_NA_transparent.png"
    },
    "biography": "Brendan O'Leary is Head of Community at Project Discovery, and spends his time connecting with developers, security engineers, contributing to open source projects, and sharing his thoughts on cutting-edge technologies on conference panels, meetups, in contributed articles and on blogs.",
    "website": {
      "name": "Portfolio",
      "url": "https://boleary.dev"
    }
  },
  "10877": {
    "name": "Margaret Tucker",
    "title": "Policy Analyst",
    "organization": "GitHub",
    "photo": {
      "alt": null,
      "height": "667",
      "width": "1000",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/gh.jpeg"
    },
    "biography": "Margaret Tucker is a Policy Analyst at GitHub working on issues including intermediary liability, copyright, and open source security policy. Margaret is passionate about advocating for developers' interests to policymakers and hearing from developers about what policy issues matter to them. Prior to joining GitHub, Margaret was a Policy Fellow serving the Office of Science and Technology Policy and also worked as a Research Associate for Future Tense, a section of Slate covering the implications of emerging technologies.",
    "website": {
      "name": "GitHub Policy",
      "url": "https://github.com/about/developer-policy/"
    }
  },
  "10880": {
    "name": "NISHchint Raina",
    "title": "Production Engineer",
    "organization": "Meta Platforms, Inc.",
    "photo": {
      "alt": null,
      "height": "563",
      "width": "563",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/46520149_153211502306264_5864158074612219904_n.jpg"
    },
    "biography": "Nish is a Production Engineer at Meta in the Cloud Foundation team. The scope of his team's work spans running compute workloads in the Cloud for many applications running at Meta. Outside work Nish is also a photographer (). At SCaLE, Nish takes professional headsots at the Open Source Career Day.\n \n https://www.nish.photo",
    "website": null
  },
  "10882": {
    "name": "Shaun Hopper",
    "title": "Production Engineer",
    "organization": "Meta Platforms, Inc",
    "photo": {
      "alt": null,
      "height": "1000",
      "width": "1000",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/you.jpeg"
    },
    "biography": "Shaun is a Production Engineer at Meta, where they have been shaping integrations with the public cloud infrastructure landscape. Their focus lies in building intuitive platforms for container creation, Kubernetes management, and AMI deployment on EC2. Shaun's work is centered around making these technologies more accessible and efficient for developers, driving innovation and improving the ease of use in cloud computing at Meta.",
    "website": null
  },
  "10891": {
    "name": "Kevin Howell",
    "title": "Principal Software Engineer",
    "organization": "Red Hat",
    "photo": {
      "alt": null,
      "height": "1348",
      "width": "1348",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/headshot_2021_close.jpg"
    },
    "biography": "Kevin is a Principal Software Engineer at Red Hat building subscription functionality for console.redhat.com using Java, Quarkus, Spring Boot, OpenShift, and Kafka. Kevin is based out of Raleigh, NC.",
    "website": {
      "name": "Blog",
      "url": "https://kahowell.net"
    }
  },
  "10897": {
    "name": "Leigh Capili",
    "title": "Staff Developer Advocate",
    "organization": "VMware",
    "photo": {
      "alt": null,
      "height": "612",
      "width": "612",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/profile-pic.png"
    },
    "biography": "Leigh is an empathetic speaker and developer with niches in cloud-native systems and security.\nHe has a background in building software to manage infrastructure.  Leigh contributes to Kubernetes and Flux and is frequently working on his next software demo. He also co-maintains Ignite, the microVM manager with Docker UX. ()\nLeigh works with the VMware Tanzu Advocacy team and previously built Developer Experience and Platform with Weaveworks, Beatport, AT&T, and DIRECTV.  Leigh and his wife enjoy snowboarding and have a 60lb dog named Pepsi.\n \n \n \n \n \n https://ignite.rtfd.io/",
    "website": {
      "name": "Github: stealthybox",
      "url": "https://github.com/stealthybox"
    }
  },
  "10900": {
    "name": "Vijay Samuel",
    "title": "Observability Architect",
    "organization": "eBay",
    "photo": {
      "alt": null,
      "height": "1268",
      "width": "1107",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/headshot_14.jpg"
    },
    "biography": "Vijay Samuel works with eBay's observability platform as its architect. During his time at eBay Vijay has transformed eBay's observability platform into a cloud native offering that is primarily built on top of open source technologies. He loves to code in Go and play video games.",
    "website": null
  },
  "10917": {
    "name": "Dotan Horovits",
    "title": "Principal Developer Advocate",
    "organization": "Logz.io, CNCF Ambassador",
    "photo": {
      "alt": null,
      "height": "1200",
      "width": "1200",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Dotan%20Horovits-Color-1200x1200-gray-bg.png"
    },
    "biography": "Horovits lives at the intersection of technology, product and innovation. With over 20 years in the hi-tech industry as a software developer, a solutions architect and a product manager, he brings a wealth of knowledge in cloud and cloud-native solutions, DevOps practices and more. Horovits is an international speaker and thought leader, as well as an Ambassador of the Cloud Native Computing Foundation (CNCF). Horovits is an avid advocate of open source and communities, an organizer of the CNCF Tel-Aviv meetup group and of Kubernetes Community Days and DevOpsDays local events, a podcaster at OpenObservability Talks, and a blogger, among others. Currently working as the principal developer advocate at Logz.io, Horovits evangelizes on Observability in IT systems using popular open source projects such as Prometheus, OpenSearch, Jaeger and OpenTelemetry.",
    "website": {
      "name": "horovits @ LinkedIn",
      "url": "https://www.linkedin.com/in/horovits/"
    }
  },
  "10932": {
    "name": "Neal Gompa",
    "title": null,
    "organization": null,
    "photo": {
      "alt": null,
      "height": "512",
      "width": "512",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/neal-gompa-jun2020-512px.png"
    },
    "biography": "Neal is a developer and contributor in Fedora; CentOS; Mageia; and openSUSE, focusing primarily on the base Linux system components, such as package and software management, as well as the Linux desktop. He's a big believer in \"upstream first\", which has led him all over the open source world.",
    "website": {
      "name": "@Conan_Kudo@fosstodon.org",
      "url": "https://fosstodon.org/@Conan_Kudo"
    }
  },
  "10942": {
    "name": "Matthew Croughan",
    "title": "Founder of Nix.How",
    "organization": "Nix.How LTD",
    "photo": {
      "alt": null,
      "height": "1264",
      "width": "1264",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/nixlabs-kino-cropped.jpg"
    },
    "biography": "Matt was once a Docker enthusiast, but was accidentally captivated by Nix and functional programming whilst working for an Embedded Linux company who were using Yocto + Docker for building and deploying software (tools which are exactly the opposite of functional and reproducible!). Since discovering Nix, Matt has quit his job and become a passionate NixOS contributor, evangelist and founder of Nix.How LTD, a Nix Software Consultancy that focuses on converting clients from legacy, unreproducible systems to Nix/NixOS. Every machine he owns and maintains is built using Nix, which includes his Android devices which are also built with Nix. He created ‘nixinate’, a Flake native deployment tool/library for NixOS. Matt is one of the founders of Nix.Camp, a small yearly event in North Wales for Nix enthusiasts.",
    "website": {
      "name": "Nix.How",
      "url": "https://nix.how"
    }
  },
  "11011": {
    "name": "Nathan Loding",
    "title": "Developer Advocate",
    "organization": "Camunda",
    "photo": {
      "alt": null,
      "height": "2048",
      "width": "2048",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/reverent_geek-profile-balloon.jpg"
    },
    "biography": "I'm a nerd, and proud of it! I love solving problems and technology is the best way to do that. I work professionally as a Developer Advocate for Camunda. On the side I'm a husband, father, collector of hobbies, gardener, and outdoorsman (hiking, camping, canoeing/kayaking). I enjoy working analog, with my hands, whenever possible. I hate chores and cleaning up after myself.",
    "website": null
  },
  "11012": {
    "name": "Devrim Gunduz",
    "title": "Postgres Expert",
    "organization": "EDB",
    "photo": {
      "alt": null,
      "height": "123",
      "width": "128",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/devrim-avatar-014-small-128.123.jpg"
    },
    "biography": "I’started using Linux in 1996, and PostgreSQL in 1998. Love to travel, listen to music, and enjoy life with friends. Joined PostgreSQL community around 1999. Currently maintaining PostgreSQL official RPM repository at  and  . Contributed to many PostgreSQL related projects. Already a Fedora and EPEL contributor as well.\n \n \n https://yum.postgresql.org https://zypp.postgresql.org Working at EDB as Postgres Expert in CTO team.",
    "website": null
  },
  "11015": {
    "name": "James Kunstle",
    "title": "Software Engineer",
    "organization": "Red Hat",
    "photo": {
      "alt": null,
      "height": "1920",
      "width": "1440",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/69420549107__87574136-C23B-41BF-BDB0-325DED3C2D0E_0.JPG"
    },
    "biography": "James Kunstle is a software engineer in Red Hat's Open Source Program Office. James finished his graduate work at BU in AI, having finished collaborative research with Red Hat in the adversarial machine learning space. He works on the oss-aspen project and oss-aspen/8Knot, and is based in Boston.",
    "website": null
  },
  "11245": {
    "name": "Vincent Sloan",
    "title": "Principal Software Engineer",
    "organization": "GoFundMe",
    "photo": {
      "alt": null,
      "height": "1121",
      "width": "1065",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/profilephoto.jpg"
    },
    "biography": "With over two decades of experience in the technology domain, Vincent Sloan stands as a seasoned software engineer based in Long Beach, CA. His expertise encompasses a range of areas, most notably in online payments and building secure, scalable solutions. Vincent has adeptly navigated roles both in senior leadership and as a high-level individual contributor. An alumnus of California State University Fullerton, Vincent graduated summa cum laude with a BA in Linguistics & a Computer Science minor.",
    "website": {
      "name": "LinkedIn",
      "url": "https://www.linkedin.com/in/vincentsloan/"
    }
  },
  "11247": {
    "name": "Julien Riou",
    "title": "Database Engineer",
    "organization": "OVHcloud",
    "photo": {
      "alt": null,
      "height": "1024",
      "width": "1024",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/profilepic_small.jpg"
    },
    "biography": "Discovered the open source world in 2007 at an Ubuntu Party in Paris, France. DBA since 2012 in the web hosting world. Open source DBMS specialist (PostgreSQL, MySQL). Currently Tech Lead in the databases team at OVHcloud, a worldwide Cloud Computing provider.",
    "website": {
      "name": "Website",
      "url": "https://julien.riou.xyz/"
    }
  },
  "11269": {
    "name": "Jimmy Angelakos",
    "title": "Database Architect",
    "organization": "RapidRatings",
    "photo": {
      "alt": null,
      "height": "512",
      "width": "512",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/DSC03003-01_512px.jpeg"
    },
    "biography": "Jimmy Angelakos is a Systems and Database Architect and recognized PostgreSQL expert with a wealth of experience gained from his career in Software Architecture and key roles at 2ndQuadrant and EDB. He studied Computer Science at the University of Aberdeen and has worked with, and contributed to, Open-Source tools for 25+ years. He is passionate about participating in the community, and is an active member of PostgreSQL Europe and an occasional contributor to the PostgreSQL project. Jimmy is a regular speaker at conferences and events focused on databases and Open-Source software, sharing his insights with the community. Co-author of the \"PostgreSQL 16 Administration Cookbook\". \n    Mastodon: \n \n https://fosstodon.org/@vyruss",
    "website": {
      "name": "vyruss.org",
      "url": "https://vyruss.org/computing"
    }
  },
  "11306": {
    "name": "Tammer Saleh",
    "title": "Founder",
    "organization": "SuperOrbital",
    "photo": {
      "alt": null,
      "height": "400",
      "width": "400",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/tammer.jpg"
    },
    "biography": "Tammer founded  to provide the industry's best Kubernetes engineering and training.  He's a published author, accomplished speaker, mediocre engineering leader, and rather poor software developer.\n \n https://superobital.io",
    "website": {
      "name": "SuperOrbital",
      "url": "https://superorbital.io"
    }
  },
  "11308": {
    "name": "John Studarus",
    "title": "President",
    "organization": "Martincoit Networks",
    "photo": {
      "alt": null,
      "height": "2177",
      "width": "2091",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/PXL_20211205_164847962.jpg"
    },
    "biography": "John is the President of Martincoit Networks, a provider of SCION related applications and services. Previously to founding Martincoit, he was a cyber security product architecture developing solutions for the telecommunications, manufacturing, and financial services markets. At Martincoit he is focused on migrating well known and familiar software applications and infrastructure to SCION allowing those applications to benefit from the security and resilience that SCION offers. He is a graduate of the University of California, San Diego and Carnegie Mellon University.",
    "website": {
      "name": "SCION Workshop",
      "url": "https://github.com/MartincoitNetworks/SCIONWorkshop"
    }
  },
  "11309": {
    "name": "Gerardo Lopez",
    "title": "Principal Engineer",
    "organization": "Veritas Automata",
    "photo": {
      "alt": null,
      "height": "400",
      "width": "400",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/me-foto.jpg"
    },
    "biography": "Gerardo, a seasoned professional with over 11 years of expertise in software development, stands as a trailblazer in the realm of cloud technology. As a distinguished Google Developer Expert in the Cloud, he has showcased an unparalleled commitment to advancing the industry's boundaries. He has fostered a collaborative environment for like-minded enthusiasts to share insights and push the frontiers of cloud-native technologies. Gerardo's leadership has transformed the community into a hub of innovation, sparking discussions that shape the future of cloud computing. Beyond his professional achievements, Gerardo is a catalyst for change and progress in the tech community. His dynamic approach to problem-solving and passion for knowledge-sharing make him a sought-after speaker at conferences and events. As an influential figure in the industry, Gerardo Lopez continues to inspire and elevate the standards of excellence in software development and cloud technology.",
    "website": null
  },
  "11315": {
    "name": "Christian Hernandez",
    "title": null,
    "organization": null,
    "photo": {
      "alt": null,
      "height": "3000",
      "width": "3000",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/ChristianHernandez_border.png"
    },
    "biography": "Christian is a well rounded technologist with experience in infrastructure engineering, systems administration, enterprise architecture, tech support, advocacy, and product management. Passionate about OpenSource and containerizing the world one application at a time. He is currently a maintainer of the OpenGitOps project, a member of the Argo Project Marketing SIG, and co-host of GitOps Guide to the Galaxy. He focuses on GitOps practices, DevOps, Kubernetes, and Containers.",
    "website": {
      "name": "Personal Website",
      "url": "https://chernand.io"
    }
  },
  "11328": {
    "name": "Lisa Umberger",
    "title": "CEO",
    "organization": "Sicura",
    "photo": null,
    "biography": "Lisa Umberger has been a leader in the cybersecurity and DevSecOps space, building teams and products that bridge the gap between engineering and security. An expert leader in her field, Lisa has worked across industries in both the public and private sectors, helping to implement cybersecurity best practices across organizations. Career Highlights: • CEO of Sicura, a DevSecOps automation tool used to implement technical security requirements. • Led team of cybersecurity professionals leading to the initial accreditation of GovCloud as part of an interagency, collaborative environment. • Responsible for a team of cybersecurity professionals managing hundreds of DoD systems used to support National Security efforts.",
    "website": null
  },
  "11330": {
    "name": "Sweet Tea Dorminy",
    "title": "cultivator of btrfses",
    "organization": "Meta",
    "photo": {
      "alt": null,
      "height": "947",
      "width": "960",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/profile_9.jpg"
    },
    "biography": "I (Sweet Tea) have worked on kernel storage since graduating from MIT in 2013. I've been a fan of open source, particularly storage technology, since I started using Gentoo in '05, and was fortunate to get a job out of college working on Linux kernel storage. I began at a startup called Permabit working on a then-proprietary software-defined storage device providing dedupe and compression, which was acquired by Red Hat in 2017. dm-vdo has now been open sourced and is working on going upstream soon. In 2022, I joined the btrfs team at Meta, and have been working on adding filesystem encryption to btrfs and other btrfs things since.",
    "website": null
  },
  "11350": {
    "name": "Mattias Gees",
    "title": "Director of Tech",
    "organization": "Venafi",
    "photo": {
      "alt": null,
      "height": "800",
      "width": "800",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/1592472429416%20%281%29.jpeg"
    },
    "biography": "Mattias is a Director of Tech at Venafi. He has significant experience guiding clients' Cloud Native strategy and technical implementation. Currently, he is responsible for the internal Kubernetes platform of a global financial institution and for improving the lives of application teams to adopt Kubernetes. When he is not working, he is an avid runner and enjoys travelling.",
    "website": {
      "name": "Blog",
      "url": "https://blog.mattiasgees.be"
    }
  },
  "11356": {
    "name": "Farid Zakaria",
    "title": "software engineer, father and wishful surfer",
    "organization": "University of California Santa Cruz",
    "photo": {
      "alt": null,
      "height": "600",
      "width": "600",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/image%20%282%29.png"
    },
    "biography": "PhD Student at the University of California Santa Cruz \n    Software engineer, Ph.D. student, and father.\nI am a NixOS enthusiast, which has led me to rethink basic Linux primitives.",
    "website": {
      "name": "Blog",
      "url": "https://fzakaria.com"
    }
  },
  "11365": {
    "name": "Tom Callaway",
    "title": "Principal Open Source Strategist",
    "organization": "AWS",
    "photo": {
      "alt": null,
      "height": "800",
      "width": "800",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/spot-headshot-blue.jpeg"
    },
    "biography": "Tom is a Principal Open Source Strategist for AWS. He has been a part of the FOSS community since 1997, when he skipped his last day of junior high to go to Linux Expo. During college, he worked for a high-availability startup to cover tuition, and when they crashed along with the majority of the IT sector, he dropped out of college and went to work for Red Hat full-time. He worked for Red Hat for almost twenty years, in Support, Sales Engineering, Release Engineering, Engineering Management, University Outreach (CTO's office), and Employment Brand. He’s an active contributor to Fedora and helped to write the Fedora Packaging and Legal Guidelines which are still in use today. He is co-author of Raspberry Pi Hacks (2013, O’Reilly). When he’s not working, he finds enjoyment in 3D printing, pinball, hockey, games (board & video), geocaching, craft beer, B-movies, science fiction, trivia, traveling, and his wife and two boys.",
    "website": null
  },
  "11367": {
    "name": "Christina Andonov",
    "title": "Senior Specialist Solutions Architect",
    "organization": "AWS",
    "photo": {
      "alt": null,
      "height": "2406",
      "width": "2443",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/IMG_4026.jpg"
    },
    "biography": "Christina focuses on helping organizations build Internal Developer and Data Platforms on Kubernetes using open source projects. Her goal is to simplify deployment for developers and data scientists, making it easy to adopt Kubernetes and cloud resources.",
    "website": null
  },
  "11369": {
    "name": "Denis Magda",
    "title": "Head of DevRel",
    "organization": "Yugabyte",
    "photo": null,
    "biography": "Denis started his software engineering career at Sun Microsystems and Oracle, where he built JVM/JDK and led one of the Java development groups. After learning Java from the inside, he joined the world of distributed systems and databases, where he has remained ever since. His experience spans from the development of database engines and high-performance applications to training and education on the topic of distributed applications.",
    "website": null
  },
  "11372": {
    "name": "Las Safin",
    "title": null,
    "organization": null,
    "photo": {
      "alt": null,
      "height": "1600",
      "width": "1200",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/IMG-20240104-WA0103.jpg"
    },
    "biography": "monkey",
    "website": {
      "name": "https://las.rs",
      "url": "https://las.rs"
    }
  },
  "11381": {
    "name": "Mark Bracher",
    "title": "Senior Staff Engineer - Data",
    "organization": null,
    "photo": {
      "alt": null,
      "height": "1052",
      "width": "1026",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Mark.jpg"
    },
    "biography": "I studied Theoretical Mathematics in college, but every job I've ever had was with computers, and employers have always wanted me to work with data. I've worked with Oracle, Illustra, Informix, MySQL and PostgreSQL for a variety of startups over the last 30 years.",
    "website": null
  },
  "11392": {
    "name": "Alan LaCombe",
    "title": "Lead DevOps Engineer",
    "organization": "Ring",
    "photo": {
      "alt": null,
      "height": "2881",
      "width": "2645",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/IMG_8339.jpg"
    },
    "biography": "Alan is a devops engineer focusing on deployments and running services at massive scales. With over 15 years of experience in the devops world he is currently using his skills to create better observabilty for all services at Ring.",
    "website": null
  },
  "11398": {
    "name": "Hichem Kenniche",
    "title": "Product Architect ",
    "organization": "Instacluster",
    "photo": {
      "alt": null,
      "height": "1713",
      "width": "1285",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/20231115_122658.jpg"
    },
    "biography": "Hichem brings more than 15 years in the big data processing domain. He is currently an OSS Product Architect at Instaclustr (part of Spot by NetApp) working with the product team to priorities the market and customers needs into new features.",
    "website": {
      "name": "Linkedin",
      "url": "https://www.linkedin.com/in/hichem-kenniche-71b3b940/"
    }
  },
  "11400": {
    "name": "Henrietta Dombrovskaya",
    "title": "Database Architect",
    "organization": "DRW",
    "photo": {
      "alt": null,
      "height": "1391",
      "width": "1042",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/avatar2023.jpeg"
    },
    "biography": "Henrietta (Hettie) Dombrovskaya is a database researcher and practitioner with over 40 years of academic and industrial experience. She holds a Ph.D. in Computer Science from the University of Saint Petersburg, Russia. At present she is \n    – Database Architect at DW Holdings in Chicago, IL\n– Local Organizer of the Chicago PostgreSQL User Group\n– Active community member, a frequent speaker at the PostgreSQL Conferences\n– A researcher focused on developing efficient interactions between applications and databases and implementation of temporal data\n– An author of PostgreSQL Query Optimization book",
    "website": {
      "name": "The World of Data",
      "url": "https://hdombrovskaya.wordpress.com/"
    }
  },
  "11415": {
    "name": "Paul Tevis",
    "title": null,
    "organization": "Helping Improve",
    "photo": {
      "alt": null,
      "height": "1024",
      "width": "1024",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/PaulTevis-1024x1024.jpg"
    },
    "biography": "Paul Tevis helps experts amplify their leadership and organizations scale theirs. He started his career as a software engineer and engineering manager before moving into coaching and Learning and Development (L&D). In 2020, he co-founded Helping Improve LLC, where he works as an executive coach, advisory consultant, and corporate trainer.",
    "website": {
      "name": "Helping Improve",
      "url": "https://HelpingImprove.com"
    }
  },
  "11423": {
    "name": "Gabriele Bozzola",
    "title": "(Scientific) Software Engineer",
    "organization": "California Institute of Technolgy",
    "photo": {
      "alt": null,
      "height": "484",
      "width": "484",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/avatar_4.jpg"
    },
    "biography": "I am a software engineer dedicated to supporting and accelerating scientific research. I am currently working at CliMA, the Climate Modelling Alliance, where I contribute to the development of a next-generation Earth-System Model. Before joining CliMA, I obtained my PhD in theoretical and computational physics focusing on simulations of black holes. During my PhD, I was a NASA Future Investigator for Space Science and a Texas Advanced Center for Computing Frontera fellow. As part of my PhD, I contributed to the development of open-source software for high-energy astrophysics. I also contributed to packages for GNU Emacs. I am a reviewer for the Journal of Open-Source Software. I am passionate about open-source software in science, research software engineering, and education.",
    "website": {
      "name": "Personal website",
      "url": "http://sbozzolo.github.io"
    }
  },
  "11427": {
    "name": "Omar Alva",
    "title": "Technical Architect",
    "organization": "MunichRe",
    "photo": null,
    "biography": "Omar Alva is a Technical Architect at Munich Re, with expertise in Cloud, Linux, and Automation. Beyond the tech world, he explores AI, enjoys sports, and finds inspiration in music. Connect to discuss tech trends or share interests in AI, sports, and music.",
    "website": null
  },
  "11429": {
    "name": "Daphne Muller",
    "title": "Manager Alliances, Ecosystem & Support",
    "organization": "Nextcloud",
    "photo": {
      "alt": null,
      "height": "1158",
      "width": "1158",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Daphne%20Muller%20portret%20WEB-crop.jpg"
    },
    "biography": "Daphne is a TEDx speaker who wears two hats as the leader of the AI team at Nextcloud and academic researcher in the field of privacy and the future of technology. Her idea worth spreading is that by collecting less personal data, we can get more innovation, financially healthier business models, more competition in the market, and most importantly, more humanity. At Nextcloud she leads the team of AI developers, and she also leads Nextcloud's app ecosystem, developer programme and community, and customer support.",
    "website": {
      "name": "Blog of Daphne Muller",
      "url": "http://www.daphnemuller.nl"
    }
  },
  "11431": {
    "name": "Apoorva Kulkarni",
    "title": "Sr. Specialist SA, Containers",
    "organization": "AWS",
    "photo": {
      "alt": null,
      "height": "1515",
      "width": "1136",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/IMG_3905.jpeg"
    },
    "biography": "Apoorva is a Sr. Specialist Solutions Architect, Containers, at AWS where he helps customers who are building modern data platforms on AWS container services. He is passionate about open source, distributed computing and AI/ML for societal good. He lives in Southern California with his wife, 6 year old son and a 2 year old pup.",
    "website": null
  },
  "11432": {
    "name": "Michael Watson",
    "title": "Developer Relations Manager",
    "organization": "Apollo GraphQL",
    "photo": {
      "alt": null,
      "height": "858",
      "width": "585",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Screenshot%202023-10-17%20at%201.27.46%20PM.png"
    },
    "biography": "Michael Watson, head of developer relations at Apollo, boasts over 5 years in GraphQL and community engagement. A fervent graph architect, he's aided numerous enterprises in optimizing their production environments, particularly with federated architectures.",
    "website": null
  },
  "11433": {
    "name": "Joshua Wong",
    "title": "Director of Datacenter Operations",
    "organization": "Catenary Transit Initiatives",
    "photo": null,
    "biography": null,
    "website": {
      "name": "Catenary Maps",
      "url": "https://catenarymaps.org/"
    }
  },
  "11434": {
    "name": "Umair Shahid",
    "title": "Founder",
    "organization": "Stormatics",
    "photo": {
      "alt": null,
      "height": "999",
      "width": "999",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/DSC_2197_small.JPG"
    },
    "biography": "Umair is a 20-year veteran of the PostgreSQL community with extensive experience in solving real-world problems with technology. Being a recognized expert in PostgreSQL, he is a blogger and a regular speaker at conferences globally. Umair is the founder of Stormatics - a professional services company with a mission to help businesses use PostgreSQL reliably for their critical data workloads. His previous experience with commercial PostgreSQL has spanned roles related to professional services and product management in major pure-play PostgreSQL organizations like EDB, 2ndQuadrant, OpenSCG, & Percona.",
    "website": {
      "name": "https://stormatics.tech/",
      "url": "https://stormatics.tech/"
    }
  },
  "11435": {
    "name": "Nikita Jain",
    "title": "Senior Product Marketing Manager",
    "organization": "Google",
    "photo": {
      "alt": null,
      "height": "600",
      "width": "600",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Security%20Photo.jpg"
    },
    "biography": "Nikita Jain is a member of the Google Privacy, Safety & Security Product Marketing Team and has 10+ years of experience in product marketing. She has been leading marketing for Cybersecurity at Google, managing and scaling go-to-market programs across Google to land key cybersecurity initiatives such as ‘World Password Day’ and ‘Cybersecurity Awareness Month’ successfully with the industry. She leads the product marketing strategy for cybersecurity globally across Google, spearheading initiatives in key areas, such as open-source security, AI-powered security, IoT security, cyber workforce skilling, and transformational innovation. She writes educational materials for government officials, press and security tech executives and helps create blog posts about security. Before pursuing product marketing, Nikita was an equities trader trading for Asian markets in India and before that she graduated as an engineer. As a strong proponent for diversity in tech, she firmly believes that teams.",
    "website": {
      "name": "Senior Product Marketing Manager, Cybersecurity,Google",
      "url": "https://www.linkedin.com/in/nikitajain88/"
    }
  },
  "11440": {
    "name": "John Matthew",
    "title": "Self",
    "organization": "Self",
    "photo": {
      "alt": null,
      "height": "2500",
      "width": "1668",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/john-1.jpg"
    },
    "biography": "Saw my first TRS-80 and 15yrs old and have been hooked on computers ever since.  I love to write code in Python, but have used everything from dBASE, FoxPro, Delphi and dabbled in C.  My current passion is making my development life easier with tools and Open Source.  I'm an active contributor to GitHub projects.",
    "website": null
  },
  "11444": {
    "name": "Jenson Crawford",
    "title": "Vice President, Software Engineering",
    "organization": "Eastman Kodak Company",
    "photo": {
      "alt": null,
      "height": "1491",
      "width": "1494",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/JJC%20Profile%206%20square.jpg"
    },
    "biography": "Jenson Crawford is a software engineering leader and an active volunteer based in Los Angeles. He spent the first half of his career focused on optimizing software and is now focused on optimizing software and volunteer teams. Jenson is currently VP of Software Engineering for Eastman Kodak and is also serving in multiple volunteer roles.",
    "website": null
  },
  "11445": {
    "name": "Shaun McCance",
    "title": "CentOS Community Architect",
    "organization": "Red Hat",
    "photo": {
      "alt": null,
      "height": "512",
      "width": "512",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/mccance.jpg"
    },
    "biography": "Shaun is the CentOS Community Architect at Red Hat. He's an occasional developer and tech writer. He's worked on documentation and documentation systems in a number of open source communities, most notably as part of GNOME for the last two decades.",
    "website": null
  },
  "11453": {
    "name": "George-Andrei Iosif",
    "title": "Software Security Engineer",
    "organization": "Canonical",
    "photo": {
      "alt": null,
      "height": "2911",
      "width": "2911",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/9.min__0.jpg"
    },
    "biography": "Andrei spent 2022 as the technical leader of a startup automating cybersecurity solutions and as a security engineer in the Romanian Army. He left the public sector after finding that the startup idea was unfeasible, and accepted a position at Canonical to safeguard Ubuntu and its open-source components. His area of expertise is software security, and he has lately contributed to the open source with projects such as multiple SAST tools and a cyber reasoning system. In addition, he occasionally analyses cybersecurity papers in a segment of the Ubuntu Security Podcast.",
    "website": {
      "name": "iosifache.me",
      "url": "https://iosifache.me/"
    }
  },
  "11457": {
    "name": "Guilherme Gasque",
    "title": "Data Architect & Principal Data Engineer",
    "organization": "Next Reason",
    "photo": {
      "alt": null,
      "height": "500",
      "width": "500",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/guigasque-3x4.png"
    },
    "biography": "I am a Senior Data Architect and Principal Data Engineer at Next Reason, a company that provides data-driven insights and solutions for various industries and domains. I have almost 10 years of experience in designing, developing, and managing data systems and pipelines, as well as applying machine learning and cloud computing technologies to solve complex business problems and create value for customers and stakeholders. My mission is to use technology to connect the business strategy with the user's need, and to help people to develop along my journey of evolution and revolution. I am passionate about learning new skills and deepening my knowledge in three areas: Tech, Market, and Biz Knowledge. I am currently pursuing a Master's Degree in Innovation and Technology at UNIFESP, where I explore the latest trends and concepts in data science, artificial intelligence, and digital transformation.",
    "website": {
      "name": "LinkedIn",
      "url": "https://www.linkedin.com/in/guigasque/"
    }
  },
  "11466": {
    "name": "Oluebube Egbuna",
    "title": "Devrel Engineer ",
    "organization": "Spectro Cloud",
    "photo": {
      "alt": null,
      "height": "838",
      "width": "1212",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Screenshot%202022-12-02%20at%202.11.32%20PM.png"
    },
    "biography": "Oluebube, also known as Bube, is a software engineer who recently transitioned into the cloud native space. She has over six years of experience as a software engineer and has successfully led engineering teams to deliver high-impact software solutions. Bube is not only a skilled engineer, but she is also passionate about engaging with tech communities, creating technical content, open source, and sharing her expertise with others. She is also interested in security and is a few months away from completing her master's in Cybersecurity. When Bube is not working, she enjoys spending time with her family. She understands the importance of maintaining a healthy work-life balance, and she makes sure to prioritise spending quality time with her loved ones.",
    "website": null
  },
  "11468": {
    "name": "Kate Sweetland",
    "title": "Student",
    "organization": "University of Southern California",
    "photo": null,
    "biography": null,
    "website": null
  },
  "11474": {
    "name": "Rishi Verma",
    "title": "Manager",
    "organization": "NASA-JPL",
    "photo": null,
    "biography": null,
    "website": {
      "name": "Personal Website",
      "url": "https://riverma.github.io"
    }
  },
  "11475": {
    "name": "Achille Verheye",
    "title": "Lead Robotics Engineer",
    "organization": null,
    "photo": {
      "alt": null,
      "height": "500",
      "width": "500",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/picachille.jpeg"
    },
    "biography": "Experienced generalist roboticist who has built several robots from the ground up and has worked on several start-ups. Graduated from KU Leuven, Belgium with a BS in Mechanical and Computer Science Engineering, and a MSE in Robotics from the University of Pennsylvania.",
    "website": {
      "name": "Achille portfolio",
      "url": "http://achille.fyi"
    }
  },
  "11476": {
    "name": "Lodewijk Gelauff",
    "title": "Postdoctoral Scholar",
    "organization": "Stanford University",
    "photo": null,
    "biography": null,
    "website": null
  },
  "11487": {
    "name": "Kyle Bader",
    "title": "Senior Technical Staff Member",
    "organization": "IBM Storage",
    "photo": {
      "alt": null,
      "height": "205",
      "width": "205",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/bader.jpg"
    },
    "biography": "I dabble at the intersection of open source, networking, distributed storage, big data, and machine learning. I've covered the spectrum, helping to influence in areas ranging from pricing to consistency semantics. I architect solutions the way I would want them architected if I were holding the pager. I prefer pragmatic problem solving and try to approach every problem with the mindset of an optimistic skeptic.",
    "website": null
  },
  "11493": {
    "name": "Sunny Bains",
    "title": "Software Architect",
    "organization": "PingCAP",
    "photo": {
      "alt": null,
      "height": "837",
      "width": "618",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/PingCAP-Headshot.png"
    },
    "biography": "Sunny Bains has been developing software for longer than he can remember. He is currently a Software Architect at PingCAP where he  is working on distributed storage and learning Rust. Before joining PingCAP he was a Senior Director of Software Development at Oracle. At Oracle he was the lead of the MySQL/InnoDB team and made the MySQL/InnoDB engine scale to what it is today.",
    "website": null
  },
  "11502": {
    "name": "Thuymy Tran",
    "title": "Database Specialist Solutions Architect",
    "organization": "Amazon",
    "photo": {
      "alt": null,
      "height": "738",
      "width": "492",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/thuymyt-high-res-current-photo.jpeg"
    },
    "biography": "Thuymy is a Database Solutions Architect at Amazon Web Services (AWS) and has a background in Oracle databases. Previous to becoming a Solutions Architect, Thuymy worked as an Oracle DBA for 15+ years and has since worked as a Solutions Architect at both Oracle and AWS. At AWS, Thuymy works with customers to design database cloud solutions and her technical focus area is in PostgreSQL.",
    "website": null
  },
  "11505": {
    "name": "Éamon Ryan",
    "title": "Senior Principal Field Engineer",
    "organization": "Grafana Labs",
    "photo": {
      "alt": null,
      "height": "800",
      "width": "800",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/me-li.jpeg"
    },
    "biography": "Éamon is a Senior Principal Field Engineer at Grafana Labs, where he builds and maintains internal and external environments, builds out advanced workshops, provides input on product use-cases and acts as a subject matter expert in some specific areas. Éamon has done the full rounds of customer-facing tech roles over the years: Support, Education/Training, Professional Services, Solutions Engineering and now Field Engineering, giving him tons of customer insights and viewpoints he uses to fuel his work. Éamon has a background in infrastructure, having worked at VMware for ~8 years before migrating to Pivotal and ultimately to Grafana Labs. Originally hailing from Ireland, he has been living in California since 2014.",
    "website": {
      "name": "Grafana",
      "url": "https://grafana.com"
    }
  },
  "11511": {
    "name": "Jeremy Schneider",
    "title": "Database Performance Engineer",
    "organization": "AWS",
    "photo": {
      "alt": null,
      "height": "200",
      "width": "200",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/gravatar.jpg"
    },
    "biography": "Jeremy Schneider has been programming for 30 years and working with databases for 20 years, first focused on Oracle and later focused on PostgreSQL. He is currently an organizer of the Seattle PostgreSQL User Group. He joined AWS in 2017 and helped launch Aurora PostgreSQL alongside working on RDS Open Source PostgreSQL.",
    "website": {
      "name": "Blog",
      "url": "https://www.ardentperf.com"
    }
  },
  "11519": {
    "name": "Paul Yu",
    "title": "Developer Advocate",
    "organization": "Microsoft",
    "photo": {
      "alt": null,
      "height": "4000",
      "width": "4000",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/cda-pauyu-square-1mb_0.jpg"
    },
    "biography": "Paul Yu is a Developer Advocate at Microsoft focusing on cloud native technologies and the Kubernetes landscape. Paul has well over a decade of industry experience working as a Software Engineer and Solution Architect. He is passionate about promoting cloud native and sustainable solutions to help organizations optimize processes and workflows.",
    "website": {
      "name": "https://paulyu.dev",
      "url": "https://paulyu.dev"
    }
  },
  "11521": {
    "name": "Maya Singh",
    "title": "Product Manager",
    "organization": "Microsoft",
    "photo": {
      "alt": null,
      "height": "3264",
      "width": "2448",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/MicrosoftTeams-image%20%281%29.png"
    },
    "biography": "Maya is a Product Manager at Microsoft who is passionate about understanding consumer painpoints, ideating and iterating around solutions, and using data to drive product decisions. She started her career in financial services working on consumer facing web and mobile applications and is now excited to be working on the cloud and delving into all things open source. Maya holds a Bachelor's degree in Biomedical Engineering and an MBA, both from the University of Virginia. She is a die hard UVA sports fan and loves to try new restaurants and play tennis and golf in her free time.",
    "website": null
  },
  "11524": {
    "name": "Larry Schrof",
    "title": null,
    "organization": null,
    "photo": null,
    "biography": "Larry's career spans over 30 years in the tech industry including work at prominent companies such as Meta and Shopify. After 23+ years of hands-on engineering work in a myriad of roles (dev, sysadmin, security, observability, devops, etc), he intentionally transitioned to the people-leadership phase of his career and hasn't looked back. As a tech leader, Larry's first and foremost priority is the professional well-being of the folks he is responsible for. He applies his values of empathy, transparency, autonomy, humility, and objectivity on a daily basis to support those around him and make them more successful. In his fleeting moments of spare time outside of parenting and work, Larry is an actively-performing guitarist, poker player, and likes to play complex video games (in particular, those that support APIs that tools can be built upon.)",
    "website": null
  },
  "11525": {
    "name": "Michael Banck",
    "title": "Tech Lead",
    "organization": "NetApp",
    "photo": {
      "alt": null,
      "height": "150",
      "width": "150",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Portraitbild.jpg"
    },
    "biography": "Michael Banck is the database tech lead at NetApp Germany and a database reliability engineer for the Instaclustr managed Postgres platform. Before that, he was the PostgreSQL team lead at credativ (now part of NetApp). He joined credativ in 2009 and has been a Debian Developer since 2001, currently most active as part of the PostgreSQL packaging team. He is also a PostgreSQL and Patroni contributor, as well as active in several other open source projects. Leading the PostgreSQL team, he has consulted and supported numerous customers over the years, both in the daily operations of PostgreSQL and in the planning and implementation of high-availability and other solutions. Michael has presented talks at various Open Source conferences including FOSDEM, PGConf.EU, PGDay Chicago, Postgres Vision, Percona Live, DebConf and FrOSCon as well as being on the talks committe of both DebConf and PGConf.DE.",
    "website": null
  },
  "11528": {
    "name": "Ross Turk",
    "title": "Head of Marketing",
    "organization": "flox",
    "photo": {
      "alt": null,
      "height": "977",
      "width": "964",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/ross.jpg"
    },
    "biography": null,
    "website": null
  },
  "11530": {
    "name": "Hema Veeradhi",
    "title": "Senior Data Scientist",
    "organization": "Red Hat",
    "photo": {
      "alt": null,
      "height": "934",
      "width": "836",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/IMG_1698%20%281%29.jpg"
    },
    "biography": "I am a Senior Data Scientist working in the Emerging Technologies team part of the office of the CTO at Red Hat. My work primarily focuses on implementing innovative open AI and machine learning solutions to help solve business and engineering problems.",
    "website": null
  },
  "11531": {
    "name": "Surya Pathak",
    "title": "Data Scientist",
    "organization": "Red Hat.",
    "photo": {
      "alt": null,
      "height": "1080",
      "width": "1080",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/My%20project-1%20%282%29.png"
    },
    "biography": "Surya is a Data Scientist, currently working on the Emerging Technologies team at Red Hat office of the CTO. He is experienced in the field of Machine Learning and Artificial Intelligence. He spent the past year developing models for gaining customer insights, navigating open source tools for data scientists, and doing NLP using transformers models.",
    "website": null
  },
  "11534": {
    "name": "Zach Mitchell",
    "title": "Software Engineer",
    "organization": "flox",
    "photo": {
      "alt": null,
      "height": "2498",
      "width": "2521",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/me_1.jpeg"
    },
    "biography": "Zach is an Engineer at flox and a member of the Nix Documentation Team. In a previous life Zach built lasers and performed quantum mechanics simulations, but now he builds software with Rust and Nix. Zach has always had a knack for teaching, receiving multiple teaching awards during his PhD. This knack stems from an empathy for the struggles of new users of any technology. Enabling engineers and tinkerers alike to get things done or scratch their own itch has always been a joy for Zach. Zach has spoken at multiple conferences and meetups, including NixCon 2023 and RustConf 2023. He also organizes the Boulder Rust Meetup.",
    "website": {
      "name": "Tinkering",
      "url": "http://tinkering.xyz"
    }
  },
  "11535": {
    "name": "Frédéric Harper",
    "title": "Principal Developer Advocate",
    "organization": "Kubefirst",
    "photo": {
      "alt": null,
      "height": "2018",
      "width": "2018",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/fharper-original-square.jpeg"
    },
    "biography": "As the Principal Developer Advocate at Kubefirst, Frédéric Harper helps Developers, and DevOps be successful with their Kubernetes journey. Fred has shared his passion for technology on the stage at multitudinous events around the world. He’s helped build successful, and healthy communities at npm, Mozilla, Microsoft, DigitalOcean, and Fitbit. He is also the author of the book Personal Branding for Developers at Apress. Behind this extrovert is a very passionate individual who believes in the power of communication... and cat videos.",
    "website": {
      "name": "kubefirst",
      "url": "https://kubefirst.io"
    }
  },
  "11536": {
    "name": "Jamie Coleman",
    "title": "Developer Advocate",
    "organization": "https://www.sonatype.com/",
    "photo": {
      "alt": null,
      "height": "1001",
      "width": "1001",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/1001x1001.jpg"
    },
    "biography": "Jamie is a Developer Advocate for Sonatype formally IBM, based in the UK. He talks about the importance of security in software, improving developer productivity and raising awareness about energy consumption of technology.\nPassionate about discovering ways to help reduce developers carbon footprint, he is also a subject matter expert in containerised solutions and build technologies. He fell in love with Java at University and has gone on to talk at many conferences about using Java with microservices and related technologies. He has worked on a wide variety of projects such as modernising IBM CICS mainframe testing infrastructure, creating, and automating the creation of Docker images for IBM’s products and contributing to a DevOps pipeline offering.",
    "website": null
  },
  "11540": {
    "name": "Ben Potter",
    "title": "Head of Produt",
    "organization": "Coder.com",
    "photo": {
      "alt": null,
      "height": "512",
      "width": "512",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/1686933512123.jpeg"
    },
    "biography": "Since the age of 13, Ben has been attending SCaLE and tinkering with remote Linux machines. Today, Ben is a software engineer and Head of Product at Coder, an open-source platform for remote development environments. Ben works with the open-source community and large enterprises to move their developer workstations to their cloud.",
    "website": {
      "name": "LinkedIn",
      "url": "https://linkedin.com/in/bpmct"
    }
  },
  "11541": {
    "name": "Tracy Homer",
    "title": null,
    "organization": "Software Freedom Conservancy",
    "photo": {
      "alt": null,
      "height": "1097",
      "width": "1146",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/profile-pic.jpg"
    },
    "biography": "Tracy Homer works as the Operations Manager for Software Freedom Conservancy. Tracy also serves on the board of her local hackerspace, an organization committed to teaching and promoting open technology exclusively. In addition to being the first point of contact for interested members, she also authorizes people to use the laser cutter, and 2d design classes in Inkscape. She is passionate about accessible technology so that people are able to have the tools they need to be creative and successful without restrictions.",
    "website": null
  },
  "11547": {
    "name": "Bernie Wu",
    "title": "VP",
    "organization": "MemVerge",
    "photo": {
      "alt": null,
      "height": "300",
      "width": "300",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Bernie-Wu.png"
    },
    "biography": "Bernie is VP of Strategic Partnerships & Business Development for MemVerge. He has 25+ years of experience as a senior executive for data center hardware and software infrastructure companies, including companies such as Conner/Seagate, Cheyenne Software, Trend Micro, FalconStor, Levyx, and MetalSoft. He is also on the Board of Directors for Cirrus Data Solutions.  Bernie has a BS/MS in Engineering from UC Berkeley and an MBA from UCLA.",
    "website": {
      "name": "http://www.memverge.com",
      "url": "http://www.memverge.com"
    }
  },
  "11549": {
    "name": "Samuel Raumin",
    "title": null,
    "organization": null,
    "photo": {
      "alt": null,
      "height": "2208",
      "width": "2944",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/20220131_095534_03-min.jpg"
    },
    "biography": "Hi, my name is Samuel. It is nice to meet you. I am a double major electrical and computer engineer in my last semester at Cal Poly Pomona. I have a background in cybersecurity and radio projects. I really enjoy working with anything that involves computers, so Linux is no exception to that. I met up with some cool folks at the last Scale I went to (I think it was 2021), including the Nix group, and I was instantly hooked. I work as a PCB designer intern for WhiteFox Defense technologies and I am hoping to continue with them after this semester. I like to work with legacy hardware, for example Nintendo, Sony, and other systems, all ranging with different functions such as tape recorders to gaming consoles.",
    "website": {
      "name": "My website :]",
      "url": "https://web.samtalks.us/"
    }
  },
  "11550": {
    "name": "Frank Coyle",
    "title": "Associate Professor",
    "organization": "Southern Methodist University",
    "photo": {
      "alt": null,
      "height": "424",
      "width": "450",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/frank2.jpg"
    },
    "biography": "Looking for truth and accountability in software particularly Large Language Models.\n•\t1974, MS from Georgia Tech in CS\n•\t1970s: Data Management Consultant at Grady Hospital, Atlanta GA; development work at Georgia Tech Research Institute\n•\t1980s: Washington DC – worked for defense contractor doing AI and Lisp at facility with 10 US Army captains and one bird colonel\n•\t1992: Dallas, Texas.  PhD in Computer Science at SMU\n2020 Program Director Computer Science & AI Program",
    "website": {
      "name": "Frank Coyle Home page",
      "url": "http://s2.smu.edu/~coyle"
    }
  },
  "11552": {
    "name": "Ray Salazar",
    "title": "Cybersecurity Engineer",
    "organization": null,
    "photo": null,
    "biography": "Ray Salazar is a cybersecurity professional with over a decade in the information security industry. He has a deep passion for technology, security and media. On his free time he attends various conferences, conventions and events in the technology and security space. He has served as a presenter at multiple conferences and conventions. His influence extends beyond technology, as he actively promotes diversity and inclusion in the industry through leadership roles in various organizations. With unwavering dedication, Ray Salazar continues to shape the future of the technology industry while remaining a prominent figure at conferences and conventions.",
    "website": null
  },
  "11562": {
    "name": "Julia Iacoviello",
    "title": "Systems Engineer",
    "organization": "LINBIT",
    "photo": {
      "alt": null,
      "height": "932",
      "width": "932",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/JuliaIacoviello_scaled_square.png"
    },
    "biography": "Julia designs, deploys and supports high-availability, disaster recovery, and software defined storage systems in her role as a systems engineer at LINBIT. Before joining the team at LINBIT, she implemented and maintained system integrations and automations within a primarily Linux-based environment, across several layers. Julia is passionate about well-architected, high performing infrastructure and enjoys learning and speaking about best practices and new technologies that may be implemented within such systems.",
    "website": null
  },
  "11564": {
    "name": "Katherine Druckman",
    "title": "Open Source Evangelist",
    "organization": "Intel",
    "photo": {
      "alt": null,
      "height": "856",
      "width": "1019",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/KD.jpeg"
    },
    "biography": "Katherine Druckman is an Open Source Evangelist at Intel where she enjoys sharing her passion for a variety of open source topics. She is a long-time open source advocate, developer, and podcaster, and is currently the host of Open at Intel and a co-host of the FLOSS Weekly and Reality 2.0 podcasts. Previously, Katherine spent over a decade as Director of Digital Experience at Linux Journal. A passionate Drupalist since she first downloaded a tarball in 2005, she has also been a Drupal contributor and a Software Engineer.",
    "website": null
  },
  "11566": {
    "name": "Thomas Cameron",
    "title": "Red Hat Practice Lead",
    "organization": "Sparksoft Corporation",
    "photo": {
      "alt": null,
      "height": "305",
      "width": "284",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/PXL_20231031_185844775-HEAD.jpg"
    },
    "biography": "Thomas Cameron has been in IT since 1993. He started out with Novell NetWare, then worked with Microsoft technologies, then discovered Linux in 1995. He's been an Open Source geek ever since. He's managed large scale Linux environments for organizations from banking to real estate to chip manufacturing. He worked at Red Hat for about 14 years, as a chief architect and global technical evangelist. He then went to AWS, where he was a senior technical trainer. Recently, Thomas was hired to build and manage the Red Hat practice at Sparksoft, a solutions provider serving the federal government. Thomas has achieved Red Hat Certified Architect, AWS Solutions Architect Professional, and had numerous other technical certifications. He's delivered technical presentations on Open Source in twenty countries on five continents.",
    "website": {
      "name": "Sparksoft Corporation",
      "url": "https://www.sparksoftcorp.com"
    }
  },
  "11567": {
    "name": "Nicholas Maramba",
    "title": "Student",
    "organization": "LAUSD",
    "photo": {
      "alt": null,
      "height": "3088",
      "width": "2316",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/nicholasm.jpg"
    },
    "biography": null,
    "website": null
  },
  "11568": {
    "name": "Isabella Rodriguez",
    "title": "Student",
    "organization": "LAUSD",
    "photo": null,
    "biography": null,
    "website": null
  },
  "11569": {
    "name": "Helen Ortiz",
    "title": "Student",
    "organization": "LAUSD",
    "photo": {
      "alt": null,
      "height": "2316",
      "width": "2316",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/heleno.jpg"
    },
    "biography": null,
    "website": null
  },
  "11570": {
    "name": "Tea Kostka",
    "title": null,
    "organization": null,
    "photo": null,
    "biography": null,
    "website": null
  },
  "11579": {
    "name": "Saian Ford",
    "title": "Product Owner",
    "organization": "Arkusnexus",
    "photo": null,
    "biography": null,
    "website": null
  },
  "11581": {
    "name": "Jef Spaleta",
    "title": "Technical Community Advocate",
    "organization": "Isovalent",
    "photo": {
      "alt": null,
      "height": "2048",
      "width": "1365",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/DSC06563.jpg"
    },
    "biography": null,
    "website": null
  },
  "11584": {
    "name": "Aaron Vega",
    "title": "Software Engineer/Architect",
    "organization": "ArkusNexus",
    "photo": null,
    "biography": null,
    "website": {
      "name": "arkusnexus.com",
      "url": "https://www.arkusnexus.com/"
    }
  },
  "11589": {
    "name": "Lu Qiu",
    "title": "Machine Learning Engineer",
    "organization": "Alluxio",
    "photo": {
      "alt": null,
      "height": "1577",
      "width": "2362",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Lu-small.jpg"
    },
    "biography": "PMC maintainer of open source project Alluxio. An active contributor to Ray & PyTorch.\nAI researcher and machine learning engineer of Alluxio.",
    "website": null
  },
  "11591": {
    "name": "Kyongsik Yun",
    "title": null,
    "organization": "California Institute of Technology",
    "photo": null,
    "biography": null,
    "website": null
  },
  "11594": {
    "name": "Quentin Deslandes",
    "title": "Software Engineer",
    "organization": "Meta",
    "photo": null,
    "biography": null,
    "website": null
  },
  "11597": {
    "name": "Adrian Todorov",
    "title": "Solutions Architect ",
    "organization": "HashiCorp ",
    "photo": null,
    "biography": null,
    "website": {
      "name": "https://atodorov.me",
      "url": "https://atodorov.me"
    }
  },
  "11598": {
    "name": "Sunil Govindan",
    "title": "Senior Engineering Manager",
    "organization": "Cloudera",
    "photo": {
      "alt": null,
      "height": "800",
      "width": "800",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/sunil.jpeg"
    },
    "biography": "Sunil Govindan is Senior Engineering . Sunil is primarily focussing on Resource Scheduling areas and contributing to Apache YuniKorn Scheduler for Kubernetes as a Committer and member of PMC from 2019 onwards. He has been an ASF Member since 2022 and has been contributing to the Apache Hadoop YARN project since 2013 in various roles as a Committer and a Project Management Committee (PMC) member.\n \n Manager@Cloudera",
    "website": null
  },
  "11599": {
    "name": "John Sweeting",
    "title": "Chief Customer Officer",
    "organization": "American Registry for Internet Numbers (ARIN) ",
    "photo": {
      "alt": null,
      "height": "3024",
      "width": "3024",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/John%20Sweeting.jpeg"
    },
    "biography": "John Sweeting is the Chief Customer Officer of the American Registry for Internet Numbers (ARIN), responsible for the overall development, direction and operation of the department. Prior to joining ARIN staff, he served 12 years on the ARIN Advisory Council, 6 of which he was the Chair, and 1 year on the Address Supporting Organization’s Address Council (ASO AC). John served on the Consolidated RIR IANA Stewardship Proposal (CRISP) team which was convened in December 2014 to guide development of the Number Community response to the IANA Stewardship Transition Coordination Group’s RFP. John’s experience in the Internet industry includes building and managing large global networks with international carriers such as MCI, Cable & Wireless, Teleglobe and Tata. Most recently John served as the Senior Director of Architecture & Engineering for Time Warner Cable, responsible for the selection and testing of all network infrastructure from the core backbone to the service delivery platforms.",
    "website": {
      "name": "ARIN website",
      "url": "http://www.arin.net"
    }
  },
  "11602": {
    "name": "Anirudh Ramanathan",
    "title": "CTO",
    "organization": "Signadot",
    "photo": {
      "alt": null,
      "height": "800",
      "width": "800",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/1574383373845%20%282%29.jpeg"
    },
    "biography": "Anirudh Ramanathan is CTO of Signadot where he focuses on building tools that enable testing of microservices at scale. Prior to this, he was a Software Engineer on the Kubernetes Team at Google where he worked on Kubernetes workload controllers (Deployment, StatefulSet, etc), and enabling stateful and batch workloads in Kubernetes. He led UG Big Data in the Kubernetes community and is an Apache Spark committer.",
    "website": {
      "name": "Personal Website",
      "url": "https://foxish.me"
    }
  },
  "11604": {
    "name": "Reid Vandewiele",
    "title": "Product Engineer",
    "organization": "StormForge",
    "photo": {
      "alt": null,
      "height": "2264",
      "width": "2264",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/reid-2022-square.jpg"
    },
    "biography": "Reid works at StormForge, a Kubernetes infrastructure optimization company, splitting his time between product UX design, software development, and customer-facing professional services. Prior to StormForge he spent ten years in various roles as Puppet. IT automation, technical user experience, and workflow optimization have always been a passion. While normally a stickler for intuitive design, he does extend a personal UX pardon to Vim and to Git, despite their idiosyncrasies. Reid lives in the Pacific Northwest, spending many of his non-work days hiking, scrambling, and snow mountaineering in the Cascade Range, and playing ultimate frisbee pick-up games in the rain.",
    "website": null
  },
  "11605": {
    "name": "Tom Bereknyei",
    "title": "Director of Labs",
    "organization": "flox",
    "photo": null,
    "biography": null,
    "website": null
  },
  "11610": {
    "name": "Michael Stahnke",
    "title": "VP Engineering",
    "organization": "flox",
    "photo": {
      "alt": null,
      "height": "831",
      "width": "810",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/michael-stahnke%20cropped.png"
    },
    "biography": "Michael Stahnke is a seasoned engineering executive, having spent the last 15 years working in the development and operational tooling space where also did research and was an author on Puppet’s State of DevOps Reports. Michael is VP of Engineering at Flox. He was previously in senior engineering leadership at CircleCI and Puppet where he grew engineering teams by 5x or more. He has spent time building high performing teams, organizations and researching engineering effectiveness in addition to hacking on packaging and release systems.  He’s been speaking at DevOps and Automation events since 2007. He founded the package repository Extra Packages for Enterprise Linux (EPEL) and wrote a book on OpenSSH in 2005.",
    "website": null
  },
  "11612": {
    "name": "Justin Marquis",
    "title": "Technical Support Engineer",
    "organization": "Akuity.io",
    "photo": {
      "alt": null,
      "height": "800",
      "width": "640",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/58bb387d83d0dacbaf1081e0689f982e-large.jpg"
    },
    "biography": "Justin is a technical support engineer at Akuity and Argo CD maintainer. He is passionate about open source and cloud native technologies that leverage productivity. In his spare time you will find him hiking with his family or scuba diving the California Channel Islands.",
    "website": null
  },
  "11615": {
    "name": "Krishnakumar Ravi",
    "title": "Engineering Manager",
    "organization": "Microsoft",
    "photo": {
      "alt": null,
      "height": "420",
      "width": "420",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/KK-image.png"
    },
    "biography": "Krishnakumar (KK) started his professional life with porting Linux to embedded boards used in firewalls, electric networks etc. Spanning two decades of industry experience, KK has spent time solving challenges, building products and features in areas such as High performance computing (HPC), Scalable filesystems and Storage. He came to Microsoft as part of Storsimple (a hybrid cloud storage product) acquisition and stayed around working on intersection of edge and the cloud and spent time in Kubernetes space before moving to Databases. After being part of the journey building a growing PostgreSQL service on Azure he recently joined as Engineering manager for committers and contributors team focused on open-source PostgreSQL.",
    "website": {
      "name": "https://kkwriting.com/",
      "url": "https://kkwriting.com/"
    }
  },
  "11619": {
    "name": "Pietro DiCaprio",
    "title": "Software Engineer",
    "organization": "Vanilla OS - fabricators",
    "photo": {
      "alt": null,
      "height": "512",
      "width": "512",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/pietro_0.jpg"
    },
    "biography": "Interested in IT and software development since youth, a full time software developer, passionate of FOSS, Linux advocate and Linux server user since more than 10 years.",
    "website": {
      "name": "Vanilla OS",
      "url": "https://vanillaos.org"
    }
  },
  "11621": {
    "name": "Karen Yuen",
    "title": "Applied Science System Engineer",
    "organization": "Karen Yuen",
    "photo": null,
    "biography": "Karen Yuen is an Applied Science System engineer with 22+ years’ experience at the Jet Propulsion Laboratory. She is currently the Co-Lead for the NASA Transform to Open Science Mission, System Engineer the NASA’s Multi-Mission Processing Services (MMPS) Prototype and the co-investigator in the Thematic Observation Search Segmentation Collation Analysis (TOS2CA) Project. Previously, she was the Science Data Applications Lead for NASA's Orbiting Carbon Observatory-2/3 missions and worked on end user development for apply remote sensing data for science applications. In her spare time, she likes traveling, cooking, hiking, volunteering and dreams to fly a R-22 again.",
    "website": null
  },
  "11623": {
    "name": "Ryan Sipes",
    "title": "Product and Business Development Manager",
    "organization": "Mozilla / MZLA",
    "photo": null,
    "biography": null,
    "website": null
  },
  "11628": {
    "name": "Marcia Wilbur",
    "title": "Technical Writer",
    "organization": "Gnu Essentials",
    "photo": {
      "alt": null,
      "height": "100",
      "width": "100",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/mkw3.jpeg"
    },
    "biography": "Marcia Wilbur is a developer, maker, author and advocate in the FOSS space. In 2018, she created the raspberry pi image for Kids on Computers  used in Mexico for a new lab. The image was also created for desktop. She is a Debian dev and was lead Deb dev for Linux respin, a backup utility and distro customization tool. \n    While consulting at Intel, she developed the IEI AIOT Tank prototype, with demos. She wrote IOT tutorials and articles using Raspberry Pi with accelerators and had a blog in the Intel Developer Zone about writing: FOSS Content Creator.\nShe built the prototype for Intel's DevCloud in 2019 and worked on various projects in the retail space: RFID, Kiosks, Displays\nIn 2022 she hosted the AIOT Village at 2600's HOPE conference.\nShe is a hobbyist, enthusiast and recreational Machine Learning mechanic.",
    "website": {
      "name": "GNU Essentials",
      "url": "https://gnulinux.io"
    }
  },
  "11633": {
    "name": "Tadeh Hakopian",
    "title": "Program Manager",
    "organization": "Energy Vault",
    "photo": {
      "alt": null,
      "height": "764",
      "width": "732",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/TADEH-HAKOPIAN-KCDC-20220807_747X991_SQ_JPG.jpg"
    },
    "biography": "With a background in Architecture and Development Tadeh has supported building large scale projects with diverse teams for over 10 years. By promoting open dialogue, systems thinking, and long term planning he has improved operational efficiencies in all his endeavors. He is a course author, trainer, and open source contributor as well as a speaker at national conferences in technology, architecture, design. He loves to talk about the new possibilities with technology and innovation at everyone’s disposal while building communities along the way.",
    "website": {
      "name": "Linkedin",
      "url": "https://www.linkedin.com/in/thakopian/"
    }
  },
  "11635": {
    "name": "Lleyton Gray",
    "title": "Catgirl Executive Officer",
    "organization": "Fyra Labs",
    "photo": {
      "alt": null,
      "height": "400",
      "width": "400",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/92gjCvxv_400x400.png"
    },
    "biography": "A catgirl technologist and cypherpunk, passionate about cutting-edge open source tech. Shipped XDG accent colors and many other things.",
    "website": {
      "name": "Personal Site",
      "url": "https://lleyton.fyralabs.com"
    }
  },
  "11640": {
    "name": "Jaiden Riordan",
    "title": "Chief Operating Officer",
    "organization": "Fyra Labs",
    "photo": {
      "alt": null,
      "height": "460",
      "width": "460",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/37665485_1.png"
    },
    "biography": "Hey! I’m Jaiden! I'm the COO at Fyra Labs, we're creating a better future through cutting-edge, open-source technology. This is my first time attending SCALE, I'm excited to share!",
    "website": {
      "name": "Personal Site",
      "url": "http://jaiden.sh"
    }
  },
  "11641": {
    "name": "Alexis Roberson",
    "title": "Developer Advocate",
    "organization": "Elastic",
    "photo": {
      "alt": null,
      "height": "3600",
      "width": "2400",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Portraits-031_Original.jpeg"
    },
    "biography": "Alexis is a Developer Advocate at Elastic, where she focuses on adding support for developers through online content with a focus on DevOps and Observability. Before Elastic, Alexis worked as a DevOps Engineer where she was responsible for managing infrastructure. With a BS in Computer Science, Alexis cares about making concepts accessible to all by explaining complex topics in simple ways.",
    "website": null
  },
  "11642": {
    "name": "Nick Meyer",
    "title": "Senior Software Engineer",
    "organization": "Academia.edu",
    "photo": {
      "alt": null,
      "height": "501",
      "width": "470",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/profile_nickmeyer.jpg"
    },
    "biography": "Nick Meyer studied physics and computer science at Caltech, and is currently a Senior Software Engineer on the Platform Engineering team at Academia.edu. A major focus during his tenure at Academia.edu has been streamlining and modernizing the data layer, in particular projects around operations of Academia.edu's PostgreSQL clusters, including upgrades, partitioning, and backup tooling.",
    "website": null
  },
  "11643": {
    "name": "Erik Mondrian",
    "title": null,
    "organization": null,
    "photo": {
      "alt": null,
      "height": "400",
      "width": "400",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/erik-mondrian.png"
    },
    "biography": "Erik Alessandro Mondrian (he/they) is a writer, visual artist, vocalist, musician, filmmaker, scholar, and longtime explorer of virtual worlds. He holds a BA in French, with a minor in Spanish, from the University of Hawaiʻi at Mānoa; an MA in Communication, with a specialization in Mass Communication and Media Studies, from San Diego State University; and an Interschool MFA in VoiceArts & Creative Writing, with a concentration in Integrated Media, from the California Institute of the Arts. He is currently pursuing a Master of Science in  at the University of California, Santa Barbara.\n \n Media Arts and Technology",
    "website": {
      "name": "https://www.youtube.com/erikMondrian",
      "url": "https://www.youtube.com/erikMondrian"
    }
  },
  "11645": {
    "name": "Camila Ayres",
    "title": "Software Engineer",
    "organization": "Nextcloud",
    "photo": {
      "alt": null,
      "height": "2243",
      "width": "2243",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/camila.jpg"
    },
    "biography": "Camila is from Brazil currently living in Berlin, Germany. She has worked for years as a front-end developer and got into open source by learning and doing C++/Qt development in the KDE community. After moving to Berlin, Germany, she also worked with PHP, Ruby on Rails and AngularJS, Go and Drupal 7. She's now a desktop client developer at Nextcloud but just might do other things than C++ sometimes.",
    "website": null
  },
  "11647": {
    "name": "Gleb Otochkin",
    "title": "Cloud Advocate, Databases",
    "organization": "Google",
    "photo": {
      "alt": null,
      "height": "1398",
      "width": "1746",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/IMG_5398.jpg"
    },
    "biography": "Gleb is a Cloud Advocate at Google with expertise in Cloud Database technologies in the Google Cloud. He has over 20 years of experience in data-related technologies, including relational databases, Big Data, application development, data replication and integration solutions. He has worked with products from Google, Oracle, AWS, Cloudera, and other vendors. Gleb has been a presenter at various conferences in the USA, Europe, and APAC.",
    "website": null
  },
  "11649": {
    "name": "Maria Ashby",
    "title": "Developer Advocate",
    "organization": "Kubeshop",
    "photo": null,
    "biography": "Maria is a developer advocate at Kubeshop. She currently works on the Botkube project. She creates content and hosts events around Kubernetes.  Maria is passionate about lowering the barrier to entry into continuous delivery and increasing representation for black students in tech.",
    "website": null
  },
  "11651": {
    "name": "Khai Pham",
    "title": "Founder & CEO",
    "organization": "ThinkingNodeLife.ai",
    "photo": {
      "alt": null,
      "height": "1000",
      "width": "1000",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/KMP-2023-1000.png"
    },
    "biography": "In AI for 30y, Khai Pham, MD & PhD (AI), works on unifying AI (Machine Learning, Reasoning AI, and Distributed Multi-Agent AI). A leading expert in Distributed AI, he was the founder & CEO of DataMind, a fintech AI using his 1st AI system (renamed RightPoint, acq. for US$637M). At ThinkingNodeLife.ai, he introduces the Generative Distributed Reasoning AI. It is based on reasoning and not machine learning and generates reasoning models and not texts, images, or videos. For drug R&D, it generates sophisticated Digital Cell Clones allowing Human Cell Safety/Efficacy/Specificity Simulations before preclinical testing. The exec. team was involved in $10+B exits. He is also a founding board member of KWAAI.ai (non-profit AI Lab Democratizing AI). MD and PhD in AI (Magna Cum Laude at Sorbonne University). Published papers, got international grants, taught AI at LISH-CNRS, awarded from BP, was EIR/Mentor at CONNECT, talked as keynote and guest lecturer at Dresden International University.",
    "website": {
      "name": "ThinkingNodeLife.ai",
      "url": "http://www.thinkingnodelife.ai"
    }
  },
  "11672": {
    "name": "Michael Wang",
    "title": null,
    "organization": "Santa Margarita Catholic High School",
    "photo": null,
    "biography": "I am a sophomore in high school, with experience in Machine learning, AI visual tracking, robotics, coding, and I have been involved in some open-source projects.",
    "website": null
  },
  "11676": {
    "name": "Ethan Sun",
    "title": null,
    "organization": null,
    "photo": {
      "alt": null,
      "height": "3024",
      "width": "4032",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/EthanSun.jpg"
    },
    "biography": "Ethan Sun currently lives in San Diego, California, where he attends The Bishop's School as a junior. With extensive experience in technology innovation, STEM education, nonprofit leadership, micro-finance investment, robotics, fundraising, and humanitarian aid, Ethan has led numerous initiatives to empower underprivileged communities through technology, education, mentorship, fundraising, and volunteer work. He is committed to creating a positive social impact through technology innovation and implementation. In his free time, Ethan is passionate about exploring and experiencing the fascinating diversity of the world. He also enjoys playing the piano, listening to music, and learning multiple languages.",
    "website": null
  },
  "11681": {
    "name": "Autumn Nash",
    "title": "Software Development Engineer ",
    "organization": "AWS",
    "photo": {
      "alt": null,
      "height": "924",
      "width": "822",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Screenshot%202023-08-07%20at%204.03.12%20PM.png"
    },
    "biography": "With over three years at Amazon Web Services (AWS) as a Software Development Engineer, I currently contribute to the Language and Runtimes team, specializing in the development and release of Amazon Corretto (Java) while actively engaging in the OpenJDK community. Prior to this, my role as a NoSQL Solutions Architect involved guiding organizations in selecting purpose-built NoSQL databases, utilizing Python and Java to unblock customers and contribute to educational content. In addition to my technical expertise in solutions engineering, back-end web development, and cloud computing, I am proud to be a mom, bringing a unique perspective to the tech industry. I am also an alumni member of Rewriting the Code, further enriching my commitment to effective communication and education. Serving as the Board Chair of Education at MilSpouse Coders and as a Chapter Leader for the Greater Seattle Area, my advocacy for collaborative learning and community development extends beyond technology.",
    "website": {
      "name": "Linkedin",
      "url": "https://www.linkedin.com/in/autumnnash/"
    }
  },
  "11682": {
    "name": "Christine Li",
    "title": null,
    "organization": null,
    "photo": null,
    "biography": null,
    "website": null
  },
  "11684": {
    "name": "Vivienne Byrd",
    "title": "STEAM Librarian III/Program Lead - Full STEAM Ahead  & Citizen Science Initiative.",
    "organization": "Los Angeles Public Library",
    "photo": {
      "alt": null,
      "height": "2172",
      "width": "1780",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/VB_JPN.JPG"
    },
    "biography": null,
    "website": null
  },
  "11709": {
    "name": "Erik Wessel",
    "title": "Graduate Researcher",
    "organization": "University of Arizona",
    "photo": {
      "alt": null,
      "height": "993",
      "width": "1000",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/headshot_cropped.jpg"
    },
    "biography": "Erik Wessel is a graduate student and PhD candidate at the Department of Physics at the University of Arizona. He works in the numerical relativity group of Professor Vasileios Paschalidis. He has received NASA's FINESST fellowship to support his work on developing a neutrino-transport code for modeling binary neutron star mergers. Erik is the lead author on two publications investigating the potential for instabilities in massive accretion disks to produce gravitational wave signals detectable by next generation gravitational wave observatories. He received a Bachelor of Engineering Physics from the University of Illinois at Urbana-Champaign, where he also worked on numerical relativity with Dr. Eliu Huerta as part of the LIGO scientific collaboration. Prior to that, Erik worked on multiple software development projects as a student employee and NASA Space Grant Intern at the University of Hawaii at Manoa.",
    "website": null
  },
  "11714": {
    "name": "Kimberly Vallejo",
    "title": "Student",
    "organization": "DIY Girls",
    "photo": {
      "alt": null,
      "height": "4032",
      "width": "3024",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/IMG_1649.JPG"
    },
    "biography": "Kimberly is a senior in high school and is planning to pursue a career in medicine. In her spare time she likes to read, run and spend time with friends and family.",
    "website": {
      "name": "Student Portfolio",
      "url": "https://sites.google.com/mymail.lausd.net/kimberlyvallejo?usp=sharing"
    }
  },
  "11715": {
    "name": "Dan Schatzberg",
    "title": "Research Scientist",
    "organization": "Meta",
    "photo": null,
    "biography": "Dan Schatzberg is a Research Scientist at Meta where he leads the Containers and Resource Control teams. He works at the intersection of the Linux kernel and userspace in the domains of memory management, block I/O and scheduling to improve isolation and efficiency for the thousands of services Meta runs in production. Most recently, he's been involved in the development of sched_ext, a framework for extending Linux with schedulers implemented in BPF.",
    "website": null
  },
  "11717": {
    "name": "Cynthia Prieto-Espinoza",
    "title": "Student",
    "organization": "DIY Girls",
    "photo": {
      "alt": null,
      "height": "493",
      "width": "339",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/headshot_Cynthia.png"
    },
    "biography": "Cynthia Prieto is a senior at San Fernando Magnet High School who is passionate about creation through engineering and coding. She also finds joy in spending her free time playing the guitar, creating digital art, and playing video games.",
    "website": null
  },
  "11718": {
    "name": "Alexa Hernandez",
    "title": null,
    "organization": "DIY Girls",
    "photo": {
      "alt": null,
      "height": "4032",
      "width": "3024",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/IMG_1979.jpeg"
    },
    "biography": "Alexa Hernandez is a 10th grader in the Invent Girls program in San Fernando, CA. She enjoys hands-on projects as well as coding which is why she enjoys being part of Invent Girls. She is a young first-gen Latina aspiring to go to the best-ranked STEM universities like MIT or Cal Tech. Outside of school, she enjoys reading fantasy sci-fi books and watching World Crisis films because of the self-preservation component and always a chance to learn something new.",
    "website": {
      "name": "Student Portfolio",
      "url": "https://sites.google.com/mymail.lausd.net/alexahernandez/home?authuser=0"
    }
  },
  "11719": {
    "name": "Adanelly Chavez",
    "title": "Student",
    "organization": "DIY Girls",
    "photo": {
      "alt": null,
      "height": "2582",
      "width": "2014",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Image%20from%20iOS%20-%202024-01-18T085535.203.jpg"
    },
    "biography": "Adanelly is a senior at San Fernando High School and is interested in studying engineering when she goes to college. Through DIY Girls, she's had the opportunity to execute various projects that address a specific problem such as MedMe, a timed pill dispenser (2020-21), Robodoro study companion (2021-22), Intelliplant seld-watering plant system (2022-2023), and Digital Safe (2023-24). She has been a part of this organization since elementary school and, upon high school graduation, will be one of the first students to go through their entire program, having successfully completed their elementary (Creative Electronics), middle (Creative Engineering and summer Woodworking Camp), and high school (Invent Girls) curriculums.",
    "website": {
      "name": "DIY Girls",
      "url": "https://diygirls.org/programs/"
    }
  },
  "11721": {
    "name": "Yihong Wang",
    "title": "Senior Software Developer",
    "organization": "IBM",
    "photo": {
      "alt": null,
      "height": "251",
      "width": "263",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/IMG_3284.jpeg"
    },
    "biography": "Yi-Hong Wang is a software developer with the Watson AI and Data Open Technologies group at the IBM Silicon Valley Lab, where he actively works on the Kubeflow, and Presto, Node.js communities. He has been successfully delivering several Kubeflow releases to IBM Kubernetes Service. He is leading the Intermediate Representation adoption in the Kubeflow Pipelines with the Tekton project and helping the community to run ML workflow in multiple frameworks.",
    "website": null
  },
  "11722": {
    "name": "Kiersten Stokes",
    "title": "Open Source Software Developer",
    "organization": "IBM",
    "photo": {
      "alt": null,
      "height": "512",
      "width": "512",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/profilepic_0.jpeg"
    },
    "biography": "Kiersten is an open-source software developer with the Watson AI and Data Open Technologies Group. She has been an active contributor to several AI technologies over the last several years including Jupyter Enterprise Gateway, PyTorch, and Presto. In addition to contributing quality code, she is passionate about increasing the eminence of the projects that she works on by writing blog posts, thoroughly documenting software features & capabilities, and mentoring new contributors to open source.",
    "website": null
  },
  "11747": {
    "name": "Fabrizio Sgura",
    "title": "Chief Engineer",
    "organization": "Veritas Automata",
    "photo": {
      "alt": null,
      "height": "375",
      "width": "375",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/linkedin.jpeg"
    },
    "biography": "I am the Chief Engineer at Veritas Automata, currently focusing on distributed systems, Kubernetes, and cloud-native applications. I am an enthusiastic believer in blockchain technologies, supply chain, cold chain, pharma applications, and trust in automation. I actively work on innovation, following the latest technologies and integrations, including AI and controls in automation.\nMy current most involving activity is the development of the Hivenet platform for VA, to provide k-native options to whoever needs to get a ready-to-use toolset to solve the future.",
    "website": {
      "name": "Fabrizio Sgura",
      "url": "https://www.linkedin.com/in/fabrizio-sgura/"
    }
  },
  "11748": {
    "name": "Simon Wong",
    "title": "SRE Program Manager",
    "organization": "edmunds.com",
    "photo": {
      "alt": null,
      "height": "4062",
      "width": "4316",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/DSC_8719.jpg"
    },
    "biography": "Simon brings a holistic approach to team and organizational success through his expertise in web technology, performance, and process management. Simon enjoys the outdoors, photography, and gardening. Spending more time with his two young children is the latest excuse to his awful golf game.",
    "website": null
  },
  "11749": {
    "name": "Wei Tang",
    "title": "MTS 2, Software Engineer",
    "organization": "eBay Inc.",
    "photo": {
      "alt": null,
      "height": "1498",
      "width": "1069",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/IMG_2227.JPG"
    },
    "biography": "Wei Tang's career began at Morgan Stanley as a Time Series Engineer, focusing on ETL pipeline design and development in the finance sector. He then moved to eBay, progressing through various roles in infrastructure and software engineering. His work at eBay included building and enhancing significant platforms and tools, like the Sherlock anomaly detection platform and the Cronus agent for software deployment. His technical skills encompass a range of programming languages and technologies, including Java, Python, Golang, and Kubernetes.\nIn the past two years, Wei Tang has dedicated his expertise to building a cutting-edge distributed tracing platform. This initiative showcases his advanced skills in distributed systems and his commitment to enhancing system observability and performance analysis. His role involved intricate design and implementation, leveraging his deep understanding of software engineering principles to create a robust and scalable solution.",
    "website": {
      "name": "Github",
      "url": "https://github.com/alburthoffman"
    }
  },
  "11753": {
    "name": "Xavier Rene-Corail",
    "title": "Senior Director, Security Research",
    "organization": "GitHub",
    "photo": {
      "alt": null,
      "height": "500",
      "width": "500",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/headshot-2023-square.png"
    },
    "biography": "Xavier René-Corail is the Senior Director of the GitHub Security Lab. His mission is to inspire the open source community, security researchers, and developers to secure open source software through better security practices. Prior to GitHub, Xavier was the Head of Developer Advocacy at Semmle, acquired by GitHub in 2019, and an engineering manager at Murex, where he drove the deployment of development best practices including eXtreme Programing (XP), test-driven development (TDD), Agile, DevOps, open source policy, and secure coding.",
    "website": {
      "name": "The GitHub Security Lab",
      "url": "https://securitylab.github.com"
    }
  },
  "11754": {
    "name": "Wanda He",
    "title": "Prin. Database Specialist SA",
    "organization": "AWS",
    "photo": null,
    "biography": null,
    "website": null
  },
  "11764": {
    "name": "Oz Katz",
    "title": "CTO & Co-Founder",
    "organization": "Treeverse",
    "photo": {
      "alt": null,
      "height": "1000",
      "width": "1000",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/oz_katz.jpeg"
    },
    "biography": "Oz Katz is the Co-Creator of the open source lakeFS Project, an open source platform that delivers resilience and manageability to object-storage based data lakes, as well as the CTO and co-founder of Treeverse, the company behind lakeFS. Oz engineered and maintained petabyte-scale data infrastructure at analytics giant SmilarWeb, which he joined after the acquisition of Swayy.",
    "website": {
      "name": "lakeFS",
      "url": "https://lakefs.io"
    }
  },
  "11770": {
    "name": "Stephanie Lieggi",
    "title": "Executive Director",
    "organization": "UC Santa Cruz OSPO / Center for Research in Open Source Software",
    "photo": {
      "alt": null,
      "height": "1027",
      "width": "1200",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/steph%20%281%29.jpg"
    },
    "biography": "Stephanie Lieggi is executive director for the Center for Research in Open Source Software (CROSS) and the UC Santa Cruz Open Source Program Office (OSPO). In her current role, she supports the work of academic-based open source projects and enables a sustainable contributor base through the establishment of hands-on mentorship programs. Stephanie promotes the use of open source in academic settings as well as increasing diversity and inclusion in open source ecosystems.",
    "website": {
      "name": "UCSC OSPO",
      "url": "http://ospo.ucsc.edu"
    }
  },
  "11779": {
    "name": "Aaron Prisk",
    "title": "Community Engineer",
    "organization": "Canonical",
    "photo": {
      "alt": null,
      "height": "300",
      "width": "200",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/aprisk-photo.jpg"
    },
    "biography": "Aaron Prisk is a Community Engineer at Canonical who works to support, empower and the grow the global Ubuntu community. Prior to working for Canonical, they spent a decade working in public education IT spearheading various nationally recognized open source initiatives. When they aren't tinkering on some open source project at home, they're probably going on adventures with their kids, brewing beer or reading an old book.",
    "website": null
  },
  "11783": {
    "name": "Felipe Reyes",
    "title": "Software Engineer",
    "organization": "Canonical",
    "photo": {
      "alt": null,
      "height": "2048",
      "width": "1365",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/light%20bg%20-%20light%20blue%20tshirt.jpg"
    },
    "biography": "Felipe Reyes has over 20 years of Linux experience, he has been working at Canonical for the last 9 years, he joined the Sustaining Engineering group providing support for Canonical's cloud offerings, later transitioned to the OpenStack Engineering team where he currently develops Charmed OpenStack and serves as PTL for the 2024.1 (Caracal) cycle.",
    "website": null
  },
  "11784": {
    "name": "Ken VanDine",
    "title": "Staff Engineer",
    "organization": "Canonical",
    "photo": {
      "alt": null,
      "height": "1024",
      "width": "1024",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/IMG08060-1024x1024.jpg"
    },
    "biography": null,
    "website": null
  },
  "11798": {
    "name": "Caleb Schoepp",
    "title": "Software Engineer",
    "organization": "Fermyon",
    "photo": {
      "alt": null,
      "height": "2667",
      "width": "4000",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Profile%20Picture-min.jpg"
    },
    "biography": "Caleb Schoepp is a software engineer at Fermyon. Before working at Fermyon he interned at Microsoft three times on different teams and at the startups UnifyID and Resemble AI. Caleb has experience building on public clouds, mobile apps, full stack web applications, and machine learning integrations among other things. Outside of work he enjoys playing guitar, spending time with family, and playing hockey. Caleb holds a BSc in Computer Engineering from the University of Alberta. He lives in Edmonton, Alberta.",
    "website": {
      "name": "Personal Blog",
      "url": "https://calebschoepp.com"
    }
  },
  "11800": {
    "name": "Callahan Kovacs",
    "title": "Software Engineer",
    "organization": "Canonical",
    "photo": {
      "alt": null,
      "height": "546",
      "width": "546",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/profile-picture.jpg"
    },
    "biography": "Callahan is a software developer at Canonical where he focuses on Snapcraft, a developer tool for building and packaging applications. He enjoys fabrication and writing about himself in the third person.",
    "website": null
  },
  "11813": {
    "name": "Forrest Brazeal",
    "title": null,
    "organization": null,
    "photo": {
      "alt": null,
      "height": "2381",
      "width": "2000",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/IMG_1418.JPG"
    },
    "biography": null,
    "website": null
  },
  "11816": {
    "name": "Viral Shah",
    "title": "Co-founder and CEO",
    "organization": "JuliaHub",
    "photo": {
      "alt": null,
      "height": "892",
      "width": "964",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/viral2.jpeg"
    },
    "biography": "Dr. Viral B. Shah is one of the creators of the Julia programming language and co-founder and CEO of JuliaHub. Julia combines the ease of use of Python with the speed of C. It has been downloaded over 50 million times, and is now taught at MIT, Berkeley, Stanford, and many universities worldwide. Dr. Shah received the prestigious James H. Wilkinson Prize for Numerical Software in 2019. He is also one of the authors of Circuitscape, an open-source program that borrows algorithms from electronic circuit theory for ecological conservation. Dr. Shah helped create India’s national identification project (Aadhaar), where his work on re-architecting India’s social security systems led to a significant increase in social and financial inclusion. His book - Rebooting India - describes his experience with building digital public goods and what it takes to execute large bold projects in government. Dr. Shah earned his PhD in Computer Science from the UC Santa Barbara.",
    "website": {
      "name": "JuliaHub",
      "url": "https://juliahub.com"
    }
  },
  "11821": {
    "name": "Jon Worley",
    "title": "Senior Technology Architect",
    "organization": "American Registry for Internet Numbers (ARIN) ",
    "photo": {
      "alt": null,
      "height": "1111",
      "width": "740",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Jon%20Worley.png"
    },
    "biography": "Jon Worley has been an integral member of the ARIN team since 2004, currently serving as the Senior Technology Architect. He possesses extensive knowledge and expertise in all aspects of ARIN policies and procedures, specifically concerning the requesting, managing, and transferring of IP addresses and AS numbers, and technical services such as ARIN's RESTful API. Jon has shared his expertise on these subjects, as well as IPv4 depletion and IPv6 adoption, as a speaker at numerous Internet industry events.",
    "website": {
      "name": "ARIN website",
      "url": "http://www.arin.net"
    }
  },
  "11822": {
    "name": "Pierre Penninckx",
    "title": "Engineer",
    "organization": "Fastly",
    "photo": {
      "alt": null,
      "height": "1352",
      "width": "738",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/B313D0C0-4180-4505-8258-C3A89619BCDF.jpeg"
    },
    "biography": "Work @Fastly; self hosting, privacy and data sovereignty advocate. For 12 years now, I've been self hosting everything I can because I firmly believe it's the only way to keep you data under control. I went through the full spectrum of imperative scripts to fully declarative configuration with NixOS. My current project is to provide building blocks for people to easily self host common services but also any service they want by providing NixOS modules that each manage one aspect of self hosting. I am married to a wonderful wife and am a proud father of 6 <3",
    "website": {
      "name": "blog",
      "url": "https://blog.tiserbox.com/"
    }
  },
  "11823": {
    "name": "Samir Rashid",
    "title": "Student",
    "organization": "University of California, San Diego",
    "photo": {
      "alt": null,
      "height": "1000",
      "width": "1000",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/profile-small.png"
    },
    "biography": "I am a NixOS enthusiast interested in making it easy to create safe software. I contribute to the Rust-based Tock Operating System and am working towards ensuring that systems software is reliable and correct.",
    "website": {
      "name": "Personal Website",
      "url": "https://godsped.com/"
    }
  },
  "11825": {
    "name": "Xe iaso",
    "title": "Senior Technophilosopher",
    "organization": "fly.io",
    "photo": {
      "alt": null,
      "height": "905",
      "width": "905",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Xe%20Iaso%20Headshot%20With%20Background%20%281%29.png"
    },
    "biography": "I'm Xe iaso, a technical educator, twitch streamer, vtuber, and philosopher that focuses on ways to help make technology easier to understand and do cursed things in the process. I live in Ottawa with my husband and I do developer relations professionally. I am an avid writer for my blog xeiaso.net, where I have over 400 articles. I regularly experiment with new technologies and find ways to mash them up with old technologies for my own amusement.",
    "website": {
      "name": "Blog",
      "url": "https://xeiaso.net"
    }
  },
  "11832": {
    "name": "Pedro Nacht",
    "title": "Software Engineer",
    "organization": "Google",
    "photo": {
      "alt": null,
      "height": "2073",
      "width": "2073",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/20170120_202204%20%283%29.jpg"
    },
    "biography": "Professionally... let's just say I've been around. I started off as a structural engineer, but soon migrated to developing software for engineers for a while. After a hiatus doing an MBA, I worked in the financial industry doing data science. Looking to make more of an impact, I joined Google's Open Source Security Team (GOSST), specifically the .\n \n Upstream Team \n    At GOSST, I work hands-on with maintainers of critical open-source projects to improve their supply-chain security, as well as engage with the broader community via blog posts, helping out with the , and participaing and presenting in conferences ( at the Open Source Summit Europe last year).\n \n \n CNCF's Security Slam Adventures in Securing an Open-Source Project",
    "website": {
      "name": "GitHub",
      "url": "https://github.com/pnacht"
    }
  },
  "11836": {
    "name": "Alice Chen",
    "title": "Co-Founder & CTO",
    "organization": "OpenContext",
    "photo": {
      "alt": null,
      "height": "493",
      "width": "404",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/ALC-head0.png"
    },
    "biography": "Alice Chen is the Co-Founder and CTO of OpenContext. With over 20 years of experience in the tech industry, Alice has worn many hats including systems engineering, build engineering, operations, QA, DevOps and solutions architecture. She specializes in designing and implementing systems to move data from one place to another. Passionate about automation, Alice is dedicated to building tools like OpenContext to provide insights the DevSecOps teams need to reduce toil.",
    "website": {
      "name": "OpenContext",
      "url": "https://www.opencontext.com/"
    }
  },
  "11844": {
    "name": "Casey Handmer",
    "title": "Founder",
    "organization": "Personal",
    "photo": {
      "alt": null,
      "height": "1646",
      "width": "1234",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/PXL_20220402_224847607.jpg"
    },
    "biography": "Casey Handmer is the founder of Terraform Industries, a company building synthetic natural gas from sunlight and air. He has worked on optics, gravitation, magnetic machinery, astrophysics, GPS, planetary mapping, and scrolls.",
    "website": {
      "name": "Terraform Industries",
      "url": "https://terraformindustries.com"
    }
  },
  "11846": {
    "name": "Bill Cheswick",
    "title": null,
    "organization": "cheswick.com",
    "photo": {
      "alt": null,
      "height": "2809",
      "width": "2399",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/fullches.jpg"
    },
    "biography": null,
    "website": {
      "name": "Bill Cheswick",
      "url": "https://cheswick.com"
    }
  },
  "11847": {
    "name": "Justin Pflueger",
    "title": "Senior Solutions Engineer",
    "organization": "Fermyon",
    "photo": {
      "alt": null,
      "height": "500",
      "width": "500",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/justin-pflueger.jpg"
    },
    "biography": "Justin Pflueger is a solution engineer for Fermyon Technologies. He is devoted to helping developers and businesses realize their ideas through the use of cutting-edge technologies like WebAssembly. Before Fermyon, he worked as part of the Commercial Software Engineering team at Microsoft, where he worked with Azure customers to design and implement customized solutions and contributed to open source projects like Azure Service Operator, Exposure Notifications Server and Spin. Outside of work, he is perpetually working on his golf swing and playing with his dogs. Justin currently resides in Fort Collins, CO.",
    "website": {
      "name": "LinkedIn",
      "url": "https://www.linkedin.com/in/justinpflueger/"
    }
  },
  "11867": {
    "name": "Maziar Tamadon",
    "title": "Product & Solution Marketing",
    "organization": null,
    "photo": {
      "alt": null,
      "height": "1100",
      "width": "1100",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Maziar%20Tamadon%20BW%20crop.jpg"
    },
    "biography": "Seasoned technology marketing leader, with a proven track record in defining, delivering and promoting generations of products to market, and a passion for Product Planning, Management and Marketing. Accomplished technology evangelist in Product & Solution Marketing, Business Development, Strategic Partnerships & Alliances, and Technical Sales, backed by a well-rounded knowledge of datacenter technologies (compute, storage, networking, virtualization, and security), combined with cloud native expertise (containers, Kubernetes).",
    "website": null
  }
}