{
  "62": {
    "name": "Kyle Rankin",
    "title": "Security and Infrastructure Professional, Author",
    "organization": null,
    "photo": {
      "alt": null,
      "height": "500",
      "width": "500",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/headshot4.png"
    },
    "biography": "Kyle Rankin is a security and infrastructure expert with over two decades of professional Linux experience. He is the author of How To Write A Tech Book, The Best of Hack and /: Linux Admin Crash Course, Linux Hardening in Hostile Networks, DevOps Troubleshooting, The Official Ubuntu Server Book, Third Edition, Knoppix Hacks, 2nd Edition, and Ubuntu Hacks, among other books. Rankin was an award-winning columnist and tech editor for Linux Journal, and speaks frequently on Free and Open Source software including at SCALE, FOSDEM, O’Reilly Security Conference, Linux Fest NorthWest, OpenWest, BSidesLV, CactusCon, OSCON, Linux World Expo, and Penguicon.",
    "website": {
      "name": "My Personal Site",
      "url": "https://kylerank.in"
    }
  },
  "174": {
    "name": "Stephen Walli",
    "title": "Principal Program Manager, Azure Office of the CTO",
    "organization": "Microsoft",
    "photo": {
      "alt": null,
      "height": "3712",
      "width": "5568",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Bio.jpg"
    },
    "biography": "Stephen is a principal program manager in the Azure Office of the CTO and adjunct faculty at Carnegie Mellon University. He has worked with open source software in the product space for 30+ years. He has been a technical executive, a founder and consultant, a writer and author, a systems developer, a software construction geek, and a standards diplomat. Developing software engineering learning experiences for students in the natural lab of well-run open source projects is an area of deep interest, as is enabling business people to better understand building better solutions for customers in open source community and deeper partnerships in open source nonprofits. He blogs on . \n \n \n \n \n \n Medium",
    "website": {
      "name": "Once More Unto The Breach",
      "url": "http://stephesblog.blogs.com"
    }
  },
  "254": {
    "name": "Nuri Halperin",
    "title": "Owner",
    "organization": "+N Consulting Inc.",
    "photo": {
      "alt": null,
      "height": "1448",
      "width": "1448",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/portraitskcdc0300_square_1448.png"
    },
    "biography": "Nuri Halperin is a software architect, speaker, and author. He helps companies design scalable systems, websites, and business applications. He’s been turning projects into success stories for a variety of clients for over 2 decades. He is the author of several Pluralsight.com courses. He's also a Microsoft MVP alum, a MongoDB Champions member, and recipient of MongoDB's William Zola Award for Community Excellence. He enjoys tinkering with Arduinos, 3D printing, and robotics.",
    "website": {
      "name": "Plus N Consulting",
      "url": "https://www.plusnconsulting.com"
    }
  },
  "259": {
    "name": "Dave Stokes",
    "title": "Technology Evangelist",
    "organization": "Percona",
    "photo": {
      "alt": null,
      "height": "2016",
      "width": "1134",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/davestokes1.jpg"
    },
    "biography": "Dave Stokes is a technology evangelist for Percona Corporation.  He has worked at companies ranging alphabetically from the American Heart Association to Xerox, has three college degrees, enjoys riding his Honda Goldwing motorcycle, lives in North Texas, and started with UNIX in the Version 7 days.  He is the author of MySQL & JSON - A Practical Programming Guide, which is available at Amazon.com",
    "website": {
      "name": "Percona",
      "url": "https://percona.com"
    }
  },
  "357": {
    "name": "Bradley Kuhn",
    "title": "Policy Fellow and Hacker-in-Residence",
    "organization": "Software Freedom Conservancy",
    "photo": {
      "alt": null,
      "height": "800",
      "width": "800",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/bkuhn-photo-2017.jpg"
    },
    "biography": "Bradley M. Kuhn is the Policy Fellow and Hacker-in-Residence at  (SFC). Kuhn began volunteering in the software freedom movement in 1992 — as an early adopter of Linux and contributor to many FOSS projects including Perl. As Free Software Foundation (FSF)'s Executive Director from 2001-2005, Kuhn led FSF’s GPL enforcement and invented the Affero GPL. Kuhn was SFC’s primary volunteer from 2006–2010 and its first staffer in 2011. At SFC Kuhn’s work focuses on enforcement of copyleft and the GPL agreements, FOSS licensing policy and FOSS non-profit infrastructure. Kuhn holds a summa cum laude B.S. in Computer Science from Loyola University in Maryland and an M.S. in Computer Science from University of Cincinnati. Kuhn received the 2012 Open Source Award and the 2021 Award for the Advancement of Free Software — both in recognition for his lifelong policy work on copyleft licensing and its enforcement.\n \n Software Freedom Conservancy",
    "website": {
      "name": "Software Freedom Conservancy",
      "url": "https://sfconservancy.org/"
    }
  },
  "409": {
    "name": "Jason Brooks",
    "title": null,
    "organization": "Red Hat",
    "photo": {
      "alt": null,
      "height": "533",
      "width": "338",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/jb_0.jpg"
    },
    "biography": "Jason Brooks is a software analyst with Red Hat, in the company's Open Source and Standards group. Previously, Jason spent 12 years as an analyst and editor with eWEEK Labs, testing and writing about enterprise IT, with a particular focus on Linux and open source software. Jason lives in San Francisco, California, with his wife and two sons.",
    "website": {
      "name": "jebpages",
      "url": "http://jebpages.com"
    }
  },
  "446": {
    "name": "Colin Charles",
    "title": "Managing Consultant",
    "organization": "GrokOpen",
    "photo": {
      "alt": null,
      "height": "755",
      "width": "500",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/colin_0.jpg"
    },
    "biography": "Colin Charles is the Managing Consultant at GrokOpen. Previously, Colin was on the founding team of MariaDB Server, and has been around the MySQL ecosystem including being an early employee at MySQL, and worked actively on the Fedora and OpenOffice.org projects. Colin has been a MySQL user since 2000. He's well known within open source communities, enjoys building business and market entry in APAC and has spoken at many conferences.",
    "website": {
      "name": "Blog",
      "url": "http://bytebot.net/blog/"
    }
  },
  "452": {
    "name": "Aleksey Tsalolikhin",
    "title": "Sr. DevOps Engineer",
    "organization": "Vertical Sysadmin, Inc.",
    "photo": {
      "alt": null,
      "height": "150",
      "width": "150",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/aleksey_tsalolikhin_headshot.jpg"
    },
    "biography": "Aleksey Tsalolikhin started his career in system administration at a local ISP (EarthLink) in the mid-nineties. Aleksey's mission is increasing the productivity and quality of life (and prosperity) of IT Operations practitioners through effective training in excellent technologies. Aleksey is a member of the UNIX Users Association of Southern California (UUASC) and the Association for Computing Machinery.",
    "website": {
      "name": "Vertical Sysadmin, Inc.",
      "url": "http://www.verticalsysadmin.com"
    }
  },
  "460": {
    "name": "Richard Gaskin",
    "title": "Ambassador",
    "organization": "Fourth World Systems",
    "photo": {
      "alt": null,
      "height": "192",
      "width": "192",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/RichardGaskin192.jpg"
    },
    "biography": "Richard Gaskin is the owner of Fourth World Systems, a software design and development consultancy in Los Angeles.  Since founding the company in 1994, he's developed dozens of commercial and open source applications used by a wide range of organizations, including FedEx, AOL, the US Library of Congress, and thousands of hospitals and universities around the world. Although he started his career with Mac OS, Richard has since delivered applications for Irix, every version of Windows, and has been developing for Linux for the last two years. Richard has spoken at dozens of tech conferences, including SCaLE, LiveCode Developer Conference, and MacTech where he had the distinction of being the only presenter using Ubuntu.",
    "website": {
      "name": "Fourth World Systems",
      "url": "http://www.fourthworld.com"
    }
  },
  "477": {
    "name": "Federico Lucifredi",
    "title": "Product Management Director",
    "organization": "Red Hat",
    "photo": {
      "alt": null,
      "height": "1152",
      "width": "946",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/F2%20Hedcut%20by%20Kevin%20Sprouls%20.jpg"
    },
    "biography": "Federico Lucifredi is the Product Management Director for Ceph Storage at Red Hat and a co-author of O'Reilly's \"Peccary Book\" on AWS System Administration. Previously, he was the Ubuntu Server product manager at Canonical, where he oversaw a broad portfolio and the rise of Ubuntu Server to the rank of most popular OS on Amazon AWS. A software engineer-turned-manager at the Novell corporation, he was part of the SUSE Linux team, overseeing the update lifecycle and delivery stack of a $150 million maintenance business. A CIO and a network software architect at advanced technology and embedded Linux startups, Federico was also a lecturer for over 200 students in Boston University's graduate and undergraduate programs, and simultaneously a consultant for MIT implementing fluid-dynamics simulations in Java.",
    "website": null
  },
  "483": {
    "name": "Matt Ingenthron",
    "title": "VP, Software Engineering",
    "organization": "Couchbase, Inc.",
    "photo": {
      "alt": null,
      "height": "1024",
      "width": "1024",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Matt%20Ingenthron%20Small%20Square%20Headshot.png"
    },
    "biography": "Matt Ingenthron is a VP of Software Engineering at Couchbase a software development background and experience with high-scale, high performance system design. He has deep expertise in building, scaling, and operating global-scale web deployments across many platforms. He has been a contributor to the memcached project and a core developer on Couchbase developing much of the early clustering platform interfaces. Matt's teams are currently building all of the SDKs/Connectors for Couchbase Capella and Couchbase Server, Cloud Native integration with Kubernetes and OpenShift, Developer Experience with frameworks and IDE plugins, and some of the new services on Couchbase Capella, Couchbase's DBaaS.",
    "website": {
      "name": "Matt's Couchbase Blog",
      "url": "http://blog.couchbase.com/matt"
    }
  },
  "496": {
    "name": "Ryan Jarvinen",
    "title": "Developer Advocate",
    "organization": "Red Hat",
    "photo": {
      "alt": null,
      "height": "1201",
      "width": "1200",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Ryan-Jarvinen-headshot-square-small.jpg"
    },
    "biography": "Ryan Jarvinen is a Developer Advocate at Red Hat, focusing on improving developer experience in the cloud native community. He lives in Sacramento, California and is passionate about open source, open standards, open government, and digital rights.",
    "website": {
      "name": "ryanjarvinen.com",
      "url": "http://ryanjarvinen.com"
    }
  },
  "929": {
    "name": "Christophe Pettus",
    "title": "CEO",
    "organization": "PostgreSQL Experts, Inc.",
    "photo": {
      "alt": null,
      "height": "1377",
      "width": "1377",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/xof%20square_0.jpg"
    },
    "biography": "Christophe has been working with PostgreSQL since 1997. He is the CEO of PostgreSQL Experts, Inc.",
    "website": {
      "name": "The Build",
      "url": "http://thebuild.com"
    }
  },
  "3714": {
    "name": "Steve Oualline",
    "title": "SW Eng.",
    "organization": "Linear Corp. LLC.",
    "photo": null,
    "biography": "Steve Oualline is the author of \"Practical C Programming\", \"How Not to Program in C++\" and many other programming books.  He has been a professional programmer for over 45 years and currently resides in San Diego.",
    "website": {
      "name": "http://www.oualline.com",
      "url": "http://www.oualline.com"
    }
  },
  "3759": {
    "name": "Scott Williams",
    "title": "Linux DevOps Engineer",
    "organization": "University of California Santa Barbara",
    "photo": {
      "alt": null,
      "height": "1938",
      "width": "1389",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/IMG_20220324_181625_023.jpg"
    },
    "biography": "Scott Williams is a senior DevOps Engineer at University of California (previously Azusa Pacific University and Claremont McKenna College).  He contributes to a number of open source software projects and Linux distributions and is an Ambassador for the Fedora Project, representing Fedora at SCaLE since 2010.",
    "website": null
  },
  "3867": {
    "name": "Gregory Farnum",
    "title": "CephFS Engineering Manager",
    "organization": "IBM",
    "photo": {
      "alt": null,
      "height": "2743",
      "width": "3938",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/IMG_0301.JPG"
    },
    "biography": "Greg Farnum is a long-standing member of the core Ceph development team and founding Inktank engineer. He has served in many roles as Ceph grows and is currently a member of the Ceph Steering Committee and manager of IBM's CephFS group. Greg is passionate about solving problems in distributed computing and expanding the Ceph community.",
    "website": null
  },
  "4139": {
    "name": "Sarah Novotny",
    "title": "CTO",
    "organization": "GenLab Studio",
    "photo": {
      "alt": null,
      "height": "910",
      "width": "1016",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Screenshot%202025-01-05%20at%2011.14.36.png"
    },
    "biography": "Sarah Novotny has long been an Open Source champion leading in projects such as Kubernetes, OpenTelemetry, NGINX and MySQL.  She has previously led an Open Source Ecosystem team from the Microsoft Azure Office of the CTO, an Open Source Strategy group at Google and represented both Microsoft and Google on the Linux Foundation Board of Directors. In the distant past, she ran large scale technology infrastructures before web-scale had a name. Sarah’s 20+ years of expertise extends beyond technical realms to encompass developer relations, marketing, sales engineering, and more. She has a proven track record of leading technical operations and development teams while effectively bridging the gap between customer requirements and technical vision.",
    "website": null
  },
  "4150": {
    "name": "Patrick Shuff",
    "title": "Production Engineer",
    "organization": "Facebook",
    "photo": null,
    "biography": "Not yet available.",
    "website": {
      "name": "http://patrickshuff.com",
      "url": "http://patrickshuff.com"
    }
  },
  "4198": {
    "name": "Ben Rockwood",
    "title": "VP, Engineering & Operations",
    "organization": "Mondoo",
    "photo": {
      "alt": null,
      "height": "1248",
      "width": "1872",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/IMG_0773.JPG"
    },
    "biography": "Ben Rockwood is the VP of Engineering & Operations at Mondoo",
    "website": {
      "name": "Cuddletech",
      "url": "http://cuddletech.com"
    }
  },
  "4286": {
    "name": "Daniel Walsh",
    "title": "Consulting Engineer",
    "organization": "Red Hat",
    "photo": {
      "alt": null,
      "height": "512",
      "width": "512",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/dwalsh-ireland.jpg"
    },
    "biography": "Daniel Walsh has worked in the computer security field for over 35 years. Dan is a Consulting Engineer at Red Hat. He joined Red Hat in August 2001. Dan leads the Red Hat Container Engineering team since August 2013, but has been working on container technology for several years. Dan currently focusess on the CRI-O Container Runtime, Buildah for building container images, containers/storage and containers/image. Dan has made many contributions to the Docker project. Dan has also developed a lot of the software on Project Atomic. He has led the SELinux project, concentrating on the application space and policy development. Dan helped developed sVirt, Secure Virtualization as well as the SELinux Sandbox back in RHEL6 an early desktop container tool. Previously, Dan worked Netect/Bindview's on Vulnerability Assessment Products and at Digital Equipment Corporation working on the Athena Project, AltaVista Firewall/Tunnel (VPN) Products. Dan has a BA in Mathematics from the College of the Ho",
    "website": {
      "name": "Senior Distinquished Software Engineer",
      "url": "http://danwalsh.livejournal.com"
    }
  },
  "4302": {
    "name": "Nathan Haines",
    "title": "Community Council Member",
    "organization": "Ubuntu",
    "photo": {
      "alt": null,
      "height": "1920",
      "width": "1920",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/P1388706_glasses_fix-square-scale.jpg"
    },
    "biography": "Nathan Haines is an author, instructor, and computer consultant who fell in love with Ubuntu in 2005, and helped found the Ubuntu California Local Community Team to share that excitement with others. As the leader of the California team and a member of the Ubuntu Local Community Council, he works to help others support and share Ubuntu worldwide. His mission to educate and excite people about Free Software and Ubuntu continues with his book, Beginning Ubuntu for Windows and Mac Users.",
    "website": {
      "name": "nhaines.com",
      "url": "https://www.nhaines.com/"
    }
  },
  "5100": {
    "name": "maddog Hall",
    "title": "Board Chair Emeritus",
    "organization": "Linux Professional Institute",
    "photo": {
      "alt": null,
      "height": "475",
      "width": "700",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/535788_10150859226682025_1722401621_n.jpg"
    },
    "biography": "Jon \"maddog\" Hall is the Board Chair Emeritus of the Linux Professional Institute (lpi.org). During his career in commercial computing which started in 1969, Mr. Hall has been a programmer, systems designer, systems administrator, product manager, technical marketing manager, author and educator. He has worked for such companies as Western Electric Corporation, Aetna Life and Casualty, Bell Laboratories, Digital Equipment Corporation, VA Linux Systems, SGI and Linaro. He currently works as an independent consultant, and is currently involved with bringing environmentally friendly computing to emerging marketplaces through Project Cauã.",
    "website": {
      "name": "Linux Professional Institute",
      "url": "http://lpi.org"
    }
  },
  "5109": {
    "name": "David vonThenen",
    "title": "AI/ML Engineer",
    "organization": "DigitalOcean",
    "photo": {
      "alt": null,
      "height": "599",
      "width": "660",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/head-shot-small.png"
    },
    "biography": "David is an AI/ML Engineer at DigitalOcean, where he’s dedicated to empowering developers to build, scale, and deploy AI/ML models in production environments. David brings deep expertise in building and training models for applications like NLP, data visualization, and real-time analytics.  His mission is to help users build, train, and deploy AI models efficiently, making advanced machine learning accessible to developers of all levels. I also have a background in storage drivers/firmware/management, backup and recovery solutions for virtualized environments, I'm a contributor to Kubernetes and many Cloud Native Computing Foundation (CNCF) projects, and backup/recovery solutions, etc! Please reach out and ask me anything! \n    Open Source Contributions: \nFollow me on Twitter: \nLinkedIn: \nBlog: \n \n \n \n \n \n \n \n \n \n \n http://www.github.com/davidvonthenen http://www.twitter.com/dvavidonthenen https://linkedin.com/in/davidvonthenen https://davidvonthenen.com",
    "website": {
      "name": "LinkedIn",
      "url": "https://www.linkedin.com/in/davidvonthenen/"
    }
  },
  "5140": {
    "name": "Josh Berkus",
    "title": "Kubernetes Community",
    "organization": "Red Hat Inc.",
    "photo": {
      "alt": null,
      "height": "480",
      "width": "505",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/headshot_new_small_0.jpg"
    },
    "biography": "Josh Berkus spends his time messing around with containers, automation, and community-building for Red Hat Inc.  Prior to that, he spent nearly two decades working on PostgreSQL.  From his home in Portland, he cooks, makes pottery, and looks after a cat.",
    "website": {
      "name": "Kubernetes",
      "url": "https://kubernetes.io"
    }
  },
  "5167": {
    "name": "Magnus Hagander",
    "title": null,
    "organization": "Redpill Linpro",
    "photo": {
      "alt": null,
      "height": "767",
      "width": "588",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/IMG-20250119-WA0000~2.jpg"
    },
    "biography": "Magnus Hagander is a member of the PostgreSQL Core Team and a developer and code committer in the PostgreSQL Global Development Group. Magnus is one of the original developers of the Windows port of PostgreSQL. These days, he mostly works on other parts of the PostgreSQL backend, recently with a focus on security features, monitoring and backup/replication interfaces and tools. He is also one of the core members of the postgresql.org infrastructure team, maintaining the servers that power the project, and one of the maintainers of the postgresql.org website. He's been a PostgreSQL user since version 6 (with some non-serious use of Postgres 95 before that), and currently serves on the Core Team and as President of the Board for PostgreSQL Europe. To pay the bills, he is a PostgreSQL and open source software consultant at Redpill Linpro in Stockholm, Sweden, where he works on consulting, support and training service.",
    "website": {
      "name": "https://blog.hagander.net/",
      "url": "https://blog.hagander.net/"
    }
  },
  "5189": {
    "name": "Alexander Krizhanovsky",
    "title": "CEO",
    "organization": "Tempesta Technologies Inc",
    "photo": {
      "alt": null,
      "height": "1020",
      "width": "1107",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/avatar18.jpg"
    },
    "biography": "Alexander is the CEO of Tempesta Technologies, Inc., and is the architect of Tempesta FW, a high performance open source Linux application delivery controller. Alexander is responsible for the design and performance of several products in the areas of network traffic processing and databases. He designed the core architecture of a Web application firewall, mentioned in the Gartner Magic Quadrant, and MariaDB system versioning.",
    "website": {
      "name": "Tempesta FW, Tempesta Technologies Inc",
      "url": "https://tempesta-tech.com/"
    }
  },
  "5232": {
    "name": "Nina Kin",
    "title": "Tech Lead",
    "organization": "LA Metro",
    "photo": {
      "alt": null,
      "height": "682",
      "width": "683",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/headshot_17.jpg"
    },
    "biography": "Nina Kin is the Technical Lead for LA Metro’s Digital Services Team. With over 15 years in local government and a background in software engineering, she is determined to make government work better for the public. Outside of Metro, Nina serves as a Board Member for MobilityData and is on the organizing team for several government/tech/data events, such as Data + Donuts LA, MaptimeLA, the LA Arts Datathon, and the International Humanitarian Mapathon. When she’s not in front of a computer, you’ll find Nina exploring neighborhoods by foot, bike, or public transit. She also enjoys learning new crafting skills, playing the violin, and practicing taiko drumming with the JTown Taiko Club. A proud alumna of UC Berkeley, Nina holds a B.S. in Electrical Engineering and Computer Science.",
    "website": null
  },
  "5455": {
    "name": "Alexander Rubin",
    "title": "Principal Security Engineer",
    "organization": "Amazon Web Services",
    "photo": {
      "alt": null,
      "height": "265",
      "width": "265",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/alexander_rubin.png"
    },
    "biography": "Alexander is a Principal Security Engineer at Amazon Web Services (AWS), leading RDS security team. Alexander worked with MySQL since 2000 as DBA and Application Developer. Alexander was working as MySQL principal consultant/architect for over 15 years, started with MySQL AB in 2006 (company behind MySQL database), Sun Microsystems, Oracle and then Percona. He helped many customers design large, scalable and highly available MySQL systems, optimize MySQL performance and improve MySQL security.",
    "website": null
  },
  "5508": {
    "name": "Mica Semrick",
    "title": null,
    "organization": null,
    "photo": null,
    "biography": "Editor, DITA architect, photographer, and all-around nerd.",
    "website": {
      "name": "silentumbrella.com",
      "url": "http://silentumbrella.com"
    }
  },
  "5583": {
    "name": "Tom Lechner",
    "title": "Artist",
    "organization": null,
    "photo": {
      "alt": null,
      "height": "1000",
      "width": "1000",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/tom-by-patrick-david-1000x1000.jpg"
    },
    "biography": "Tom is an artist who has been using and making various open source tools to help produce his artwork for almost 20 years. For instance, he created desktop publishing software called Laidout to produce his comic books, and is now exploring the many aspects of video game production. He is based in Portland, Oregon, USA.",
    "website": {
      "name": "Tom's Art",
      "url": "http://tomlechner.com"
    }
  },
  "5611": {
    "name": "Mandi Walls",
    "title": "Technical Community Manager",
    "organization": "Chef Software",
    "photo": {
      "alt": null,
      "height": "328",
      "width": "300",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/mandi_m.png"
    },
    "biography": "Mandi Walls is Technical Community Manager at Chef. For Chef, she helps organizations increase their effectiveness using configuration management and modernizing IT practices. She is a long-time sysadmin focusing on large complex web systems.",
    "website": {
      "name": "Chef Software",
      "url": "https://chef.io"
    }
  },
  "5644": {
    "name": "Tyler Menezes",
    "title": "Executive Director",
    "organization": "CodeDay",
    "photo": {
      "alt": null,
      "height": "1000",
      "width": "1000",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/press_1_sq.jpg"
    },
    "biography": "Tyler Menezes is the Executive Director at CodeDay, where he works to increase diverse Computer Science enrollment across North America by inspiring underrepresented students to give coding a try. Born in Canada but raised in the Pacific Northwest, he briefly attended the University of Washington before dropping out to start a Y Combinator and venture-backed social video startup in 2011. This, combined with stints working in machine learning at Microsoft Research and as a programmer at several Seattle startups, led to his work finding data-driven solutions to increasing CS diversity and enrollment since 2014.",
    "website": {
      "name": "Website",
      "url": "https://www.codeday.org/"
    }
  },
  "5651": {
    "name": "Dave McAllister",
    "title": "OSS Technologist",
    "organization": "NGINX part of F5",
    "photo": {
      "alt": null,
      "height": "1024",
      "width": "1024",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/015-03h14ZHX4Qg.jpeg"
    },
    "biography": "At NGINX, Dave works with DevOps, developers and architects to realize the advantages of modern microservice architectures and orchestration in distributed systems, especially for today's fast-moving cycles. \n    Dave has been a champion for open systems and open source from the early days of Linux to today's world of clouds and containers. He speaks on topics such as the real-world issues associated with emerging software architectures and practices.  He covers topics such as observability,  concepts associated with software architectures and practices, open-source software and creating new technology. A self-described open source geek and standards wonk, you can find his opinions on twitter @dwmcallister and \n \n https://medium.com/@dwmcallister",
    "website": {
      "name": "Sr. Open Source Technologist",
      "url": "https://www.nginx.com"
    }
  },
  "5858": {
    "name": "Murriel Perez McCabe",
    "title": "DevOps and Platform Engineering",
    "organization": null,
    "photo": {
      "alt": null,
      "height": "2254",
      "width": "2000",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Murriel-Headshot-Public.jpg"
    },
    "biography": "Murriel is a Customer Engineer with Google Cloud, and works with enterprise customers to solve technical and business challenges and build applications on the cloud. She is currently enthusiastic about DevOps and Platform Engineering, Kubernetes, and the Developer Experience. She leads the Social Impact committee for the local chapter of  and is an advocate for mentorship and community building. Murriel also holds a position on the executive committee for Surfrider Long Beach. When outdoors, she can often be spotted on a bike or on skates, by the coastline, in the garden, or covered in sawdust.\n \n Women@Google",
    "website": {
      "name": "Website",
      "url": "https://www.murrielgrace.com"
    }
  },
  "5896": {
    "name": "Jeremy Meiss",
    "title": "Director, Developer Relations",
    "organization": "OneStream Software",
    "photo": {
      "alt": null,
      "height": "1000",
      "width": "1000",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/unstylized-jerdog-squared.png"
    },
    "biography": "Jeremy is a seasoned DevRel & DevEx leader, an international speaker, and is currently the Director of DevRel at OneStream Software, previously at CircleCI, Solace, Auth0, and XDA. With almost 30 years in Tech, covering just about every functional area, including support, system and database administration, application and web development, project management, program management, and systems analysis, Jeremy is active in the DevRel and DevOps communities, a co-creator of DevOpsPartyGames.com, and organizer for DevOpsDays Kansas City. A lover of all things coffee, community, open source, and tech, he is also house-broken, and (generally) plays well with others.",
    "website": {
      "name": "Website",
      "url": "https://jmeiss.me"
    }
  },
  "5954": {
    "name": "Sam Hanna",
    "title": "Medical Technician",
    "organization": "Abbott Labs",
    "photo": {
      "alt": null,
      "height": "960",
      "width": "540",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/20170605_133411.jpg"
    },
    "biography": "Sam Hanna is a medical technician at Abbott Labs for the past 7 years. He has been a Linux user for over 15 years. He is self-taught individual who has been inspired many people in the linux community and loves working with many Linux distributions, server applications, and tools. He is an advocate of opensource software and self-hosting. His goal is to reach out and spread his knowledge to others and hope to inspire others just as the opensource community has done for him.",
    "website": null
  },
  "5971": {
    "name": "Georg Link",
    "title": "Open Source Strategist and Director of Sales",
    "organization": "Bitergia",
    "photo": {
      "alt": null,
      "height": "533",
      "width": "533",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/georglink.png"
    },
    "biography": "Georg’s mission is to make open source more professional by using community metrics and analytics. Georg cofounded the CHAOSS Project to advance analytics and metrics for open source project health. Georg is an active contributor to several projects and often presents on open source topics. Georg has an MBA and a Ph.D. in Information Technology. As the Open Source Strategist and Director of Sales at Bitergia, Georg helps organizations and communities adopt metrics and make open source more sustainable.",
    "website": {
      "name": "Georg's Homepage",
      "url": "https://georg.link"
    }
  },
  "6031": {
    "name": "Heather Osborn",
    "title": "Engineering Manager, Developer Enablement",
    "organization": "Zapier",
    "photo": {
      "alt": null,
      "height": "3600",
      "width": "2400",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/JS9_3215.jpg"
    },
    "biography": "Heather Osborn, Engineering Manager, Developer Enablement, Zapier Heather Osborn has been working in technology as a system and operations engineer and manager for the last 25 years, moving from physical to cloud infrastructure.  Heather is an avid long distance runner who has lots of time to think about these things while pounding the pavement.",
    "website": {
      "name": "https://twitter.com/brokenheather",
      "url": "https://twitter.com/brokenheather"
    }
  },
  "6036": {
    "name": "Jon Cruz",
    "title": "Chief Agitator",
    "organization": "Inkscape",
    "photo": {
      "alt": null,
      "height": "256",
      "width": "256",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Cruz_Jon_sm.jpg"
    },
    "biography": "Jon A. Cruz is a professional developer with over 20 years of experience, working extensively in multimedia, including programming and 3D art creation, and has developed for a wide variety of platforms. Work includes R&D for mobile and other devices, servers for large mail and messaging systems, enterprise security applications, and user interface design and development.. He had participated as a mentor in Google's Summer of Code since its first year with Inkscape and recently also for OpenICC. He has presented at many conferences including Linux.conf.au, the Libre Graphics Meetings, OSCON and others including the SCALE where he also a common presence in the expo hall helping to represent Inkscape and other Libre Graphics efforts..",
    "website": null
  },
  "6248": {
    "name": "Ana Margarita Medina",
    "title": "Staff Developer Advocate ",
    "organization": "Upbound",
    "photo": {
      "alt": null,
      "height": "2400",
      "width": "1714",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/A44F8724-0996-4B4A-856A-D92A7ED016C7.jpeg"
    },
    "biography": "Ana Margarita Medina is a Staff Developer Advocate at Upbound, she speaks on all things SRE, DevOps, Platform Engineering and Reliability. She is a self-taught engineer with over 14 years of experience, focusing on cloud infrastructure and reliability. She has been part of the Kubernetes Release Team since v1.25, serves on the Kubernetes Code of Conduct Committee, and is on the GC for CNCF's Keptn project, When time permits, she leads efforts to dispel the stigma surrounding mental health and bring more Black and Latinx folks into tech.",
    "website": {
      "name": "Ana",
      "url": "http://anammedina.com/"
    }
  },
  "9659": {
    "name": "Kevin Mittman",
    "title": "Senior Systems Software Engineer",
    "organization": "NVIDIA",
    "photo": {
      "alt": null,
      "height": "500",
      "width": "500",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/headshot_23.jpg"
    },
    "biography": "Kevin Mittman is a GNU/Linux enthusiast with a passion for automation. He is a system software engineer at NVIDIA, with a focus on the installer packaging and release process for CUDA, the NVIDIA driver, and other CUDA-X products. Before joining NVIDIA, Kevin began his career in the open source community, maintaining Debian packages for Maemo and later an ArchLinux-based kiosk Linux LiveUSB distro.",
    "website": {
      "name": "About me",
      "url": "http://hirekevin.xyz"
    }
  },
  "9686": {
    "name": "Mark Wong",
    "title": "Major Contributor",
    "organization": "PostgreSQL",
    "photo": {
      "alt": null,
      "height": "866",
      "width": "866",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/mark-sq_1.png"
    },
    "biography": "Mark Wong is a Software Development Engineer at EDB and is a PostgreSQL Major Contributor. He first introduced himself to the PostgreSQL community in 2003 with open source benchmarking kits and performance data. Since then, he has continued to contribute to various aspects of the community such as a Google Summer of Code mentor, Conference Organizer, Portland PostgreSQL Users Group Co-Organizer, PostgreSQL Fundraising Group Member, and a Director on the Board of the United States PostgreSQL.",
    "website": null
  },
  "10056": {
    "name": "Atom Ramirez",
    "title": "College Student",
    "organization": "UC Merced",
    "photo": {
      "alt": null,
      "height": "2001",
      "width": "1250",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/IMG_1470.jpeg"
    },
    "biography": "Atom is a student at UC Merced pursuing a degree in Applied Mathematics with an emphasis on Computer Science. He is currently the president of UC Merced ACM chapter.  He’s  interested in cyber security, Linux, programming, and Basketball. He has given talks about PKI, Linux security, Linux installs as the ACM Cybersecurity SIG lead.",
    "website": null
  },
  "10109": {
    "name": "Anita Zhang",
    "title": "Software Engineering Manager",
    "organization": "Meta",
    "photo": {
      "alt": null,
      "height": "800",
      "width": "800",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/headshot2022_800.png"
    },
    "biography": "Anita Zhang is the software engineering manager of Meta's Linux Userspace team. Her team connects Meta's infrastructure with the open source community. She is active on the systemd project and continues to support systemd at Meta as part of their userspace efforts.",
    "website": null
  },
  "10125": {
    "name": "Kyle Quest",
    "title": "Founder",
    "organization": "AutonomousLayer",
    "photo": {
      "alt": null,
      "height": "400",
      "width": "400",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/kcq_conf_image_0.jpeg"
    },
    "biography": "Kyle is the creator of DockerSlim (aka MinToolkit/SlimToolkit), a popular tool to minify, inspect, build, run and debug containers. He's the founder/CEO of AutonomousLayer (aka AutonomousPlane) and he's also the founder/CTO of Slim.AI. He's building an AI agent to automatically fix vulnerabilities in the cloud native applications. Kyle has been building applications and platforms using many different programming languages since the early days of cloud computing. His \"50 Shades of Go\" is still one of the popular guides for Go gotchas for many new developers learning the language. Kyle been involved in security for more than two decades wearing many different hats as a builder, breaker and defender.",
    "website": {
      "name": "LinkTree",
      "url": "https://linktr.ee/kcqon"
    }
  },
  "10276": {
    "name": "Carl George",
    "title": null,
    "organization": null,
    "photo": {
      "alt": null,
      "height": "300",
      "width": "300",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/carl-2023-square.jpg"
    },
    "biography": "Carl George leads the Extra Packages for Enterprise Linux (EPEL) team in the Community Linux Engineering group at Red Hat.  He participates in many open source projects, often related to his packaging activities in Fedora, EPEL, and CentOS.  He is a member of the EPEL Steering Committee, the Fedora Packaging Committee, and various Fedora Special Interest Groups.",
    "website": null
  },
  "10391": {
    "name": "Fatima Khalid",
    "title": "Developer Evangelist",
    "organization": "GitLab",
    "photo": {
      "alt": null,
      "height": "400",
      "width": "400",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Fatima--headshot-SM.jpeg"
    },
    "biography": "Fatima is an adventurous software engineer & open source contributor. She's passionate about civic tech and committed to building more inclusive tech communities. She loves coding challenges, storytelling, and simplifying technical concepts. As a Developer Evangelist at Gitlab, she connects with other developers and shares knowledge and experiences at conferences and meetups. Better known on the internets as the “effervescent sugaroverflow”, she has been a volunteer for the DrupalCon Program team, a core contribution mentoring lead, and leader of the Drupal Diversity & Inclusion working group, and a curator for the Civic Tech Guide. In 2018, she received the Women in Communications & Technology (WCT) Rising Star leadership award for her efforts in teaching and advocacy. When she's not playing board games with friends or catching pokemon in the east bay, you can find Fatima reading by the ocean.",
    "website": null
  },
  "10416": {
    "name": "Allan Mason",
    "title": "Systems and Data Engineering Consultant",
    "organization": null,
    "photo": {
      "alt": null,
      "height": "710",
      "width": "710",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/allan_mason.jpeg"
    },
    "biography": "I've been technically leading, mentoring, and managing a team, helping companies and people with current and future needs, starting from SW engineering to everything database, currently focused around MySQL.  I work for Pythian doing what I love, in a challenging environment.  I'm passionate about leadership, mentoring, and data.",
    "website": null
  },
  "10573": {
    "name": "Bronwen Aker",
    "title": "aka Corvus",
    "organization": null,
    "photo": {
      "alt": null,
      "height": "908",
      "width": "908",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/BKA-headshot-sq-20181115.jpg"
    },
    "biography": "Bronwen Aker (M.S. Cybersecurity, GSEC, GCIH, GCFE) likes to describe herself as a “constantly evolving geek.” She has worked with computers since the dark ages when she was introduced to FORTRAN and bubble cards. These days, Bronwen works for Black Hills Information Security (BHIS) as a member of the Continuous Pen Testing team (AntiSOC), an AI researcher, and technical editor. When not working, she spends time playing with her dogs, LLMs, and studying data science.",
    "website": {
      "name": "Br0nw3n's World",
      "url": "https://br0nw3n.com/"
    }
  },
  "10623": {
    "name": "Hamid Akhtar",
    "title": "Principal Software Engineer",
    "organization": "pgEdge",
    "photo": {
      "alt": null,
      "height": "1858",
      "width": "1571",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/IMG_3762_1.jpg"
    },
    "biography": "Hamid worked extensively on PostgreSQL for more than 12+ years now. As an architect and developer, he's working on multi-active solution with pgEdge, In the past, he's also worked on transparent data encryption, the observability extension (pg_stat_monitor), ORC FDW, and an auto-tuner for PostgreSQL. He has also managed the official PostgreSQL installers. \n At pgEdge, Hamid contributes to developing the Spock extension, enabling active-active logical replication for PostgreSQL. Spock is a significant step towards providing conflict-free replicated data and exception logging.",
    "website": {
      "name": "https://www.pgedge.com/",
      "url": "https://www.pgedge.com/"
    }
  },
  "10628": {
    "name": "Kerim Satirli",
    "title": "Sr. Developer Advocate",
    "organization": "HashiCorp",
    "photo": {
      "alt": null,
      "height": "1000",
      "width": "1000",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/ksatirli-1000x1000.jpg"
    },
    "biography": "Kerim is a senior developer advocate at HashiCorp, where he coaches operators and developers on sustainable infrastructure and orchestration workflows. Before he joined HashiCorp, Kerim worked on Industrial IoT for the Amsterdam airport and helped museums bring more of their collections online. When Kerim isn't working, he's either spending time with his daughter, enjoying aerial photography, or baking a cake.",
    "website": null
  },
  "10630": {
    "name": "Scott Stroz",
    "title": "MySQL Developer Advocate",
    "organization": "Oracle",
    "photo": {
      "alt": null,
      "height": "500",
      "width": "500",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/me_7.jpg"
    },
    "biography": "Scott is a developer with over 20 years of experience in various languages. During that time, the only constant in his development stack has been MySQL. He has a passion for sharing what he has learned on his coding journey so others may learn from his mistakes.",
    "website": {
      "name": "Scott Stroz",
      "url": "https://scottstroz.com"
    }
  },
  "10632": {
    "name": "Jimmy Zelinskie",
    "title": "Cofounder",
    "organization": "authzed",
    "photo": {
      "alt": null,
      "height": "500",
      "width": "487",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/1c6b219b7900d6aa4f7f562bc26ae6eb0335725a.jpg"
    },
    "biography": "Jimmy Zelinskie is a software engineer and product leader with the goal of empowering the world through the democratization of software through open source development. He's currently the CPO and cofounder of authzed where he's focused on bringing hyperscaler best-practices in authorization software to the industry at large. At CoreOS, he helped pioneer the cloud-native ecosystem by starting and contributing to many of its foundational open source projects. After being acquired by Red Hat, his focus shifted to the enablement and adoption of cloud-native technologies by mature enterprise stakeholders. To this day, he still contributes to cloud-native ecosystem by building the future on top of these technologies and maintaining standards such as Open Container Initiative (OCI).",
    "website": {
      "name": "Personal Website",
      "url": "https://jzelinskie.com"
    }
  },
  "10659": {
    "name": "Julia Kreger",
    "title": "Senior Principal Software Engineer",
    "organization": "Red Hat",
    "photo": {
      "alt": null,
      "height": "400",
      "width": "400",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Julia-400x400.png"
    },
    "biography": "Julia has seen things, and built things! Sounds ominous right? She started in Networking early in her career, and drifted through building data centers, hardcore systems engineering, and eventually the automation of the data center infrastructure! She is a Senior Principal Software Engineer at Red Hat, and serves on the Board of Directors of the OpenInfra Foundation. When she is not in meetings, she can sometimes be found working on the Ironic Project, which helps facilitate Bare Metal as a Service.",
    "website": null
  },
  "10660": {
    "name": "Jay Faulkner",
    "title": "Open Source Developer, Podcast Host",
    "organization": "G-Research Open Source Software",
    "photo": {
      "alt": null,
      "height": "1285",
      "width": "1285",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/jf-headshot.jpg"
    },
    "biography": "I am Jay Faulkner, an Open Source Developer and Advocate. I believe that through working with others around the world to solve problems we can make the world better. Open source is a great way to do that. \n    I have a long and varied contribution history in and around open source, including:\n- Over a decade contributing to OpenStack, including two terms on the Technical Committee\n- Over a decade as a core reviewer, and three-time PTL, on OpenStack Ironic\n- Gentoo contributor\n- Small contributions throughout the OSS ecosystem; including systemd, fog, and many others.\n- Podcasting about open source with the GR-OSS OUT podcast.",
    "website": {
      "name": "GR-OSS OUT Podcast",
      "url": "https://podcast.gr-oss.io"
    }
  },
  "10670": {
    "name": "Carmen Mason",
    "title": "Director, Systems Engineering",
    "organization": "VitalSource Technologies",
    "photo": {
      "alt": null,
      "height": "3088",
      "width": "2316",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Carmen2_0.jpeg"
    },
    "biography": "I started my career at VitalSource Technologies a decade ago, as a MySQL DBA. I've spoken at numerous database conferences across the US and in Europe, sharing insights on scalable database architectures and performance optimization.\nIn my current role, I lead the systems engineering team while championing initiatives that drive both technical and social impact. I established VitalSource's Cloud FinOps practice to optimize cloud resources and founded the company's Engineering Women group to foster inclusivity in tech. I grew up with a single mom, and watched her put herself through school to improve our lives. This is an experience that fuels my commitment to VitalSource's mission of making educational materials more accessible and affordable.",
    "website": null
  },
  "10766": {
    "name": "Alkin Tezuysal",
    "title": "EVP - Global Services",
    "organization": "ChistaDATA Inc. ",
    "photo": {
      "alt": null,
      "height": "2661",
      "width": "2391",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/studyo%20objektif%20%281Mb%29.jpg"
    },
    "biography": "Alkin Tezuysal is the Director of Services at Altinity Inc. He has extensive experience in open-source relational databases, working in various sectors and large functions. With over three decades of industry experience, he has led global operations teams for MySQL customers and users. He's a known speaker at worldwide open-source database events.\nHis recent achievements extend into open-source communities: He was awarded Most Influential in Database Community 2022 by The Redgate 100. He has co-authored MySQL Cookbook, 4th Edition 2022, by O'Reilly Media, Inc. He was awarded MySQL Rockstar 2023—Oracle (MySQL Community)—Co-authored Database Design and Modeling with PostgreSQL and MySQL 2024 by Packt.",
    "website": {
      "name": "Altinity",
      "url": "http://www.altinity.com"
    }
  },
  "10783": {
    "name": "kat gaines",
    "title": "developer advocate",
    "organization": "pagerduty",
    "photo": {
      "alt": null,
      "height": "625",
      "width": "501",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/crop.jpeg"
    },
    "biography": "Kat Gaines leads developer relations at PagerDuty. She enjoys talking and thinking about incident response, customer support, and automating the creation of a delightful end-user and employee experience. She previously ran Global Customer Support at PagerDuty, and as a result it’s hard to get her to stop talking about the potential career paths for tech support professionals. In her spare time, Kat is a mediocre plant parent and a slightly less mediocre pet parent to two rabbits, Lupin and Ginny.",
    "website": null
  },
  "10800": {
    "name": "Tarus Balog",
    "title": "Open Source Strategist",
    "organization": "Amazon Web Services",
    "photo": {
      "alt": null,
      "height": "1000",
      "width": "1000",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Balog%2C%20Tarus%20-%20headshot%201M_0.png"
    },
    "biography": "Tarus Balog has been involved in managing communications networks professionally since 1988, and unprofessionally since 1978 when he got his first computer - a TRS-80 from Radio Shack. After being kicked out of some of the best colleges in the country, and a short stint in telecom, he founded an open source-focused company and ran it for twenty years. Once that company was sold, he started working at Amazon Web Services with the goal of making AWS the most welcoming place to run open source workloads.",
    "website": {
      "name": "Adventures in Open Source",
      "url": "https://adventuresinoss.com"
    }
  },
  "10822": {
    "name": "Reese Lee",
    "title": "Developer Relations Engineer",
    "organization": "New Relic",
    "photo": null,
    "biography": null,
    "website": null
  },
  "10829": {
    "name": "Daniel Baker",
    "title": "Engineer",
    "organization": "Anduril",
    "photo": {
      "alt": null,
      "height": "400",
      "width": "400",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/IMG_0769_square_400.jpg"
    },
    "biography": "Daniel is engineer and mathematician turned software developer. He is passionate about reproducible build systems.",
    "website": null
  },
  "10877": {
    "name": "Margaret Tucker",
    "title": "Policy Manager ",
    "organization": "GitHub",
    "photo": {
      "alt": null,
      "height": "667",
      "width": "1000",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/gh.jpeg"
    },
    "biography": "Margaret Tucker is a Policy Manager at GitHub working on issues including intermediary liability, copyright, and open source security policy. Margaret is passionate about advocating for developers' interests to policymakers and hearing from developers about what policy issues matter to them. Prior to joining GitHub, Margaret was a Policy Fellow serving the Office of Science and Technology Policy and also worked as a Research Associate for Future Tense, a section of Slate covering the implications of emerging technologies.",
    "website": {
      "name": "GitHub Policy",
      "url": "https://github.com/about/developer-policy/"
    }
  },
  "10882": {
    "name": "Shaun Hopper",
    "title": "Production Engineer",
    "organization": "Meta Platforms, Inc",
    "photo": {
      "alt": null,
      "height": "1080",
      "width": "1080",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/me_24.jpg"
    },
    "biography": "Shaun is a Production Engineer at Meta, where they have been i shaping integrations with the public cloud infrastructure landscape. They specialize in creating intuitive platforms for container creation and Kubernetes management, with a particular focus on building infrastructure-level software to support both generic compute and large-scale Artificial Intelligence HPC training clusters. Shaun's work is dedicated to enhancing accessibility and efficiency for developers, driving innovation, and simplifying cloud computing at Meta.",
    "website": null
  },
  "10892": {
    "name": "Evan Shortiss",
    "title": "Developer Advocate",
    "organization": "Red Hat",
    "photo": {
      "alt": null,
      "height": "400",
      "width": "400",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/aHMkLrOV_400x400.jpeg"
    },
    "biography": "Evan Shortiss is a Developer Advocate at Red Hat, where he helps developers to be successful with cloud-native technologies. He has more than ten years of development experience, with a focus on building web applications and backends using JavaScript ecosystem technologies.",
    "website": null
  },
  "10897": {
    "name": "Leigh Capili",
    "title": "Senior DevRel Engineer",
    "organization": "Flox",
    "photo": {
      "alt": null,
      "height": "612",
      "width": "612",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/profile-pic.png"
    },
    "biography": "Leigh is building Flox and is active with the Kubernetes and Flux projects. \n    He has a background in infrastructure software with a security niche.\nHe authored Flux 2's security model and kubeadm's mTLS implementation and is currently working on Kubernetes authorization with SIG Auth.\n \n \n Leigh and his wife love to snowboard in Colorado and have 3 dogs. \n \n \n \n \n https://flox.dev https://github.com/flox/flox",
    "website": {
      "name": "Github: stealthybox",
      "url": "https://github.com/stealthybox"
    }
  },
  "10900": {
    "name": "Vijay Samuel",
    "title": "Observability Architect",
    "organization": "eBay",
    "photo": {
      "alt": null,
      "height": "1268",
      "width": "1107",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/headshot_14.jpg"
    },
    "biography": "Vijay Samuel works with eBay's observability platform as its architect. During his time at eBay Vijay has transformed eBay's observability platform into a cloud native offering that is primarily built on top of open source technologies. He loves to code in Go and play video games.",
    "website": null
  },
  "10912": {
    "name": "Eduardo Silva",
    "title": "Software Engineer",
    "organization": "Chronosphere",
    "photo": {
      "alt": null,
      "height": "800",
      "width": "800",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/eduardo_profile.jpeg"
    },
    "biography": "Eduardo is an entrepreneur and Software Engineer. He is one of Fluentd project maintainers and creator of Fluent Bit, a lightweight Logs, Metrics, and Traces processor.",
    "website": {
      "name": "Calyptia",
      "url": "https://calyptia.com"
    }
  },
  "10976": {
    "name": "Thomas Bereknyei",
    "title": "Lead Engineer",
    "organization": "Flox",
    "photo": {
      "alt": null,
      "height": "500",
      "width": "483",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/berek-flight-small.jpg"
    },
    "biography": "Life-long engineer. Worked at Google, flew jet planes in the Marine Corps, trained cyberware teams, formed and led teams to perform rapid hardware and software capability development, worked with the Digital Service to bring modern software practices to the DoD and government. Left the service to create a contracting startup bringing AI/ML products to DoD. Throughout have found a consistent set of challenges in the course of development; also found a set of superpowers to address those challenges using Nix. After several iterations of applying the Nix ecosystem in various teams, the difference was stark. This led to the desire to bring this set of superpowers to the rest of the world and make it more adoptable; hence the involvement in the Nix community as a maintainer, founding Flox, and leading efforts to improve user experience and communicate it to the world.",
    "website": null
  },
  "11012": {
    "name": "Devrim Gunduz",
    "title": "Postgres Expert",
    "organization": "EDB",
    "photo": {
      "alt": null,
      "height": "123",
      "width": "128",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/devrim-avatar-014-small-128.123.jpg"
    },
    "biography": "I’started using Linux in 1996, and PostgreSQL in 1998. Love to travel, listen to music, and enjoy life with friends. Joined PostgreSQL community around 1999. Currently maintaining PostgreSQL official RPM repository at  and  . Contributed to many PostgreSQL related projects. Already a Fedora and EPEL contributor as well.\n \n \n https://yum.postgresql.org https://zypp.postgresql.org Working at EDB as Postgres Expert.",
    "website": null
  },
  "11245": {
    "name": "Vincent Sloan",
    "title": "Distinguished Software Engineer",
    "organization": "GoFundMe",
    "photo": {
      "alt": null,
      "height": "1121",
      "width": "1065",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/profilephoto.jpg"
    },
    "biography": "Vincent is a Software Engineer based in Long Beach, CA, with over 20 years of experience specializing in e-commerce and crowdfunding. He has a proven track record of building secure, scalable systems and leading high-performing teams.",
    "website": {
      "name": "LinkedIn",
      "url": "https://www.linkedin.com/in/vincentsloan/"
    }
  },
  "11269": {
    "name": "Jimmy Angelakos",
    "title": "Systems and Database Architect",
    "organization": null,
    "photo": {
      "alt": null,
      "height": "2999",
      "width": "2998",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/DSC03003-01-flip.jpeg"
    },
    "biography": "Jimmy Angelakos is a Systems and Database Architect and recognized PostgreSQL expert who has worked with, and contributed to, Open-Source tools for 25+ years. He is passionate about participating in the community, is a Contributor to the PostgreSQL project, and an active member of PostgreSQL Europe. Jimmy is a regular speaker at conferences and events, sharing his insights with the community. Author of , co-author of .\n \n \n PostgreSQL Mistakes and How to Avoid Them PostgreSQL 16 Administration Cookbook \n    Mastodon:  Bluesky: \n \n \n \n \n https://fosstodon.org/@vyruss https://bsky.app/profile/vyruss.org",
    "website": {
      "name": "vyruss.org",
      "url": "https://vyruss.org/computing"
    }
  },
  "11310": {
    "name": "Reza Rassool",
    "title": "Chair",
    "organization": "Kwaai",
    "photo": {
      "alt": null,
      "height": "506",
      "width": "508",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Reza.png"
    },
    "biography": "Reza Rassool is the Founder of Kwaai.ai, driving AI democratization through a Personal AI Operating System. Formerly CTO at RealNetworks, he led their pivot to AI leadership. With a track record of >$1Bn exits, Reza is an award-winning innovator with 27 US patents. His extensive expertise spans computer vision, edge AI, and founding roles at Zya and Widevine Technologies (acquired by Google), and contributions to the development of Lightworks NLE, a Technical OSCAR/EMMY-winning product.",
    "website": {
      "name": "Kwaai.ai",
      "url": "https://www.kwaai.ai/"
    }
  },
  "11315": {
    "name": "Christian Hernandez",
    "title": null,
    "organization": null,
    "photo": {
      "alt": null,
      "height": "3000",
      "width": "3000",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/ChristianHernandez_border.png"
    },
    "biography": "Christian is a well rounded technologist with experience in infrastructure engineering, systems administration, enterprise architecture, tech support, advocacy, and product management. Passionate about OpenSource and containerizing the world one application at a time. He is currently a maintainer of the OpenGitOps project, a member of the Argo Project Marketing SIG, and co-host of GitOps Guide to the Galaxy. He focuses on GitOps practices, DevOps, Kubernetes, and Containers.",
    "website": {
      "name": "Personal Website",
      "url": "https://chernand.io"
    }
  },
  "11316": {
    "name": "Murat Aydemir",
    "title": "Security Delivery Associate Manager",
    "organization": "Accenture",
    "photo": {
      "alt": null,
      "height": "443",
      "width": "443",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/1604839649899_yol9Yi0%20%281%29.jpg"
    },
    "biography": "Murat Aydemir is a cloud security architect with a strong background in offensive security, specializing in both dynamic and static analysis techniques to identify vulnerabilities. Renowned for discovering over 30 CVEs and identifying zero-day vulnerabilities, he leverages his expertise in both offensive and defensive security to secure AWS environments while continuing his research in offensive techniques targeting cloud infrastructures. He is a big fan of Serverless concept, embracing its potential to drive innovation by eliminating infrastructure management overhead and optimizing scalability for cloud-native security solution architectures. His expertise spans both security in the cloud and security of the cloud, blending application security and cloud-native defense strategies. He leverages AWS-native services to implement robust and scalable security measures that address critical risks and ensure the protection and resilience of the cloud workloads in dynamic environments.",
    "website": {
      "name": "https://github.com/murataydemir",
      "url": "https://github.com/murataydemir"
    }
  },
  "11356": {
    "name": "Farid Zakaria",
    "title": "software engineer, father and wishful surfer",
    "organization": "University of California Santa Cruz",
    "photo": {
      "alt": null,
      "height": "600",
      "width": "600",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/image%20%282%29.png"
    },
    "biography": "PhD Student at the University of California Santa Cruz \n    Software engineer, Ph.D. student, and father.\nI am a NixOS enthusiast, which has led me to rethink basic Linux primitives.",
    "website": {
      "name": "Blog",
      "url": "https://fzakaria.com"
    }
  },
  "11373": {
    "name": "Ildiko Vancsa",
    "title": "Director of Community",
    "organization": "Open Infrastructure Foundation",
    "photo": {
      "alt": null,
      "height": "2744",
      "width": "2008",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Ildiko.Vancsa_Carlin.Ma-1306%20v2.jpg"
    },
    "biography": "Ildikó is working for the Open Infrastructure Foundation as Director of Community. As part of her role, she is the Community Manager for the StarlingX open source distributed cloud project and a co-leader of the OpenInfra Edge Computing Group. Ildikó has been contributing to projects like OpenStack, Anuket and State of the Edge for over 10 years with focus areas of Edge Computing, Telecommunications and NFV. She is an evangelist of open collaboration and is using her experience to help individuals, companies and organizations to learn and get more involved and active in open source communities.",
    "website": null
  },
  "11400": {
    "name": "Henrietta Dombrovskaya",
    "title": "Database Architect",
    "organization": "DRW",
    "photo": {
      "alt": null,
      "height": "4032",
      "width": "3024",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/avatar_prague.jpeg"
    },
    "biography": "Henrietta (Hettie) Dombrovskaya is a database researcher and practitioner with over 40 years of academic and industrial experience. She holds a Ph.D. in Computer Science from the University of Saint Petersburg, Russia. At present she is \n    – Database Architect at DW Holdings in Chicago, IL\n– Local Organizer of the Chicago PostgreSQL User Group\n– Active community member, a frequent speaker at the PostgreSQL Conferences\n– A researcher focused on developing efficient interactions between applications and databases and implementation of temporal data\n– An author of PostgreSQL Query Optimization book",
    "website": {
      "name": "The World of Data",
      "url": "https://hdombrovskaya.wordpress.com/"
    }
  },
  "11423": {
    "name": "Gabriele Bozzola",
    "title": "(Scientific) Software Engineer",
    "organization": "California Institute of Technolgy",
    "photo": {
      "alt": null,
      "height": "484",
      "width": "484",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/avatar_4.jpg"
    },
    "biography": "I am a software engineer dedicated to supporting and accelerating scientific research. I am currently working at CliMA, the Climate Modelling Alliance, where I contribute to the development of a next-generation Earth-System Model. Before joining CliMA, I obtained my PhD in theoretical and computational physics focusing on simulations of black holes. During my PhD, I was a NASA Future Investigator for Space Science and a Texas Advanced Center for Computing Frontera fellow. As part of my PhD, I contributed to the development of open-source software for high-energy astrophysics. I also contributed to packages for GNU Emacs. I am a reviewer for the Journal of Open-Source Software. I am passionate about open-source software in science, research software engineering, and education.",
    "website": {
      "name": "Personal website",
      "url": "http://sbozzolo.github.io"
    }
  },
  "11444": {
    "name": "Jenson Crawford",
    "title": "Vice President, Software Engineering",
    "organization": "Eastman Kodak Company",
    "photo": {
      "alt": null,
      "height": "1491",
      "width": "1494",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/JJC%20Profile%206%20square.jpg"
    },
    "biography": "Jenson Crawford is a software engineering leader and an active volunteer based in Los Angeles. He spent the first half of his career focused on optimizing software and is now focused on optimizing software and volunteer teams. Jenson is currently VP of Software Engineering for Eastman Kodak and is also serving in multiple volunteer roles.",
    "website": null
  },
  "11445": {
    "name": "Shaun McCance",
    "title": "CentOS Community Architect",
    "organization": "Red Hat",
    "photo": {
      "alt": null,
      "height": "512",
      "width": "512",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/mccance.jpg"
    },
    "biography": "Shaun is the CentOS Community Architect at Red Hat. He's an occasional developer and tech writer. He's worked on documentation and documentation systems in a number of open source communities, most notably as part of GNOME for the last two decades.",
    "website": null
  },
  "11505": {
    "name": "Éamon Ryan",
    "title": "Senior Principal Field Engineer",
    "organization": "Grafana Labs",
    "photo": {
      "alt": null,
      "height": "800",
      "width": "800",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/me-li.jpeg"
    },
    "biography": "Éamon is a Senior Principal Field Engineer at Grafana Labs, where he builds and maintains internal and external environments, builds out advanced workshops, provides input on product use-cases and acts as a subject matter expert in some specific areas. Éamon has done the full rounds of customer-facing tech roles over the years: Support, Education/Training, Professional Services, Solutions Engineering and now Field Engineering, giving him tons of customer insights and viewpoints he uses to fuel his work. Éamon has a background in infrastructure, having worked at VMware for ~8 years before migrating to Pivotal and ultimately to Grafana Labs. Originally hailing from Ireland, he has been living in California since 2014.",
    "website": {
      "name": "Grafana",
      "url": "https://grafana.com"
    }
  },
  "11519": {
    "name": "Paul Yu",
    "title": "Developer Advocate",
    "organization": "Microsoft",
    "photo": {
      "alt": null,
      "height": "4000",
      "width": "4000",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/cda-pauyu-square-1mb_0.jpg"
    },
    "biography": "Paul Yu is a Developer Advocate at Microsoft focusing on cloud native technologies and the Kubernetes landscape. Paul has well over a decade of industry experience working as a Software Engineer and Solution Architect. He is passionate about promoting cloud native and sustainable solutions to help organizations optimize processes and workflows.",
    "website": {
      "name": "https://paulyu.dev",
      "url": "https://paulyu.dev"
    }
  },
  "11521": {
    "name": "Maya Singh",
    "title": "Product Manager",
    "organization": "Microsoft",
    "photo": {
      "alt": null,
      "height": "2776",
      "width": "2082",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/MicrosoftTeams-image.png"
    },
    "biography": "Maya is a Product Manager at Microsoft who is passionate about using data to drive product decisions. She has PM experience in Financial Services and Ed-Tech, and is excited to now work on the cloud and open source. Maya holds a Bachelor's degree in Biomedical Engineering and an MBA, both from the University of Virginia. She is a die hard UVA sports fan and loves to try new restaurants and play tennis in her free time.",
    "website": null
  },
  "11528": {
    "name": "Ross Turk",
    "title": "Head of Marketing",
    "organization": "flox",
    "photo": {
      "alt": null,
      "height": "977",
      "width": "964",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/ross.jpg"
    },
    "biography": null,
    "website": null
  },
  "11543": {
    "name": "Tim Quinlan",
    "title": "Sr Technical Marketing Manager",
    "organization": "Coder",
    "photo": {
      "alt": null,
      "height": "1080",
      "width": "1080",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Tim%20Headshot.png"
    },
    "biography": "Tim has been a Linux geek since the 1.x days, he is currently a TMM at Coder. His days are spent working on Coder’s Cloud Development Environment, tinkering with Linux and Kubernetes, and trying to keep developers all around the world In Flow.",
    "website": {
      "name": "Coder.com",
      "url": "https://coder.com"
    }
  },
  "11564": {
    "name": "Katherine Druckman",
    "title": "Open Source Evangelist",
    "organization": "Intel",
    "photo": {
      "alt": null,
      "height": "856",
      "width": "1019",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/KD.jpeg"
    },
    "biography": "Katherine Druckman is an Open Source Evangelist at Intel where she enjoys sharing her passion for a variety of open source topics. She is a long-time open source advocate, developer, and podcaster, and is currently the host of Open at Intel and a co-host of the FLOSS Weekly and Reality 2.0 podcasts. Previously, Katherine spent over a decade as Director of Digital Experience at Linux Journal. A passionate Drupalist since she first downloaded a tarball in 2005, she has also been a Drupal contributor and a Software Engineer.",
    "website": {
      "name": "LinkedIn",
      "url": "https://www.linkedin.com/in/katherinedruckman/"
    }
  },
  "11594": {
    "name": "Quentin Deslandes",
    "title": "Software Engineer",
    "organization": "Meta",
    "photo": {
      "alt": null,
      "height": "1340",
      "width": "1340",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/IMG_0789.jpeg"
    },
    "biography": null,
    "website": {
      "name": "naccy.de",
      "url": "https://naccy.de/"
    }
  },
  "11597": {
    "name": "Adrian Todorov",
    "title": "Solutions Architect ",
    "organization": "HashiCorp ",
    "photo": {
      "alt": null,
      "height": "1365",
      "width": "2048",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Adrian%20Todorov%20%281%20of%202%29%20%282%29.jpg"
    },
    "biography": null,
    "website": {
      "name": "https://atodorov.me",
      "url": "https://atodorov.me"
    }
  },
  "11605": {
    "name": "Tom Bereknyei",
    "title": "Director of Labs",
    "organization": "flox",
    "photo": {
      "alt": null,
      "height": "140",
      "width": "140",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/tom.png"
    },
    "biography": "Life-long engineer. Worked at Google, flew jet planes in the Marine Corps, trained cyber-teams, formed and led teams to perform rapid hardware and software capability development, worked with the Digital Service to bring modern software practices to the DoD and government. Left the service to create a contracting startup bringing AI/ML products to DoD. After several iterations of applying the Nix ecosystem in various teams, the difference was stark. This led to the desire to bring this set of superpower to the rest of the world and make it more adoptable; hence the involvement in the Nix community as a maintainer and leading efforts to improve user experience and communicate it to the world.",
    "website": null
  },
  "11610": {
    "name": "Michael Stahnke",
    "title": "VP Engineering",
    "organization": "flox",
    "photo": {
      "alt": null,
      "height": "1024",
      "width": "1024",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/casual_headshot_jpg.jpg"
    },
    "biography": "Michael Stahnke is a seasoned engineering executive, having spent the last 15 years working in the development and operational tooling space where also did research and was an author on Puppet’s State of DevOps Reports. Michael is VP of Engineering at Flox. He was previously in senior engineering leadership at CircleCI and Puppet where he grew engineering teams by 5x or more. He has spent time building high performing teams, organizations and researching engineering effectiveness in addition to hacking on packaging and release systems.  He’s been speaking at DevOps and Automation events since 2007. He founded the package repository Extra Packages for Enterprise Linux (EPEL) and wrote a book on OpenSSH in 2005.",
    "website": null
  },
  "11612": {
    "name": "Justin Marquis",
    "title": "Technical Support Engineer",
    "organization": "Akuity.io",
    "photo": {
      "alt": null,
      "height": "800",
      "width": "640",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/58bb387d83d0dacbaf1081e0689f982e-large.jpg"
    },
    "biography": "Justin is a technical support engineer at Akuity and Argo CD maintainer. He is passionate about open source and cloud native technologies that leverage productivity. In his spare time you will find him hiking with his family or scuba diving the California Channel Islands.",
    "website": null
  },
  "11620": {
    "name": "Jeremy Adams",
    "title": "Head of Ecosystem",
    "organization": "Dagger",
    "photo": {
      "alt": null,
      "height": "684",
      "width": "684",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/head_square.jpg"
    },
    "biography": "Jeremy has both a technical and a strategic streak. Passionate about people and entrepreneurship, integration and automation. He likes to work on tough, interesting problems that have a high impact (and to have fun while doing it). Jeremy is happiest when he's collaborating, learning, and sharing. DevOps, CI/CD, Platform Engineering, and automation are particular interest areas.",
    "website": null
  },
  "11642": {
    "name": "Nick Meyer",
    "title": "Staff Software Engineer",
    "organization": "Academia.edu",
    "photo": {
      "alt": null,
      "height": "501",
      "width": "470",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/profile_nickmeyer.jpg"
    },
    "biography": "Nick Meyer studied physics and computer science at Caltech, and is currently a Staff Software Engineer on the Platform Engineering team at Academia.edu. A major focus during his tenure at Academia.edu has been streamlining and modernizing the data layer, in particular projects around operations of Academia.edu's PostgreSQL clusters, including upgrades, partitioning, and backup tooling.",
    "website": null
  },
  "11643": {
    "name": "Erik Mondrian",
    "title": null,
    "organization": null,
    "photo": {
      "alt": null,
      "height": "400",
      "width": "400",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/erik-mondrian.png"
    },
    "biography": "Erik Alessandro Mondrian (he/they) is a writer, visual artist, vocalist, musician, filmmaker, scholar, coder, and longtime explorer of virtual worlds. He holds a BA in French, with a minor in Spanish, from the University of Hawaiʻi at Mānoa; an MA in Communication, with a specialization in Mass Communication and Media Studies, from San Diego State University; and an Interschool MFA in VoiceArts & Creative Writing, with a concentration in Integrated Media, from the California Institute of the Arts. He is currently pursuing a Master of Science in  at the University of California, Santa Barbara.\n \n Media Arts and Technology",
    "website": {
      "name": "https://www.youtube.com/erikMondrian",
      "url": "https://www.youtube.com/erikMondrian"
    }
  },
  "11681": {
    "name": "Autumn Nash",
    "title": "Product manager specializing in Linux security",
    "organization": "Microsoft Azure",
    "photo": {
      "alt": null,
      "height": "2123",
      "width": "2222",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/IMG_7911.jpeg"
    },
    "biography": "Autumn is a product manager at Microsoft Azure specializing in Linux security. In her previous role at AWS as a software engineer, she focused on the development and release of Amazon Corretto (Java) while actively engaging in the OpenJDK community; before that, she worked as an AWS NoSQL Solutions Architect and created educational content in Python and Java.\nAutumn co-hosts the exciting new \"Fork Around and Find Out\" podcast, sharing stories on tech lessons learned, with her previous co-host of the popular \"Ship It!\" podcast. A proud mom and \"Rewriting the Code\" alumni, Autumn serves as the Board Chair of Education at MilSpouse Coders, leading the chapter in the Greater Seattle Area, due to her advocacy for collaborative learning and community development.",
    "website": {
      "name": "Linkedin",
      "url": "https://www.linkedin.com/in/autumnnash/"
    }
  },
  "11697": {
    "name": "Kyle Gospodnetich",
    "title": "Maintainer",
    "organization": "Universal Blue",
    "photo": {
      "alt": null,
      "height": "400",
      "width": "400",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/5ea4a9348ac1f212.jpg"
    },
    "biography": "Software, web, and game developer with a passion for Linux and open source.",
    "website": {
      "name": "Resume & Portfolio",
      "url": "https://kylegospodneti.ch"
    }
  },
  "11709": {
    "name": "Erik Wessel",
    "title": "Graduate Researcher",
    "organization": "University of Arizona",
    "photo": {
      "alt": null,
      "height": "993",
      "width": "1000",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/headshot_cropped.jpg"
    },
    "biography": "Erik Wessel is a graduate student and PhD candidate at the Department of Physics at the University of Arizona. He works in the numerical relativity group of Professor Vasileios Paschalidis. He has received NASA's FINESST fellowship to support his work on developing a neutrino-transport code for modeling binary neutron star mergers. Erik is the lead author on two publications investigating the potential for instabilities in massive accretion disks to produce gravitational wave signals detectable by next generation gravitational wave observatories. He received a Bachelor of Engineering Physics from the University of Illinois at Urbana-Champaign, where he also worked on numerical relativity with Dr. Eliu Huerta as part of the LIGO scientific collaboration. Prior to that, Erik worked on multiple software development projects as a student employee and NASA Space Grant Intern at the University of Hawaii at Manoa.",
    "website": null
  },
  "11747": {
    "name": "Fabrizio Sgura",
    "title": "Chief Engineer",
    "organization": "Veritas Automata",
    "photo": {
      "alt": null,
      "height": "375",
      "width": "375",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/linkedin.jpeg"
    },
    "biography": "I am the Chief Engineer at Veritas Automata, currently focusing on distributed systems, Kubernetes, and cloud-native applications. I am an enthusiastic believer in blockchain technologies, supply chain, cold chain, pharma applications, and trust in automation. I actively work on innovation, following the latest technologies and integrations, including AI and controls in automation.\nMy current most involving activity is the development of the Hivenet platform for VA, to provide k-native options to whoever needs to get a ready-to-use toolset to solve the future.",
    "website": {
      "name": "Fabrizio Sgura",
      "url": "https://www.linkedin.com/in/fabrizio-sgura/"
    }
  },
  "11770": {
    "name": "Stephanie Lieggi",
    "title": "Executive Director",
    "organization": "UC Santa Cruz OSPO / Center for Research in Open Source Software",
    "photo": {
      "alt": null,
      "height": "1027",
      "width": "1200",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/steph%20%281%29.jpg"
    },
    "biography": "Stephanie Lieggi is executive director for the Center for Research in Open Source Software (CROSS) and the UC Santa Cruz Open Source Program Office (OSPO). In her current role, she supports the work of academic-based open source projects and enables a sustainable contributor base through the establishment of hands-on mentorship programs. Stephanie promotes the use of open source in academic settings as well as increasing diversity and inclusion in open source ecosystems.",
    "website": {
      "name": "UCSC OSPO",
      "url": "http://ospo.ucsc.edu"
    }
  },
  "11779": {
    "name": "Aaron Prisk",
    "title": "Community Engineer",
    "organization": "Canonical",
    "photo": {
      "alt": null,
      "height": "300",
      "width": "200",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/aprisk-photo.jpg"
    },
    "biography": "Aaron Prisk is a Community Engineer at Canonical who works to support, empower and the grow the global Ubuntu community. Prior to working for Canonical, they spent a decade working in public education IT spearheading various nationally recognized open source initiatives. When they aren't tinkering on some open source project at home, they're probably going on adventures with their kids, brewing beer or reading an old book.",
    "website": null
  },
  "11784": {
    "name": "Ken VanDine",
    "title": "Staff Engineer",
    "organization": "Canonical",
    "photo": {
      "alt": null,
      "height": "1024",
      "width": "1024",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/IMG08060-1024x1024.jpg"
    },
    "biography": "By the late-1990s Ken was building customized Linux distributions for a variety of workloads, from server infrastructure in the data center to globally distributed high-performance computing clusters in the pharmaceutical and financial sectors.  Always having a passion for the Linux desktop, he spent the past 15 years working in engineering and engineering management roles on the Ubuntu Desktop team at Canonical.",
    "website": null
  },
  "11825": {
    "name": "Xe iaso",
    "title": "Chief Executive Officer",
    "organization": "Techaro",
    "photo": {
      "alt": null,
      "height": "905",
      "width": "905",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Xe%20Iaso%20Headshot%20With%20Background%20%281%29.png"
    },
    "biography": "I'm Xe iaso, a technical educator, twitch streamer, vtuber, and philosopher that focuses on ways to help make technology easier to understand and do cursed things in the process. I live in Ottawa with my husband and I do developer relations professionally. I am an avid writer for my blog xeiaso.net, where I have over 500 articles. I regularly experiment with new technologies and find ways to mash them up with old technologies for my own amusement.",
    "website": {
      "name": "Blog",
      "url": "https://xeiaso.net"
    }
  },
  "11843": {
    "name": "Jason Nucciarone",
    "title": "HPC Engineer",
    "organization": "Canonical",
    "photo": {
      "alt": null,
      "height": "519",
      "width": "566",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/new_headshot_0.jpg"
    },
    "biography": "Jason is a young professional in the HPC industry passionate about developing the next generation of lean, mean, open source supercomputing machines. By day, he works at Canonical as their resident HPC engineer making Ubuntu better for supercomputing, and by night he leads the Ubuntu HPC community team as one of its “Not so Ancient Elders.” He is focused on addressing current and future challenges facing the HPC industry such as the convergence of cloud and HPC systems, the impending end of Moore’s Law, and supporting research software engineer workflows. In his free time, he likes to work on several of his open source projects, organizze open source community conferences such as the Ubuntu Summit, and travel to new places to teach others about how great HPC and supercomputing is. Recently he’s started learning the Crystal programming language out of personal interest for its potential applications inside HPC environments. Why Crystal specifically? Well… he loves OOP programming!",
    "website": {
      "name": "Mastodon",
      "url": "https://mast.hpc.social/@nuccitheboss"
    }
  },
  "11856": {
    "name": "Ron Efroni",
    "title": "CEO & Co-Founder",
    "organization": "Flox",
    "photo": {
      "alt": null,
      "height": "768",
      "width": "768",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Ron-web-5V5A2734-768x768.jpg"
    },
    "biography": "A repeat founder, Ron dove into the world of developer tooling at Meta’s Facebook as the head of developer products, building the tools powering Meta’s 20,000-strong developer core. Realizing the limitations of existing tooling and recognizing the superpowers of Nix, Ron co-founded Flox to grow Nix and make it accessible to the wider engineering community. Ron is on the board of the NixOS Foundation where he works on leading key efforts to strengthen and support the entire community. He also leads the largest Israeli tech community in California as president of INTRO, a non-profit.",
    "website": {
      "name": "Flox Website",
      "url": "https://flox.dev/"
    }
  },
  "11887": {
    "name": "Doc Searls",
    "title": null,
    "organization": null,
    "photo": {
      "alt": null,
      "height": "200",
      "width": "200",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Doc.jpeg"
    },
    "biography": "Doc Searls is the former editor-in-chief of Linux Journal, where he was on the masthead for 24 years. During that time he did much to establish open source as a Thing, earning a Google-O'Reilly Open Source prize for Best Communicator in 2005. In 2006 he became a fellow with Harvard's Berkman Klein Center and started ProjectVRM, which is all about increasing personal agency in networked markets, and which informed his 2012 book The Intention Economy: When Customers Take Charge. He also co-authored The Cluetrain Manifesto in 1999, which has been a hot topic ever since. And he sees personal AI as required approach to making many long-held dreams of cyber-utopians such as himself come true.",
    "website": null
  },
  "11888": {
    "name": "Bruce Schneier",
    "title": null,
    "organization": null,
    "photo": {
      "alt": null,
      "height": "467",
      "width": "467",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/bruce.jpeg"
    },
    "biography": "Bruce Schneier is an American cryptographer, computer security professional, privacy specialist, and writer. Schneier is a Lecturer in Public Policy at the Harvard Kennedy School and a Fellow at the Berkman Klein Center for Internet & Society as of November, 2013",
    "website": null
  },
  "11907": {
    "name": "JC Lopez",
    "title": "Storage Advanced Technology Specialist",
    "organization": "IBM",
    "photo": {
      "alt": null,
      "height": "720",
      "width": "720",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/20220718-ProfilePicture-IBM.png"
    },
    "biography": "Jean-Charles \"JC\" Lopez, an Advanced Technology Specialist at IBM, has been in the field of storage for over 30 years. He has dealt with the challenges of each era over different operating systems and in different environments—from OpenStack to OpenShift and from mainframe to open systems. He likes to share his passion for storage while promoting open-source solutions. Since 2019 he's been working full time with Red Hat OpenShift customers and help them build data services platforms around Red Hat OpenShift Data Foundation (now part of the IBM Storage Fusion solution). He has been continuously working with Ceph since 2013 while at Inktank and Red Hat and has authored Ceph courseware and IBM Redbooks.",
    "website": null
  },
  "11918": {
    "name": "Adrianna Frick",
    "title": "Credentialling & Curriculum Lead",
    "organization": "Canonical",
    "photo": {
      "alt": null,
      "height": "948",
      "width": "711",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/day3-close-jpg-lores-01461-EDIT.jpg"
    },
    "biography": "Adrianna Frick has worked on technical skills validation exams and credentials for companies including Canonical and knows what separates good certs from bad. She began her journey in open source in the late 1990s at Walnut Creek CDROM working with teams from Slackware Linux and FreeBSD among others. As someone who has experienced the employment volatility of tech bubbles, and as someone who left and returned to the industry after career changes, educational gaps, and family caregiving, she is dedicated to making new career pathways and opportunities for professional accomplishment that allow anyone from any background to prove their abilities, whether gained in a traditional educational environment, professional experience, or through home lab experiments and self-study.",
    "website": null
  },
  "12376": {
    "name": "Adam Christian",
    "title": "cofounder",
    "organization": "Stateful",
    "photo": {
      "alt": null,
      "height": "922",
      "width": "922",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/adam_avatar.jpg"
    },
    "biography": "I've spent twenty years in the bay area doing tech startups including Sauce Labs, Buoyant and now Stateful. My focus has been primarily at the cross section of devTools, test automation, cloud native and web. In time away from the screen I love spending time with my family, playing in the woods, traveling, and soccer.",
    "website": {
      "name": "runme.dev project",
      "url": "https://runme.dev"
    }
  },
  "12381": {
    "name": "Syed Usman Ahmad",
    "title": "Senior Developer Advocate",
    "organization": "Grafana Labs",
    "photo": {
      "alt": null,
      "height": "2944",
      "width": "2208",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/20240406_124013.jpg"
    },
    "biography": "Usman is a Senior Developer Advocate at Grafana Labs from Nuremberg, Germany. He works with the Open Source community on the community forum, GitHub and Slack. He has over 15 years of experience in IT and in Cloud Support where he served multiple customers all over Europe, US, Japan, etc. He is an active international public speaker participating in multiple conferences and events. In his free time, Usman likes to spend time with his family, go out on occasional traveling and play games or read comics.",
    "website": {
      "name": "My Profile + Portfolio",
      "url": "https://github.com/usmangt"
    }
  },
  "12396": {
    "name": "Alex Kretzschmar",
    "title": "Head of DevRel",
    "organization": "Tailscale",
    "photo": {
      "alt": null,
      "height": "400",
      "width": "400",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/alex-kretzschmar.jpg"
    },
    "biography": "Podcaster. Tailscalar. Linuxserver.io co-founder. Drone Racer. Photographer. Dog Lover. UK raised but now living Raleigh, NC, USA, Alex is a container evangelist and tinkerer by nature. \n    He a host of the Self-Hosted podcast () and Head of Developer Relations at Tailscale. He is also the author of  and is passionate about helping others get into self-hosting and doing so as easily as possible.\n \n \n https://selfhosted.show https://perfectmediaserver.com",
    "website": null
  },
  "12399": {
    "name": "Shirley Wang",
    "title": "Software Engineer",
    "organization": "Grafana Labs",
    "photo": {
      "alt": null,
      "height": "1294",
      "width": "1192",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/5aae-0o0o0-nhs3fmxZiYgH8N8x6nrv11.png"
    },
    "biography": "Shirley is a software engineer at Grafana Labs working on solutions to facilitate observability. She is passionate about test code, pair programming and believes in facilitating communication through listening, empathizing and clear and understandable explanations. Outside of work, she enjoys bike riding, knitting, and baking.",
    "website": null
  },
  "12401": {
    "name": "Thomas Charlon",
    "title": "Research associate postdoc",
    "organization": "Harvard Medical School",
    "photo": {
      "alt": null,
      "height": "800",
      "width": "800",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/thomas_charlon.jpeg"
    },
    "biography": "Thomas Charlon is a research associate postdoc at Harvard Medical School. He completed his computer science PhD at the University of Geneva (2019) while being employed as a Bioinformatician at Quartz Bio (Merck Serono spin-off) to develop algorithms for clustering and sparse coding of genome-wide data in systemic autoimmune diseases. He then independently researched withheld content on social networks in European countries, and developed a Shiny web app for real-estate price estimation using 10 years of French tax office open-data. As a research associate in the CELEHS laboratory, he focuses on standardizing analysis processes, enhancing statistical visualizations, and facilitating the dissemination of analyses results using APIs. His research applies natural language processing to unstructured text data related to mental health and suicide prevention, as scientific publications and electronic health records, to assist psychiatrists and clinicians in identifying at-risk patients.",
    "website": {
      "name": "Gitlab",
      "url": "https://gitlab.com/thomaschln"
    }
  },
  "12406": {
    "name": "Travis Hughes",
    "title": "Program Coordinator (District 13)",
    "organization": "NYC FIRST",
    "photo": {
      "alt": null,
      "height": "1984",
      "width": "1991",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/IMG_3386%20%282%29.jpg"
    },
    "biography": "I'm a tech nerd, who's obsessed with any and everything related to robotics, renewables and infrastructure. I've been into robotics for as long as I can remember. When I was younger, I loved to take apart anything electronic, study it and reassemble it and now as an adult, I'm a STEM educator and building Arduino-based robots in my free time. I'm very happy to be alive in this period in time because I believe that we (humanity) are in the beginning of a tech/robotics, Industrial Revolution and that we have the ability to use current and emerging technology to make the world a better place for everyone living in it. My ultimate goal with tech/my career is to do something that moves human civilization even a small step closer to becoming a Type I Civilization.",
    "website": {
      "name": "https://arduinobotics.io/",
      "url": "https://arduinobotics.io/"
    }
  },
  "12411": {
    "name": "Noel Miller",
    "title": "Core Contributor",
    "organization": "Universal Blue",
    "photo": {
      "alt": null,
      "height": "2580",
      "width": "2414",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/IMG_1619.jpg"
    },
    "biography": "Noel Miller is a Technical Account Manager at Red Hat, and the Core Contributor at Universal Blue. He has been working in IT for a little over 10 years, with most of his career being focused on Small and Medium Size businesses. For his day job, he works at Red Hat as a Technical Account Manager with a focus on Ansible. He is a Core Contributor at Universal Blue. Universal Blue builds a diverse set of continuously delivered operating system images using Fedora Atomic Desktop's support for OCI/Docker containers. Outside of his IT endeavors, he enjoys spending time with his family, playing video games, listening to heavy metal music, and playing guitar. \n    For more information, please visit: \n \n https://noelmiller.dev/pages/about",
    "website": {
      "name": "Blog",
      "url": "https://noelmiller.dev/"
    }
  },
  "12413": {
    "name": "Nathaniel Moore",
    "title": "Principal Architect",
    "organization": "Inertia Labs ",
    "photo": {
      "alt": null,
      "height": "443",
      "width": "512",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/NMoore-headshot-Feb24.png"
    },
    "biography": "I got my start working in the tech world back in the dot-com days, at an Idealab! startup.  I have also spent time in Web2 at MySpace, and more recently in Web3 at my own startup.  I have worked extensively with systems and networks, including as a Principal Architect in the CDN world.  I present on various topics at a wide variety of venues, with recordings and slide decks posted online.  I am currently the Principal Architect at Inertia Labs, a consulting firm dedicated to issues around serving infrastructure quality such as SRE, Observability, and Platform Architecture",
    "website": {
      "name": "LinkedIn Profile",
      "url": "https://www.linkedin.com/in/namoore/"
    }
  },
  "12414": {
    "name": "Igor Donchovski",
    "title": "Principal Consultant",
    "organization": "Pythian",
    "photo": {
      "alt": null,
      "height": "732",
      "width": "732",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/profile_pic-circle.png"
    },
    "biography": "Database administrator with extensive experience designing, administration, implementation and supporting next-generation MySQL and MongoDB database solutions in the hybrid Cloud. Looking for Python development with intermediate experience and Terraform projects.",
    "website": null
  },
  "12417": {
    "name": "Avi Press",
    "title": "Founder & CEO",
    "organization": "Scarf",
    "photo": {
      "alt": null,
      "height": "1000",
      "width": "1000",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/avipress_scarf%20%281%29%20%281%29.jpeg"
    },
    "biography": "Avi Press is a developer tool author, and functional programming language enthusiast, serving as a founder & CEO at Scarf. Avi loves thinking about and discussing how people can solve problems by more effectively sharing data, and how that applies to building a sustainable open-source ecosystem. He is also a host of the Hacking Open Source Business Podcast, where Avi continues to share insights, inspire discussions, and contribute to the ever-evolving open-source landscape.",
    "website": null
  },
  "12418": {
    "name": "Rob Royce",
    "title": "Data Scientist",
    "organization": "NASA Jet Propulsion Laboratory",
    "photo": {
      "alt": null,
      "height": "242",
      "width": "242",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/RobInATie.jpeg"
    },
    "biography": "Rob received his B.S. in Computer Science and Engineering from the University of California, Los Angeles (UCLA), where he was admitted as a Regents Scholar. He is currently a Data Scientist in the Artificial Intelligence \\& Analytics Group at NASA's Jet Propulsion Laboratory (JPL) and serves as the Systems Integration Lead for various robotics projects, including NAISR/NeBula and EELS. Rob is a leading practitioner and subject matter expert in Generative AI (GenAI) at JPL, and is also registered as a NASA AI Advisor. He has worked on numerous innovative GenAI projects, such as utilizing retrieval-augmented generation to analyze vast datasets, developing code generation tools for flight software, and creating applications that enable users to interact with their documents through conversational interfaces. His extensive experience in software engineering, artificial intelligence, machine learning, and robotics has culminated in the development of ROSA, the Robot Operating System Agent.",
    "website": {
      "name": "GitHub",
      "url": "https://github.com/RobRoyce"
    }
  },
  "12419": {
    "name": "Michal Nasiadka",
    "title": "Senior Technical Lead",
    "organization": "StackHPC",
    "photo": null,
    "biography": "Michal is a Senior Technical Lead at StackHPC. He has worked in OpenStack across different companies for 10+ years including Enterprise, Telco and HPC markets. He currently serves as a Project Team Lead for OpenStack Kolla and core team member for OpenStack Magnum.",
    "website": {
      "name": "StackHPC website",
      "url": "https://www.stackhpc.com"
    }
  },
  "12420": {
    "name": "Guillaume Saunier",
    "title": "Partnerships and Fundraising",
    "organization": "Voca.city",
    "photo": {
      "alt": null,
      "height": "4032",
      "width": "3024",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/IMG_0936.jpeg"
    },
    "biography": "Guillaume Saunier is a professional focusing on the intersection of tech and politics. He is dedicated to helping organizations worldwide make pro-social technological choices. As the Partnerships and Fundraising lead at Octree, he spearheads civic-tech projects like Voca.city, creating sustainable, collective alternatives. Previously Guillaume worked at International Organizations where he was involved with fundraising and donor relations. With a Master's in International Business from the University of Edinburgh, and Bachelor in Politics from the University of London Guillaume focuses on harnessing tech for political and social impact.",
    "website": {
      "name": "Voca",
      "url": "http://www.voca.city"
    }
  },
  "12435": {
    "name": "Vinit Dhatrak",
    "title": "Lead Software Engineer",
    "organization": "DocuSign",
    "photo": {
      "alt": null,
      "height": "1226",
      "width": "1079",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Vinit_23-09-12_1203.jpeg"
    },
    "biography": "Ex-Google, @DocuSign Lead Software Engineer with a passion for cloud, AI, and data. Vinit is a seasoned software engineer with a demonstrated history of building on-premise and cloud-native distributed systems at scale. Currently, Vinit serves as a Lead Software Engineer at DocuSign, contributing to the Docusign's Storage team. With expertise encompassing cloud storage, distributed systems, and virtualization technologies such as Kubernetes, Docker, and the Linux Kernel, Vinit stands out as a thought leader in the tech industry. Throughout his career, Vinit has held pivotal roles at notable companies like Google, Box, Commvault, and Marvell, where he played an instrumental role in developing highly scalable and distributed cloud storage solutions. His proficiency in object-oriented design and systems programming, coupled with his capability to scale infrastructures to handle concurrent requests and planet-scale storage, positions him as a tru",
    "website": null
  },
  "12443": {
    "name": "Xpaul Vigil",
    "title": "Staff DevOps Engineer",
    "organization": "Crexi",
    "photo": {
      "alt": null,
      "height": "526",
      "width": "460",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Screenshot%202024-09-06%20at%2010.59.34%E2%80%AFAM.png"
    },
    "biography": "Xpaul acquired his nickname in the late 1900s at dot-com incubator Idealab! while still pursuing undergraduate studies at Caltech. The Internet was all the rage, compiling X11 frame buffer drivers on Linux for laptops was the new hotness, and the apps of the time were X11 widgets like xterminal, xcalc, and x-googly-eyes, so when it turned out there was already a \"paul\" on the qmail server, \"xpaul\" was born. \n    Reared by ethical hackers, he since developed, operated, and supported production platform and development infrastructure for:\n* dozens of teams,\n* hundreds of websites,\n* tens of thousands of servers,\n* millions of users per month,\n* hundreds of millions of dollars of assets under management,\n* billions of pageviews per month,\nat companies from startups to large enterprises, including Yahoo! and Disney, Deep 6 AI, Peer Street, and now Crexi, largely using Free/Libre and Open Source software. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n His enthusiasm for solving intricate software problems has yet to wane.",
    "website": null
  },
  "12447": {
    "name": "Masahji Stewart",
    "title": "Chief Architect",
    "organization": "Synctree",
    "photo": {
      "alt": null,
      "height": "512",
      "width": "512",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/personal-photo.jpeg"
    },
    "biography": "Masahji Stewart is the Chief Architect and founder of Synctree Inc., transforming ideas into successful product launches for over 15 years. Masahji has led Synctree to deliver high-profile projects across industries like media, healthcare, and finance. Over the last four years, he has directed Synctree’s expansion into cutting-edge AI solutions, helping businesses integrate AI to enhance operations. With more than 25 years in software engineering and architecture, Masahji is also an adjunct professor at Loyola Marymount University and an advisory board member at Santa Monica College, where he mentors future technologists. Committed to innovation, Masahji ensures Synctree’s R&D team remains at the forefront of AI advancements, sharing these innovations with clients to help them stay ahead in a rapidly evolving tech landscape.",
    "website": {
      "name": "Synctree Inc",
      "url": "https://www.synctree.com"
    }
  },
  "12455": {
    "name": "Jamie Parker",
    "title": "Product Manager",
    "organization": "Red Hat",
    "photo": {
      "alt": null,
      "height": "474",
      "width": "475",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/2024Profile.jpg"
    },
    "biography": "Jamie Parker is a Product Manager at Red Hat who specializes in Observability, particularly in the Logging and OpenStack areas.  At Red Hat, Jamie works with organizations and customers to learn about their needs within the ever changing Observability landscape, and based on their feedback, Helps to guide upcoming products within the Red Hat Observability Platform.  Jamie enjoys sharing lessons learned to the community by frequently speaking at meetups and conferences, and by blogging.",
    "website": null
  },
  "12456": {
    "name": "Carl Richell",
    "title": "CEO",
    "organization": "System76",
    "photo": {
      "alt": null,
      "height": "512",
      "width": "512",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Carl_Richell_Headshot_512.jpg"
    },
    "biography": null,
    "website": {
      "name": "System76",
      "url": "http://system76.com"
    }
  },
  "12461": {
    "name": "Vahan Melikyan",
    "title": "Manager Software Engineering",
    "organization": "GoodRx",
    "photo": {
      "alt": null,
      "height": "1276",
      "width": "1280",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/IMG_0035%202.JPG"
    },
    "biography": null,
    "website": {
      "name": "https://vahanmelikyan.com",
      "url": "https://vahanmelikyan.com"
    }
  },
  "12467": {
    "name": "Angelina Vu",
    "title": "Software Engineer",
    "organization": "Microsoft",
    "photo": {
      "alt": null,
      "height": "1292",
      "width": "1096",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Image%20%282%29.jpg"
    },
    "biography": "Angelina is a software engineer on Micorosoft's Linux Emerging Technologies team.",
    "website": null
  },
  "12471": {
    "name": "Annie Hedgpeth",
    "title": "Co-Founder",
    "organization": "Hedge-Ops Software",
    "photo": {
      "alt": null,
      "height": "316",
      "width": "316",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/annie-hedgpeth-profile.jpeg"
    },
    "biography": "From film to engineering, Annie’s career has seen many iterations. She is a keen observer of what works and what doesn’t, striving always to make the right thing to do the easy thing to do. Annie and her husband, Michael, are raising their three teenagers in Boulder, CO. She’s currently working on a project to make doing the right thing with your career the easy thing to do. Find out more at people-work.io.",
    "website": {
      "name": "People Work",
      "url": "https://people-work.io"
    }
  },
  "12481": {
    "name": "Sara Huddleston",
    "title": null,
    "organization": "Pulumi",
    "photo": {
      "alt": null,
      "height": "512",
      "width": "512",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Me-set.png"
    },
    "biography": "Early on, Sara shifted from economics to marketing, inspired by \"The Invisible Hand,\" and focused on a human-centered approach. She has diverse marketing experience, from Fortune 200 companies to startups. Sara currently works at Pulumi, an Infrastructure as Code startup. She is passionate about the DevOps culture and mindset, which puts people first, and the value of soft skills. In her free time, she provides on-demand high-level strategy consulting to undisclosed executives in mid-to-large corporations, pro bono consulting to local micro-businesses, and fosters puppies and kittens.",
    "website": {
      "name": "Pulumi Blog",
      "url": "https://www.pulumi.com/blog/author/sara-huddleston/"
    }
  },
  "12483": {
    "name": "Nikki-Rae Alkema",
    "title": "Nikki-Rae Alkema, PT, DPT",
    "organization": "Torrance Memorial Medical Center",
    "photo": {
      "alt": null,
      "height": "787",
      "width": "794",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/nikki-headshot-ORG.png"
    },
    "biography": "Dr. Nikki-Rae Alkema, Doctor of Physical Therapy, is an orthopedic and pelvic health licensed physical therapist with a passion for improving quality of life through movement. In 2022, she received the esteemed Excellence in Biomechanics Award from the Doctor of Physical Therapy program at California State University, Long Beach. She believes in the power of using technological innovation to provide accessible and equitable healthcare. Some of her areas of special interest include Parkinson’s Disease, successful aging, and the biomechanics of road cycling.",
    "website": null
  },
  "12484": {
    "name": "Patrick BEAUCAMP",
    "title": "CEO",
    "organization": "BPM-Conseil",
    "photo": {
      "alt": null,
      "height": "600",
      "width": "600",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/IMG_1416-IN%20Visa%20%28format%20num%C3%A9rique%29-600x600%20px.jpg"
    },
    "biography": "Patrick Beaucamp is founder of the Vanilla project, the only true Open Source Business Intelligence Platform, and Data4Citizen, one of the leading Open Data Platform Patrick is Ceo of Bpm-Conseil, the company behind the Vanilla and Data4Citizen projects. \n    Patrick is a teacher in university to address data visualisation and search engine topics, and chairman of a chair : \n \n https://icom.univ-lyon2.fr/institut/gouvernance \n    Patrick Beaucamp has been rewarded CEO of the YEAR  2023 in category software editor : ²\n \n https://www.eubusinessnews.com/issues/french-ceo-of-the-year-awards-2023/6/",
    "website": {
      "name": "BPM-CONSEIL",
      "url": "http://www.bpm-conseil.com/"
    }
  },
  "12485": {
    "name": "Tim Banks",
    "title": "Customer Solution Architech",
    "organization": "Caylent",
    "photo": {
      "alt": null,
      "height": "2911",
      "width": "2064",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/AF3B62CC-55FF-4B10-95E2-8DC8EAFD0F14.jpeg"
    },
    "biography": "Tim’s tech career spans over 25 years through various sectors, in large corporate environments and in small startups, honing his skills in systems administration, automation, architecture, and operations for large cloud-based datastores.\nToday, Tim leverages his years in operations, DevOps, & Site Reliability Engineering to advise and consult with the open source and cloud computing communities. Tim is also a competitive Brazilian Jiu-Jitsu practitioner and instructor. He is the 2-time American National and 5-time Pan American Brazilian Jiu-Jitsu champion in his division.",
    "website": null
  },
  "12487": {
    "name": "Tony Breeds",
    "title": "Software Engineer",
    "organization": "Red Hat",
    "photo": {
      "alt": null,
      "height": "1556",
      "width": "1184",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Profile_20200409.jpg"
    },
    "biography": "Tony came to Linux in 1994 and has never looked back.  His entire professional career has been spent working with or on Linux.",
    "website": null
  },
  "12488": {
    "name": "Scott Bly",
    "title": "Director, API Security Practice",
    "organization": "iSOA Group",
    "photo": {
      "alt": null,
      "height": "2221",
      "width": "1972",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Scott%20suit%202018%20cropped.jpg"
    },
    "biography": "Scott Bly is the Director of the API Security Practice at iSOA Group where he leads customer DevSecOps transformations through an API-first journey of cyber maturity and continual improvement. Scott has served as a Cybersecurity Technical Account Manager (TAM) at Noname Security, and he led teams of TAMs at AWS where he ran the Enterprise Support Security Improvement Program, which has assisted thousands of customers to measure and improve their cloud security postures. Scott’s background as a film production major at USC and longtime IT Consultant was the perfect fit during his tenure as the Director of IT for the American Film Institute, where he led their digital transformation and migration to the cloud. Scott has served as a Cybersecurity Solutions Architect and holds more than 50 certifications in IT and security, including CISSP and CISM, and from vendors such as Fortinet, Cisco and AWS. Scott lives in Santa Monica with his wife, son, and two cats.",
    "website": {
      "name": "iSOA Group",
      "url": "https://www.isoagroup.com"
    }
  },
  "12489": {
    "name": "Joe Thompson",
    "title": "Consulting Engineer",
    "organization": "Clarity Business Solutions",
    "photo": {
      "alt": null,
      "height": "512",
      "width": "512",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/kensey-cropped.jpg"
    },
    "biography": "Joe Thompson's IT career is near the end of its third decade. He's been a Linux user since 1998, a professional sysadmin since 2001, and part of the cloud-native community since 2014. He's spoken at KubeCon, Cloud Native Rejekts and several local meetups and enjoys showing how well-known tools can help with new platforms.",
    "website": {
      "name": "Publications and presentations",
      "url": "https://www.orion-com.com/pub.html"
    }
  },
  "12490": {
    "name": "Adriana Villela",
    "title": "Principal Developer Advocate",
    "organization": null,
    "photo": {
      "alt": null,
      "height": "2303",
      "width": "2312",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Adriana%20Villela%20-%202024-09-12%20-%20square.jpeg"
    },
    "biography": "Adriana Villela is a public speaker, maintainer of the OpenTelemetry End User SIG, blogger, host of the Geeking Out Podcast, CNCF Ambassador (2023-present), and HashiCorp Ambassador (2022-present). By day, she is a Principal Developer Advocate at Dynatrace, with a focus on Observability and Platform Engineering. By night, she climbs walls. She also loves capybaras.",
    "website": {
      "name": "https://adri-v.medium.com",
      "url": "https://adri-v.medium.com"
    }
  },
  "12493": {
    "name": "Gene Liverman",
    "title": "Senior SRE",
    "organization": "LTN Global",
    "photo": {
      "alt": null,
      "height": "3088",
      "width": "2316",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/IMG_2312.jpeg"
    },
    "biography": "I’m an all around geek with a passion for systems administration and the DevOps culture who is always searching for a better way to accomplish a task or to solve a problem. I’m also a pragmatic systems architect who regularly looks for non-traditional solutions to problems. I believe in using the best operating system for the problem at hand, be it Linux, macOS, Windows, or something else. I’ve been working in IT for over 20 years and have been using all three of those the entire time. At work I’m kind of a cross between a systems administrator, a systems architect, and a programmer along with some aspects of a team lead. In the past I’ve also been a network engineer, firewall admin, storage admin, and data center manager. My current world revolves around a combination of physical servers & appliances managed with Puppet, Kubernetes, and virtualization. When not at work, I’m also a home automation junkie and Cub Scout den leader. Online I’m usually known as GeneBean.",
    "website": {
      "name": "The Comfy Seat",
      "url": "https://beanbag.technicalissues.us"
    }
  },
  "12495": {
    "name": "Jonathan Haslam",
    "title": "Software Engineer",
    "organization": "Meta",
    "photo": {
      "alt": null,
      "height": "2232",
      "width": "3060",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Scale-bio.jpg"
    },
    "biography": "Currenty I'm an engineer at Meta where I've spent the last 6 years developing and applying software for C++ application observability. During my career I've has been fortunate enough to be involved in developing some interesting technologies including Sun Microsystem's Solaris Dynamic Tracing system (DTrace) and technologies within Oracle's RDBMS Database.",
    "website": null
  },
  "12496": {
    "name": "Jordan Rome",
    "title": "Software Engineer",
    "organization": "Meta",
    "photo": {
      "alt": null,
      "height": "946",
      "width": "1110",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Screenshot%202024-12-02%20at%202.25.45%E2%80%AFPM.png"
    },
    "biography": "I hold a bachelor's degree in Literature from the University of California at Santa Barbara and a master's degree in Poetry from Sarah Lawrence College. Currently, I am a Software Engineer at Meta. I have worked as a developer at UCLA, Sarah Lawrence College, The City University of New York, Zeebox, and Spotify. I also enjoy cooking, playing the guitar, horology, and taking long walks with my wife and dog.",
    "website": {
      "name": "My Website",
      "url": "https://jordalgo.github.io/"
    }
  },
  "12505": {
    "name": "Daniel Xu",
    "title": "Software Engineer",
    "organization": "Meta",
    "photo": {
      "alt": null,
      "height": "500",
      "width": "500",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/me_3.jpeg"
    },
    "biography": "I like to hack on systems software.",
    "website": {
      "name": "dxuuu.xyz",
      "url": "http://dxuuu.xyz"
    }
  },
  "12506": {
    "name": "Zubair Talib",
    "title": "Executive Director",
    "organization": "Celara",
    "photo": {
      "alt": null,
      "height": "2549",
      "width": "2549",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Zubair%20Square%20Smaller.jpeg"
    },
    "biography": "Zubair Talib is a seasoned technology entrepreneur with over 20 years of experience in AI and enterprise software. He has driven the development of innovative AI solutions, including voice-based restaurant ordering systems and conversational AI for recruitment. Zubair is currently the Executive Director at Celara, a leading technology services company specializing in building teams and solutions with a focus on AI, machine learning, and enterprise software. Zubair has served as CTO for several companies, including ConverseNow and Qu, where he led the development of scalable, cloud-based platforms. He also founded JobBot.ai, an AI-driven recruitment platform, and was the CEO of YaSabe.com, a leading local information hub for U.S. Hispanics. Zubair holds multiple patents and has deep expertise in large language models, generative AI, and natural language processing. He earned his B.S. and M.Eng. in Electrical Engineering and Computer Science from MIT.",
    "website": {
      "name": "http://www.celaralabs.com",
      "url": "http://www.celaralabs.com"
    }
  },
  "12507": {
    "name": "Alok Ranjan",
    "title": "Software Engineering Manager",
    "organization": "Dropbox",
    "photo": {
      "alt": null,
      "height": "1315",
      "width": "1315",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/IMG_7468.png"
    },
    "biography": "Alok Ranjan is an Engineering Manager at Dropbox, where he leads the storage-platform team, delivering secure, reliable, and cost-efficient storage solutions at scale. With over a decade of experience at companies like VMware, Big Switch Networks, and Cisco, Alok specializes in scalable infrastructure and data encryption technologies. He holds a master’s degree from Carnegie Mellon University and is passionate about mentoring engineers and advancing cloud storage innovation. Alok is known for his strategic leadership, managing cross-functional projects that drive business impact. He frequently participates in tech conferences, sharing insights on scaling cloud storage and security optimizations. Outside of work, he mentors at AI-based startups, staying engaged with advancements in AI. His result-driven approach emphasizes fast execution while fostering strong team collaboration and long-term success.",
    "website": null
  },
  "12512": {
    "name": "Lori Lorusso",
    "title": "Head of Community",
    "organization": "Percona",
    "photo": {
      "alt": null,
      "height": "512",
      "width": "512",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/lori-lorusso%20%281%29.jpg"
    },
    "biography": "Lori has a passion and enthusiasm for working with the developer and open source community. She is the Data on Kubernetes SIG Co-Chair, a CNCF & CDF Ambassador, former Chair of CNCF Marketing Committee and the CDF Outreach Marketing Committee, program chair of cdCon 2023, and is active in the OpenSSF DevRel committee. She co-hosts the CD Pipeline on behalf of the CDF with TechstrongTV. She is committed to helping open source and other tech communities grow and adapt in our ever changing environment. She is currently Head of Community for Percona.",
    "website": {
      "name": "LinkedIn",
      "url": "https://www.linkedin.com/in/lorilorusso/"
    }
  },
  "12514": {
    "name": "Francisco Araya",
    "title": "CEO",
    "organization": "Sentinella",
    "photo": {
      "alt": null,
      "height": "337",
      "width": "337",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/fjaraya.jpg"
    },
    "biography": "CEO @ Sentinel.la. Computer Science Engineer from Chile with a vast experience on R&D and Cloud. I've deployed and worked with OpenStack clouds on production for 10 years. Followed by the desire to continue innovating and supporting OpenStack we founded Sentinel.la to help solve the main OpenStack pain points from a user's perspective in the real world from Chile and Mexico to Latin American markets, narrowing the gap between \"everything works\" in architecture and the \"now, what?\" operation.",
    "website": {
      "name": "Francisco J Araya",
      "url": "http://fjaraya.org"
    }
  },
  "12520": {
    "name": "Josh Thornton",
    "title": "Founding Engineer",
    "organization": "Speedscale",
    "photo": {
      "alt": null,
      "height": "1280",
      "width": "1280",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/H0Km69Lk.jpeg"
    },
    "biography": "Just a guy who loves building things.",
    "website": null
  },
  "12521": {
    "name": "Daniil Fedotov",
    "title": "Senior Open Source Engineer",
    "organization": "Veeam",
    "photo": {
      "alt": null,
      "height": "997",
      "width": "775",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Photo.jpg"
    },
    "biography": "Infrastructure and cloud services developer. I'm deeply passionate about open source. Currently contributing to the Kanister project at Kasten by Veeam, we're reshaping data management for Kubernetes.",
    "website": null
  },
  "12522": {
    "name": "Peter Boros",
    "title": "Founding Engineer",
    "organization": "Tigris Data",
    "photo": {
      "alt": null,
      "height": "2016",
      "width": "1512",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/me_22.jpg"
    },
    "biography": "Peter is a Founding Engineer at Tigris. Before joining the Tigris team, he worked at Percona, Dropbox, Zuora and Sun microsystems. Peter’s background and professional interest is running databases at scale, he had the opportunity to work on very large MySQL deployments alone with other data stores. Also very performance minded.",
    "website": null
  },
  "12527": {
    "name": "Chris Morgan",
    "title": "Product Owner, Bloomberg Cloud Compute",
    "organization": "Bloomberg L.P.",
    "photo": {
      "alt": null,
      "height": "400",
      "width": "400",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/fd3759a3a92340b1_0.png"
    },
    "biography": "I have spent over ten years helping launch Bloomberg's OpenStack private cloud. As part of this effort I was chairman and co-organizer of the Openstack Operators Meetups team and we successfully organized multiple meetups around the world including in New York, London, Tokyo, Berlin and Mexico City",
    "website": {
      "name": "my mastodon instance",
      "url": "https://mastodon.mihalis.net/@chris"
    }
  },
  "12528": {
    "name": "Amy Marrich",
    "title": null,
    "organization": "Red Hat",
    "photo": {
      "alt": null,
      "height": "3024",
      "width": "4032",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/amyheadshot.png"
    },
    "biography": "Amy Marrich is a Principal Technical Marketing Manager at Red Hat. She currently serves as the Chair of the CentOS Project, Vice Chair of the Open Infrastructure Foundation (OpenInfra) Board of Directors, and is on the Community Health Analytics in Open Source Software (CHAOSS) projects governing board. In addition, she serves on the Red Hat OpenStack technical committee, is Chair of the OpenInfra Diversity and Inclusion Working Group, contributes to several OpenStack projects, and previously served as the Chair of the OpenStack User Committee.",
    "website": null
  },
  "12530": {
    "name": "Kathryn \"Casey\" Bouskill",
    "title": "Senior Researcher",
    "organization": "Meta",
    "photo": {
      "alt": null,
      "height": "479",
      "width": "385",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Bouskill_Headshot.jpg"
    },
    "biography": "Bouskill is a senior researcher at Meta where she works in Meta’s Reliability Engineering organization. An anthropologist by training, Bouskill has worked around the world on a range of issues related to technology, risk & security, and public health. She is an adjunct researcher at the RAND Corporation and professor at the Pardee RAND Graduate School. Bouskill holds a Ph.D. in Anthropology and an M.P.H. in Epidemiology from Emory University.",
    "website": null
  },
  "12537": {
    "name": "Emily Le",
    "title": "Developer Advocate",
    "organization": "RisingWave Labs",
    "photo": {
      "alt": null,
      "height": "1000",
      "width": "1000",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/20231028_000927-Photoroom-2.png"
    },
    "biography": "Emily is a Developer Advocate at RisingWave Labs, working in the stream processing space, and curious about all data-related technologies. At RisingWave Labs, she builds demos, creates product videos, and writes tutorials, guides, and blogs.",
    "website": null
  },
  "12538": {
    "name": "Bartosz Bezak",
    "title": "Senior Tech Lead",
    "organization": "StackHPC",
    "photo": {
      "alt": null,
      "height": "1263",
      "width": "1914",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/test.png"
    },
    "biography": "OpenStack user since Kilo and currently a Kolla core reviewer, I bring extensive hands-on experience managing Linux, AIX, and Kubernetes environments. With a strong focus on performance, scalability, and reliability, I’m dedicated to advancing open-source cloud technologies.",
    "website": null
  },
  "12540": {
    "name": "Martial Michel",
    "title": "Chief Technologist, Vice President AI & Data Sciences",
    "organization": "Infotrend Inc.",
    "photo": {
      "alt": null,
      "height": "1027",
      "width": "1024",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/MM_Pic-AI.jpg"
    },
    "biography": "Worked in the distributed computing field for over 25 years, starting with designing data serialization algorithms for MPI (PhD subject), time synchronizing multimedia network streams collected using commercial-off-the-shelf hardware, developing a job scheduler, architecting data-driven research evaluation platforms, and conceiving and leading the team building an agnostic benchmarking model to allow researchers to bring their algorithms to specialized datasets. \n    Co-chair of the OpenStack Scientific Working Group for North America.\nCo-chair and one of the authors of the now published IEEE 2302-2021 Cloud Federation standard.\nCo-Author of the NIST Technical Series Publication SP 500-332 \"The NIST Cloud Federation Reference Architecture\".\n \n \n \n \n Passionate about teaching and mentoring others in the fields that I have been fortunate to work on over the years, be it Computer Vision, Natural Language Processing, Architecture and Infrastructure, Project Management, Growth mindset, .",
    "website": {
      "name": "Infotrend Inc",
      "url": "https://www.infotrend.com/"
    }
  },
  "12543": {
    "name": "Federico Gonzalez-Waite",
    "title": null,
    "organization": null,
    "photo": {
      "alt": null,
      "height": "1304",
      "width": "1252",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Foto%20fede.jpg"
    },
    "biography": "Federico is a seasoned leader with a global perspective and a deep commitment to advancing technology in Latin America and their home countries. I possess extensive experience in both the public and private sectors, as well as at national and international levels.\nHe is passionate and results-oriented innovator with a proven track record of leveraging technology for development, social inclusion, and technological sovereignty and independence.\nA Mexican professional educated in New Zealand, Estonia, France, Israel, and the United States. I am dedicated to the digital transformation and democratisation of Mexico.\nFederico had the privilege of serving his country in C-Level IT roles within the Federal Government including CEO of the National Research and Innovation for ICT of Mexico (INFOTEC)",
    "website": null
  },
  "12544": {
    "name": "Mikaël Francoeur",
    "title": "Senior software engineer",
    "organization": "Ticketmaster",
    "photo": {
      "alt": null,
      "height": "250",
      "width": "200",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/photo%20confoo_1.jpg"
    },
    "biography": "Mikaël is currently a senior software engineer at Ticketmaster. He enjoys spending time with family, taming complexity, and three-element enumerations. Before working as a software engineer, he was a musician and a researcher.",
    "website": {
      "name": "Tinkering With Tech",
      "url": "https://lemikaelf.github.io/blog/"
    }
  },
  "12547": {
    "name": "Justin Reock",
    "title": "Deputy CTO",
    "organization": "DX",
    "photo": {
      "alt": null,
      "height": "1164",
      "width": "2066",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Justin%20Reock%20-%20Headshot.png"
    },
    "biography": "Justin Reock is the Deputy CTO at DX (getdx.com), and is an outspoken speaker, writer, and software practice evangelist. He has over 20 years of experience working in various software roles and has delivered enterprise solutions, technical leadership, and community education on a range of topics. After a fifteen year career in software development, Justin now focuses on helping businesses create better throughput by optimizing the developer experience. Much of his work can be found online including lectures, keynotes, blogs, and other publications.",
    "website": null
  },
  "12551": {
    "name": "Bryan Honof",
    "title": "Software Engineer",
    "organization": "Flox",
    "photo": {
      "alt": null,
      "height": "640",
      "width": "640",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/previse-volt-70%20%282%29.png"
    },
    "biography": "Bryan's been interested in computing for as long as he can remember. Even studying electronic engineering, just to understand how a computer could add 2 numbers together on a transistor level. Recently, he's been interested in the smaller details of operating systems. How they work, why they look they way they do, and why LISP machines never took off. Please don't hesitate to approach him about anything tech, or music, related. But, be warned, he has a tendency to just keep on talking once he gets going.",
    "website": null
  },
  "12552": {
    "name": "Divine Odazie",
    "title": "Technology Evangelist",
    "organization": "Severalnines",
    "photo": {
      "alt": null,
      "height": "1250",
      "width": "1250",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Divine_profile_image_2%20%284%29.png"
    },
    "biography": "Currently a Technology Evangelist at Severalnines, Divine Odazie is a Developer Relations Professional and Technical Writer with over 5+ years of experience in Technology and a track record in Backend Engineering, DevOps, Cloud Native and Developer Relations on a global scale. He has given talks/workshops at developer conferences like Open Source Summit Europe, KubeCon North America, Cloud Native Rejekts, and Ansible Contributor Summit. He also supports the cloud native community in Africa as a KCD (Kubernetes Community Days) Organizer, and other communities empowering Africa with Technology.",
    "website": {
      "name": "LinkedIn",
      "url": "https://www.linkedin.com/in/divine-odazie/"
    }
  },
  "12554": {
    "name": "Matthew Small",
    "title": "Entrepreneur",
    "organization": "Kwaai, Lucid Cradle, Stable Pathways Group",
    "photo": {
      "alt": null,
      "height": "1900",
      "width": "1600",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Matt%20Small-crop_1600x1900.jpg"
    },
    "biography": "Matthew is a seasoned leader with 15 years of experience driving customer, product, and revenue success in pioneering cloud technology companies from seed to C stage. As a founding team builder and operational leader, he consistently delivers results by identifying and navigating nascent markets. Now, Matthew leverages his expertise to develop individuals and companies, guide leaders, and shape new industries. Matthew has tenured experience building businesses and products around cloud OSS projects and companies like CloudStack, OpenStack, Kubernetes, Bitnami and Pulumi, as well as Open Source AI projects and communities with Kwaai.",
    "website": {
      "name": "mattasmall",
      "url": "http://mattasmall.com"
    }
  },
  "12555": {
    "name": "Jash Mistry",
    "title": "Senior Software Engineer",
    "organization": "eBay",
    "photo": {
      "alt": null,
      "height": "564",
      "width": "476",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/20240916_111543_Original.jpg"
    },
    "biography": "Jash Mistry is a Senior Software Engineer at eBay. As a member of the Site Reliability Engineering team, he played a crucial role in the evolution of monitoring—expanding on absolute error counts and average latencies to develop a highly reliable SLO-driven observability platform. He has a Master's Degree in Computer Engineering from Georgia Institute of Technology. Movie theatres are his second home, but he does not mind seeing one from the couch as long as it's on Mubi or the Criterion Channel.",
    "website": null
  },
  "12556": {
    "name": "Maciej Lecki",
    "title": "Senior Solutions Architect",
    "organization": "Red Hat",
    "photo": {
      "alt": null,
      "height": "800",
      "width": "800",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/1646737789322.jpg"
    },
    "biography": "Maciej Lecki is a distinguished industry veteran, bringing over two decades of experience in network engineering. Maciejs unwavering passion lies in open-source computer networking, and he is are a driving force behind cutting-edge solutions. As an influential thought leader, Maciej actively contributes to open-source projects and mentors aspiring professionals.",
    "website": null
  },
  "12557": {
    "name": "Brady Hancock",
    "title": null,
    "organization": null,
    "photo": null,
    "biography": null,
    "website": null
  },
  "12560": {
    "name": "James Blair",
    "title": null,
    "organization": "Acme Gating",
    "photo": {
      "alt": null,
      "height": "2128",
      "width": "1416",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/headshot2_1.jpg"
    },
    "biography": "James is the project lead for the Zuul project gating system, and a\nfounding member of the OpenDev collaboratory team.  As a sysadmin and\nhacker he gets to write elegant code and then try to make it work in the\nreal world.  He has previously worked for the Free Software Foundation,\nUC Berkeley, and the OpenStack Foundation.  He currently provides Zuul\nsupport and services through Acme Gating.",
    "website": {
      "name": "Acme Gating",
      "url": "https://acmegating.com/"
    }
  },
  "12562": {
    "name": "Jared Bernard",
    "title": "Faculty",
    "organization": "Metropolitan Community College",
    "photo": {
      "alt": null,
      "height": "667",
      "width": "1000",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Headshot2022sm.jpg"
    },
    "biography": "Jared is a proud father of five wonderful kids and a devoted husband. He is originally from Southern California, but now resides in a small Midwestern town. He works as an instructor at Metropolitan Community College in Omaha, where he teaches courses in Linux System Administration, Cisco Networking, and Cybersecurity.",
    "website": {
      "name": "LinkedIn",
      "url": "https://linkedin.com/in/jaredtbernard"
    }
  },
  "12563": {
    "name": "Addison Hart",
    "title": "Software Engineer",
    "organization": "Verizon",
    "photo": {
      "alt": null,
      "height": "1836",
      "width": "1836",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/new_headshot.jpg"
    },
    "biography": "Addison Hart is a recent graduate of the Colorado School of Mines and a software engineer at Verizon on the infrastructure team in Aurora. In addition to his full time work on automation, he has 4 years of experience reverse engineering APIs and homebrewing embedded devices. His most well known work in that space is the public Mario Maker 2 API used by that community. He is an active contributor to local Linux User Groups in the greater Denver area and has given 7 talks on topics ranging from the acquisition and storage of time in computers to the philosophy behind reverse engineering. He has served as the system administrator for the CS department at the Colorado School of Mines for 3 years and specializes in backend and data engineering.",
    "website": {
      "name": "TheGreatRambler's Website",
      "url": "https://tgrcode.com/"
    }
  },
  "12587": {
    "name": "Andrew Farries",
    "title": "Staff Software Engineer",
    "organization": "Xata",
    "photo": {
      "alt": null,
      "height": "512",
      "width": "512",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/photo_0.png"
    },
    "biography": "Andrew has more than 10 years of experience building database tools with a particular focus on databases in cloud native and SaaS environments. He currently works at Xata helping to build the next generation Postgres data platform. At Xata Andrew has a particular focus on building tools to help users achieve zero-downtime database migrations.",
    "website": null
  },
  "12588": {
    "name": "Kendall Nelson",
    "title": "Senior Upstream Developer Advocate",
    "organization": "The OpenInfra Foundation",
    "photo": {
      "alt": null,
      "height": "3024",
      "width": "4032",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/img_0574.jpg"
    },
    "biography": "Kendall first started working on OpenStack in 2015, and has since been bridging open source communities together (like OpenStack and Kubernetes) through her passion to collaborate. When she is not evangelizing about the awesomeness of open source, creating a welcoming community, or generally making upstream development in open source a friendlier place, she can be found reading Harry Potter, watching Doctor Who, or out on a photo taking adventure.",
    "website": null
  },
  "12595": {
    "name": "Kennedy Toomey",
    "title": "Security Advocate",
    "organization": "Datadog",
    "photo": {
      "alt": null,
      "height": "4000",
      "width": "3200",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/headshot_small.jpg"
    },
    "biography": "Kennedy Toomey is a Security Advocate at Datadog, specializing in application security. Previously she was an Application Security Engineer where she spent her time working with developers to help fix vulnerabilities and write more secure code.",
    "website": null
  },
  "12596": {
    "name": "Boaz Ardel",
    "title": "SRE",
    "organization": "eBay",
    "photo": {
      "alt": null,
      "height": "592",
      "width": "565",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/WhatsApp%20Image%202023-01-15%20at%209.59.07%20AM.jpeg"
    },
    "biography": "Boaz ArdeleBay, SRE\n \n \n \n    Experienced Site Reliability Engineer with mission-critical applications and working in large complex productionenvironments. Passionate about new technologies and challenges for building scalable and resilient systems. With 8 years of hands-on experience in development, cloud, service mesh, and networking. Willing to engage and deliver some of my insights to the community.",
    "website": null
  },
  "12598": {
    "name": "Ram Ellupuru",
    "title": null,
    "organization": null,
    "photo": {
      "alt": null,
      "height": "2572",
      "width": "2058",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/AM1I2265.jpeg"
    },
    "biography": "Ramprasad Ellupuru is a Site Reliability Engineering (SRE) Manager specializing in enhancing buyer experience and payments domains. At eBay, he leads initiatives to ensure critical buyer journeys maintain exceptional reliability and availability through robust engineering practices.",
    "website": null
  },
  "12600": {
    "name": "Pooja Ghumre",
    "title": null,
    "organization": null,
    "photo": null,
    "biography": null,
    "website": null
  },
  "12601": {
    "name": "Gene Chuang",
    "title": "Chief Slacker",
    "organization": "CTO Slackers",
    "photo": {
      "alt": null,
      "height": "800",
      "width": "800",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/gene.jpg"
    },
    "biography": "Gene is a software veteran and tech executive known for his expertise in mobile, social, cloud, Big Data, Search Marketing and eCommerce. He is most recently CTO of Flosports and has been head of engineering at P.volve, Beachbody, Sellbrite, Synctree and Oversee.   Before that he was Director of Engineering at Chegg,  Executive Director of AT&T Interactive and Director of Engineering at Yahoo Search Marketing/Overture where he built large-scale search marketing platforms.  Gene is a LP at Hyphen Capital investing in AAPI founders, mentor for Mucker Capital and founder of CTO Slackers, a global community of over 1300 tech leaders. Gene was coach of First Lego League, San Marino Safety Commission Board, and volunteer in SMUSD School PTA.  He graduated Magna cum Laude with a B.S. in Biochemistry from UCLA, where he met his wife, and lives in San Marino with 3 kids.",
    "website": {
      "name": "Gene's Core Dump",
      "url": "https://genechuang.substack.com/"
    }
  },
  "12606": {
    "name": "Mary Kypreos",
    "title": "Recruiter",
    "organization": "DBeaver",
    "photo": {
      "alt": null,
      "height": "683",
      "width": "683",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/1715633021846.jpeg"
    },
    "biography": "With more than 10 years of recruiting experience in the open source space, Mary specializes in creating positive candidate journeys that generate community advocacy and repeat applicants. Currently recruiting for DBeaver, her approach combines automation, transparency, and clarity, empowering companies to provide exceptional candidate interactions despite small hiring teams or limited tools. Through her commitment to hiring best practices, Mary has demonstrated that an optimized candidate experience can be a game-changer for companies, increasing referrals, strengthening reputation, and ensuring a consistent, positive presence in open source communities.",
    "website": {
      "name": "LinkedIn ",
      "url": "https://www.linkedin.com/in/marykypreos/"
    }
  },
  "12614": {
    "name": "Gulcin YildirimJelinek",
    "title": "Staff Database Engineer",
    "organization": "Xata",
    "photo": {
      "alt": null,
      "height": "1536",
      "width": "2304",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/gulcin-profile.JPG"
    },
    "biography": "Gülçin started working with Postgres at a startup company in 2012 and was amazed at how powerful Postgres truly is! Over the years, she has actively contributed to the Postgres community by organizing conferences, delivering talks, and engaging as a dedicated community member. In recognition of her commitment, Gülçin was elected to the PostgreSQL Europe Board in 2017. Fueled by her passion for PostgreSQL automation and cloud technologies, Gülçin took on the role of Cloud Services Manager and led the cloud development efforts at 2ndQuadrant, which was later acquired by EDB in 2020. Committed to fostering diversity and inclusion, she is an integral part of Postgres Women and the PostgreSQL Europe Diversity Committee, advocating for increased representation of women and all underrepresented people in tech. Gülçin recently got recognized as an official PostgreSQL Contributor. She works as a Staff Database Engineer at Xata, where she continues to explore her interests in PostgreSQL.",
    "website": null
  },
  "12618": {
    "name": "Joyce Lin",
    "title": "Head of developer relations",
    "organization": "Viam",
    "photo": {
      "alt": null,
      "height": "1920",
      "width": "1440",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/PXL_small.png"
    },
    "biography": "Joyce Lin is the head of developer relations at Viam, a robotics platform that connects software with smart machines in the physical world. Based in San Francisco, she is also a Tiktok influencer, dog mom, cat mom, and writer.",
    "website": null
  },
  "12619": {
    "name": "Chandan Avdhut",
    "title": "Production Engineer ",
    "organization": "Meta ",
    "photo": {
      "alt": null,
      "height": "2285",
      "width": "2219",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Chandan.jpg"
    },
    "biography": "As a seasoned production engineer with a strong background in Kubernetes, public cloud infrastructure, and large-scale AI/ML clusters, I bring a unique blend of technical expertise and real-world experience to the table. With a proven track record of designing and operating complex systems at scale, I'm passionate about sharing my knowledge and collaborating with the community to drive innovation in the world of container orchestration and open source technologies.",
    "website": null
  },
  "12620": {
    "name": "Vivekanandan Muthukrishnan",
    "title": "Architect",
    "organization": "DNASKEW Analytics Pvt Ltd",
    "photo": {
      "alt": null,
      "height": "531",
      "width": "413",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Vivek-Photo.jpg"
    },
    "biography": "Skilled software architect with 20+ years of experience in crafting enterprise Edge and Multi-Cloud architectures for\nHigh Performance Computing. Possess hands-on implementation experience in Equinix Data Center Digital Services and\nhyper-converged multi-cloud infrastructure private connectivity solutions for Azure, GCP, AWS, and Oracle Cloud.",
    "website": null
  },
  "12621": {
    "name": "benny Vasquez",
    "title": "Chair, Board of Directors",
    "organization": "AlmaLinux OS Foundation",
    "photo": {
      "alt": null,
      "height": "812",
      "width": "809",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/benny2023.png"
    },
    "biography": null,
    "website": {
      "name": "AlmaLinux",
      "url": "https://almalinux.org"
    }
  },
  "12622": {
    "name": "Nick Lewis",
    "title": "Software Engineer",
    "organization": "Flox",
    "photo": {
      "alt": null,
      "height": "512",
      "width": "512",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/profile_photo.jpg"
    },
    "biography": "Nick is an engineer at Flox, working to bring the power of Nix to the masses. Prior to that, he spent over a decade at Puppet, rewiring his brain to see the whole world as a desired state problem.",
    "website": null
  },
  "12624": {
    "name": "Mitchell Levy",
    "title": "Software Engineer",
    "organization": "Microsoft",
    "photo": {
      "alt": null,
      "height": "438",
      "width": "433",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Media.jpeg"
    },
    "biography": "Mitchell Levy is a recent graduate of the University of Washington's Paul G. Allen School of Computer Science and Engineering. His interests center on tools and methodologies that help people write safer and more robust code.",
    "website": null
  },
  "12626": {
    "name": "Tom Yin",
    "title": null,
    "organization": "TJTC LLC",
    "photo": {
      "alt": null,
      "height": "1830",
      "width": "1220",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Connect%20photo.jpg"
    },
    "biography": "Tom Yin is a seasoned technology executive specializing in networking, telecommunications, and business development, launching several networking businesses. Here's an overview of his journey:\n-  Principal and managing director of TJTC LLC, provides consulting advice and solution development to investment institutions and startups. Showcased Multicloud networking solution using SONIC at ONE Summit. Please see  for more information.\n- At Equinix, Tom launched over $30M/year within 3 years. Network Function Virtualization as a Service (VNFaaS) Marketplace from inception. Please see  for more information.\n- At IBM, Tom lead the launch of VoIP business by partnering with several startups.\n- At Optus, Tom served as the Chief Wireless Architect deploying infrastructure expansion following spectrum acquisition.\n \n \n \n \n \n \n \n \n \n \n https://sonicfoundation.dev/simplifying-multi-cloud-networking-with-soni... https://blog.equinix.com/blog/author/tom-yin/",
    "website": null
  },
  "12627": {
    "name": "Jason Hand",
    "title": "Senior Developer Advocate",
    "organization": "Datadog",
    "photo": {
      "alt": null,
      "height": "1000",
      "width": "667",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/jhand-headshot.JPG"
    },
    "biography": "Senior Developer Advocate at Datadog, focused on DevOps, SRE, and AI. Committed to empowering developers with modern engineering techniques for scalable, reliable, and explainable systems.",
    "website": null
  },
  "12628": {
    "name": "Amber Salome",
    "title": "Senior Field Engineer",
    "organization": "Grafana Labs",
    "photo": {
      "alt": null,
      "height": "596",
      "width": "618",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Screenshot%202024-11-18%20at%206.20.28%E2%80%AFPM.png"
    },
    "biography": "Amber is a Senior Field Engineer at Grafana Labs, where she focuses on observability solution architecture, building and maintaining complex demo environments and observability workshops, and provides expertise for customer solutions requiring metrics, logs, and Grafana observability tooling.  Amber has a background in infrastructure and monitoring, primarily working in Customer facing roles for Solution Architecture and Customer Success Engineering at Pivotal/VMware, Sysdig, and Grafana. Amber is based out of Chicago, IL and has always called the midwest home. In her free time she enjoys exploring the surrounding city and nearby nature, and is an avid cyclist.",
    "website": {
      "name": "https://grafana.com/",
      "url": "https://grafana.com/"
    }
  },
  "12629": {
    "name": "Jussi Nummelin",
    "title": "Senior Principal Engineer",
    "organization": "Mirantis",
    "photo": {
      "alt": null,
      "height": "640",
      "width": "640",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/jussi-nummelin-640x640.jpg"
    },
    "biography": "Jussi Nummelin is a tech veteran with 20 or so years in IT and software. Currently a Senior Principal Engineer at Mirantis, he leads the k0s Kubernetes distro development efforts. Jussi embraced containers early, deploying Docker 0.6 to production. Since 2017, he's been working in and around Kubernetes. Being hardheaded he still takes joy from building tools and solutions to bring cloud-native to masses. Beyond tech, he finds peace as an avid fisherman.",
    "website": null
  },
  "12630": {
    "name": "Steve Pousty",
    "title": "Principal Dev. Advocate",
    "organization": "Voxel51",
    "photo": {
      "alt": null,
      "height": "1150",
      "width": "1229",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/headshot_6.png"
    },
    "biography": "Steve is a dad, partner, son, a founder, and a principal developer advocate at Voxel51. He can teach you about Computer Vision, Data Analysis, Java, Python, PostgreSQL, Microservices, and Kubernetes. He has deep expertise in GIS/Spatial, Remote Sensing,  Statistics, and Ecology. Steve has a Ph.D. in Ecology and can be bribed with offers of bird watching or fly fishing.",
    "website": {
      "name": "https://www.voxel51.com",
      "url": "https://www.voxel51.com"
    }
  },
  "12632": {
    "name": "Carlos Eduardo da Silva",
    "title": "Senior Software Engineer",
    "organization": "Red Hat",
    "photo": {
      "alt": null,
      "height": "288",
      "width": "288",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/profile_16.jpg"
    },
    "biography": "I'm a contributor to the OpenStack's Shared File Systems as a service. I been working in OpenStack upstream core features for Manila project, as well as maintaining CI/CD infrastructures and Storage Drivers. I am passionate about the open source community and its open culture since the first time he had contact with it. I have been serving as PTL for Manila for several releases.",
    "website": null
  },
  "12633": {
    "name": "Goutham Pacha Ravi",
    "title": "Principal Software Engineer",
    "organization": "Red Hat Inc",
    "photo": {
      "alt": null,
      "height": "782",
      "width": "674",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Goutham_Profile.jpg"
    },
    "biography": "Goutham has been a contributor to OpenStack since the Liberty release (2015). He has been most active within the OpenStack Shared File Systems (manila), Block Storage (cinder) and UX (openstackcli, openstacksdk) project teams. He is currently the Chair of the OpenStack Technical Committee: . He's a Principal Software Engineer within the OpenStack Engineering team at Red Hat Inc. Prior to working on OpenStack, he has worked on several projects involving data protection across storage systems. Aside from his code contributions, Goutham spends a lot of his time building cross project synchronization and advocating for user experience and API stability. He was a Project Team Lead and the API working group liaison for the Shared File Systems project. As a firm believer in the OpenStack community and its ideals, Goutham devotes significant time to mentoring and onboarding new contributors.\n \n https://governance.openstack.org/tc/",
    "website": null
  },
  "12638": {
    "name": "Tanja Ulianova",
    "title": "Software Engineer",
    "organization": "Flox",
    "photo": {
      "alt": null,
      "height": "1145",
      "width": "850",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/tanja.jpg"
    },
    "biography": "Tanja is a Software Engineer with a passion for solid software architectures and smooth user experiences. She’s always eager to learn and share her knowledge. \n    She's currently working on Nix-based developer tooling at Flox, where she's building FloxHub — a platform that enables developers to share reproducible environments.\nWith her background in web development, she has been advocating for web accessibility since 2016, working to make the web a more inclusive space.\n \n \n When she’s not coding, you’ll find Tanja climbing, building stuff, or taking care of her urban garden.",
    "website": null
  },
  "12639": {
    "name": "Tim Dennis",
    "title": "Director",
    "organization": "Data Science Center - UCLA Library",
    "photo": {
      "alt": null,
      "height": "1067",
      "width": "800",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/tim-screen-sml.jpg"
    },
    "biography": "Tim Dennis is the co-PI of the UCLA Open Source Program Office (OSPO), part of the UC OSPO Network, and the Director of the Data Science Center at UCLA Library. With expertise in data services in academia, he leads efforts to support data initiatives like the UCLA DataSquad and UCLA Dataverse. A regular user of R, Python, SQL, and command-line tools, Tim has extensive experience helping researchers and students apply these tools. As a member of The Carpentries, he co-leads workshops that teach foundational coding and data science skills globally, emphasizing concise, practical instruction.",
    "website": {
      "name": "LinkedIN",
      "url": "https://www.linkedin.com/in/jtimdennis/"
    }
  },
  "12644": {
    "name": "Sriram Nambakam",
    "title": "Principal Software Engineer",
    "organization": "Microsoft Corporation",
    "photo": {
      "alt": null,
      "height": "1024",
      "width": "768",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/snambakam-profile-photo-3.png"
    },
    "biography": null,
    "website": null
  },
  "12647": {
    "name": "Yasufumi Ogawa",
    "title": "Distinguished Researcher",
    "organization": "NTT",
    "photo": {
      "alt": null,
      "height": "2886",
      "width": "2824",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/yasufum3.jpg"
    },
    "biography": "Distinguished Researcher, NTT Network Innovation Center. He is a PTL of Tacker from Victoria cyclea, and a maintainer of tosca-parser and heat-translator. He joined NTT in 2003. His research interests include distributed systems, network virtualization, and network architectures.",
    "website": null
  },
  "12649": {
    "name": "Toshiaki Takahashi",
    "title": "Software engineer",
    "organization": "NEC Corporation",
    "photo": {
      "alt": null,
      "height": "577",
      "width": "577",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/takahashi-1718274367877.jpg"
    },
    "biography": "Toshiaki Takahashi has been working on developing a platform for telecom in NEC. He has been providing a virtualization infrastructure using OpenStack and Kubernetes for high-availability services.He is a core developer of OpenStack Tacker community and has been contributing to the community in order to achieve Management and Orchestration functions.He has also been contributing to the O-RAN Software Community in order to expand the use of Management and Orchestration functions to RAN domain systems.",
    "website": null
  },
  "12652": {
    "name": "Yuya Kuno",
    "title": "Engineer",
    "organization": "NTT DOCOMO",
    "photo": {
      "alt": null,
      "height": "512",
      "width": "512",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/kuno.png"
    },
    "biography": "I am an engineer of the virtualization platform group of the core network development department in NTT DOCOMO. I am designing the operation of the EPC, 5G core, IMS, other core network function and radio network using NFV specification, and developing MANO for commercial mobile systems.\n- I developed OSS in DOCOMO to support operation of 2G/3G/4G core and radio network function by 2010.\n- I developed MANO in DOCOMO to virtualized EPC and IMS network by 2015.\n- I was bridge of development and ETSI NFV standard by 2020. I was rapporteur of SOL002 and SOL014 in ETSI NFV.\n- I am bridge of development of virtualization platform for core and radio, standard of ETSI NFV and O-RAN WG6, and OpenStack Tacker now.\n- I am ETSI NFV SOL WG Chair since Sep 2023.",
    "website": null
  },
  "12653": {
    "name": "Jayme Bird",
    "title": "Senior Software Engineer",
    "organization": "ClickHouse",
    "photo": {
      "alt": null,
      "height": "1310",
      "width": "1210",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Screenshot%202024-11-22%20at%2009.47.13.png"
    },
    "biography": "Jayme is a Senior Software Engineer on the Data Plane team at Clickhouse. His current focus is AutoScaling Clickhouse Cloud to provide seamless vertical scaling, horizontal scaling and idling. Prior to ClickHouse Jayme worked on InfluxDB Cloud at InfluxData.",
    "website": null
  },
  "12654": {
    "name": "Divya KK",
    "title": "Senior Technical Staff Member (Senior Product Architect)",
    "organization": "IBM",
    "photo": {
      "alt": null,
      "height": "512",
      "width": "512",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/divya_black.png"
    },
    "biography": "Divya K Konoor is a Senior Technical Staff Member (Senior Product Development Architect) in IBM Z Systems and leads Confidential Computing offerings like IBM Hyper Protect Crypto Services, Hyper Protect Virtual Service, Crypto Appliance and other Hyper Protect On-Prem and IBM Cloud Offerings. She has 21 years of experience in the IT industry with around 18 years in Cloud Technologies, Virtualization, Systems Management, Security and Confidential Computing. She is a passionate speaker and product evangelist with multiple blogs, technical articles, patents and IP Publications including in WeQuity Spotlight, IBM AoT , OpenStack Summit, ACM K, CDAC Cloud Auditing , IEEE CCEM speaker / technical papers, IEEE Wintechon technical committee member, GHC speaker/ reviewer, OpenStack India Days Speaker etc",
    "website": null
  },
  "12658": {
    "name": "Jonathan Perry",
    "title": "Founder, CEO",
    "organization": "PerfPod",
    "photo": {
      "alt": null,
      "height": "2405",
      "width": "1773",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Jonathan%20Perry%20-%20Portrait.jpg"
    },
    "biography": "Jonathan Perry is a maintainer of the OpenTelemetry eBPF network collector. His PhD research at MIT CSAIL focused on performance isolation in datacenter and cloud networks, aiming to enhance network efficiency and reduce latency. Jonathan founded Flowmill, where he developed eBPF-based network monitoring tools prior to the company's acquisition by Splunk. He is based in Austin, Texas.",
    "website": null
  },
  "12660": {
    "name": "Srirama Sharma",
    "title": "Chief Architect",
    "organization": "IBM India Private Ltd",
    "photo": {
      "alt": null,
      "height": "591",
      "width": "591",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/SriramaSharmaphoto.jpg"
    },
    "biography": "Srirama Sharma is a Senior Technical Staff Member (STSM) in IBM Z Systems and is Product Owner of IBM Cloud Infrastructure Center which provides Infrastructure management capability for Hybrid cloud deployments on IBM Z / LinuxONE. He is also the Chief Architect for IBM Cloud Paks on Z, leading cloud-native enablement of Enterprise software stack on IBM Z systems. He has 20+ years IT experience in various systems stack like device drivers, Desktop development contributing to various open source projects, Operating Systems, Virtualization, Hybrid Cloud and Systems Management. He has also worked with various Banking and FSS Industry clients and is an enthusiast of open source technologies.",
    "website": null
  },
  "12663": {
    "name": "Amby Nagarajan",
    "title": "Manager - Quality Assurance",
    "organization": "Lyric Health",
    "photo": {
      "alt": null,
      "height": "400",
      "width": "400",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Amby_400X400.jpg"
    },
    "biography": null,
    "website": null
  },
  "12664": {
    "name": "Jake Hillion",
    "title": "Software Engineer",
    "organization": "Meta",
    "photo": {
      "alt": null,
      "height": "400",
      "width": "400",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/5712856.jpg"
    },
    "biography": "Software Engineer @ Meta working on scheduling with sched_ext. Experience deploying novel userspace schedulers to production and building the features needed to outperform existing kernel schedulers, debugging application performance along the way. Previous experience working on debuggers and memory profiling, with a focus on writing high performance memory efficient C++.",
    "website": null
  },
  "12667": {
    "name": "james healy",
    "title": "data scientist",
    "organization": "crexi",
    "photo": null,
    "biography": null,
    "website": {
      "name": "linkedin",
      "url": "https://www.linkedin.com/in/james-healy-mirkovich"
    }
  },
  "12669": {
    "name": "Nithish Raghunandanan",
    "title": "Senior Developer Advocate",
    "organization": "Couchbase",
    "photo": {
      "alt": null,
      "height": "853",
      "width": "1280",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/image_1.png"
    },
    "biography": "Nithish Raghunandanan is an engineer who loves to build products that solve real world problems in short spans of time. He has experienced different areas of the industry having worked in diverse companies in Germany and India. Apart from work, he likes to travel and interact and engage with the tech community through Meetups & Hackathons. In his free time, he likes to try stuff out by hacking things together.",
    "website": {
      "name": "https://nithishr.com/",
      "url": "https://nithishr.com/"
    }
  },
  "12672": {
    "name": "Yannik Sander",
    "title": null,
    "organization": null,
    "photo": null,
    "biography": "Software Engineer, bored with the common.",
    "website": {
      "name": "Homepage",
      "url": "http://ysndr.de"
    }
  },
  "12676": {
    "name": "Manish Gill",
    "title": "Engineering Manager",
    "organization": "ClickHouse Inc",
    "photo": {
      "alt": null,
      "height": "524",
      "width": "514",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Screenshot%202024-11-02%20at%2000.59.09.png"
    },
    "biography": "Manish Gill works at ClickHouse Inc, where he is managing the AutoScaling team for ClickHouse Cloud. He is based out of Berlin and is deeply interested in Databases and Cloud challenges and runs  on the side.\n \n https://berlinsystems.xyz/",
    "website": {
      "name": "Website",
      "url": "https://parallelthoughts.xyz/"
    }
  },
  "12677": {
    "name": "Paul Mekhedjian",
    "title": "Linux Engineer",
    "organization": null,
    "photo": {
      "alt": null,
      "height": "300",
      "width": "330",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Paul-Mekhedjian.jpg"
    },
    "biography": "Paul is an SRE and HPC automation engineer by day and wears his physicist hat by night to solve physics and engineering problems on computing systems using FOSS software. Motivated by a passion to bridge gaps between science, engineering, and computing, Paul stands on the proverbial shoulders of giants to demonstrate that difficult, time-consuming calculations can be codified to scale out and return desired results in a timely manner, and enjoys sharing that learning process with others.",
    "website": {
      "name": "Paul Mekhedjian - Website",
      "url": "https://paulmekhedjian.com/"
    }
  },
  "12680": {
    "name": "Hazel Weakly",
    "title": "Fellow",
    "organization": "Nivenly Foundation",
    "photo": {
      "alt": null,
      "height": "2734",
      "width": "2736",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/headshot_22.jpg"
    },
    "biography": "Hazel spends her days working on building out teams of humans as well as the infrastructure, systems, automation, and tooling to make life better for others. She’s worked at a variety of companies, across a wide range of tech, and knows that the hardest problems to solve are the social ones. Hazel currently serves as a Director on the board of the Haskell Foundation, as a Fellow of the Nivenly Foundation, and is fondly known as the Infrastructure Witch of Hachyderm (a popular Mastodon instance). She also created the first official Haskell “setup” Github Action and helped turn it into an active community-maintained project. She enjoys speaking at conferences and podcasts, mentoring others, and sharing what she’s learned with the world. One of her favorite things is watching someone light up when they understand something for the first time, and a life goal of hers is to help as many people as possible experience that joy. She also loves shooting pool and going swing dancing.",
    "website": {
      "name": "Personal Website",
      "url": "https://hazelweakly.me"
    }
  },
  "12681": {
    "name": "Krista Burdine",
    "title": "Community Manager",
    "organization": "Rocky Linux",
    "photo": {
      "alt": null,
      "height": "800",
      "width": "800",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/krista_publicity_-profile-800x.jpg"
    },
    "biography": "As a storyteller turned editor turned technical writer turned community manager for the Rocky Linux project, Krista knows a thing or two about reinvention. Her greatest joy is found in empowering people to do and become more than they knew they could. Krista and her family live on an overgrown hobby farm in central Texas with 9 cats and their own family dinosaur—a Sulcata tortoise named Suhaila.",
    "website": {
      "name": "Krista Burdine",
      "url": "https://kristaburdine.com"
    }
  },
  "12685": {
    "name": "olaph wagoner",
    "title": "OpenStack System Administrator",
    "organization": "IBM",
    "photo": null,
    "biography": "olaph considers himself to be extremely lucky to have gotten involved with open source software, and more specifically the OpenStack project somewhere around the Essex release.  As a terrible developer, he is grateful for the fact that administrators and operators are still required!  olaph is always looking for an excuse to play putt-putt or pinball.",
    "website": null
  },
  "12686": {
    "name": "Joe Allen",
    "title": "Staff SRE",
    "organization": "Subsplash",
    "photo": {
      "alt": null,
      "height": "616",
      "width": "616",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/1599249032480.jpeg"
    },
    "biography": "Joe is a Staff Software Reliability Engineer at Subsplash focusing on Kubernetes infrastructure and pretty much everything else hidden behind the curtain that no one wants to talk about.",
    "website": null
  },
  "12690": {
    "name": "Brian Ragazzi",
    "title": null,
    "organization": null,
    "photo": null,
    "biography": "As Distributed Systems Lead at Kwaai, Brian focuses on building decentralized AI training and inference systems with an emphasis on privacy, security, and performance. Previously, he has held key roles at companies and systems integrators architecting cloud-native solutions, automation frameworks, and AI-driven platforms, including a provably accurate medical technology infrastructure. A passionate advocate for open-source technology, Brian co-founded the San Fernando Valley Linux User Group (SFVLUG), fostering a community of engineers, developers, and technology leaders.",
    "website": null
  },
  "12695": {
    "name": "Mark Hinkle",
    "title": "CEO",
    "organization": "Peripety Labs",
    "photo": {
      "alt": null,
      "height": "926",
      "width": "937",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/red_network_headshot.png"
    },
    "biography": "Mark Hinkle is an emerging technology executive and CEO of Peripety Labs, a digital consultancy that helps users be more successful with AI in their enterprise. With over 25 years of experience, he has expertise in the use of enterprise software, including artificial intelligence. Hinkle has held executive positions at Cloud.com, The Linux Foundation, and Citrix, and was the CEO and cofounder of TriggerMesh, a cloud integration company that was venture-backed by Cisco, Index, and Crane Ventures. Mark is also a sought after speaker on the enterprise adoption of artificial intelligence. He also writes a weekly newsletter, The Artificially Intelligent Enterprise, with in-depth practical information on using Generative AI for business applications. He’s also the founder and co-organizer of the RDU Artificial Intelligence Meetup group that has over 1,000 member in the Raleigh-Durham area.",
    "website": {
      "name": "The Artificially Intelligent Network",
      "url": "https://theaie.net"
    }
  },
  "12697": {
    "name": "Bassam Chahine",
    "title": "Principal Consultant",
    "organization": "NetApp Inc.",
    "photo": {
      "alt": null,
      "height": "448",
      "width": "600",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Bassam_Chahine_600x448-2.jpg"
    },
    "biography": "Bassam Chahine is a Principal Consultant at NetApp Instaclustr, which provides a managed platform around open source data technologies including Apache Cassandra, Apache Kafka and Apache Spark.  Bassam architects open source solutions for data analytics and AI",
    "website": null
  },
  "12698": {
    "name": "Matthew Sanabria",
    "title": "Software Engineer",
    "organization": "Oxide",
    "photo": {
      "alt": null,
      "height": "460",
      "width": "460",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/matthew-sanabria.jpg"
    },
    "biography": "Matthew is an engineering leader focused on building reliable, scalable, and observable systems. Matthew is known for using his breadth and depth of experience to add value in minimal context situations and help great people become great engineers through mentoring. In his spare time, Matthew spends time with his family, helps grow his wife's chocolate business, works on home improvement projects, and reads technical resources to learn and tinker.",
    "website": {
      "name": "Personal Website",
      "url": "https://matthewsanabria.dev"
    }
  },
  "12699": {
    "name": "Alexandre Renchon",
    "title": "Research Software Engineer, Associate",
    "organization": "Caltech",
    "photo": {
      "alt": null,
      "height": "1365",
      "width": "2048",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/profile_picture2.jpg"
    },
    "biography": null,
    "website": null
  },
  "12701": {
    "name": "Sean Marcia",
    "title": "Software Engineer",
    "organization": "GitHub",
    "photo": {
      "alt": null,
      "height": "1101",
      "width": "1101",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/sean.jpg"
    },
    "biography": "Sean Marcia, pronouns he, him, his, founded Ruby for Good in 2013 to fill the gap created by inaccessible and uneconomical technology solutions for nonprofits. He built an inclusive community of gooders—technologists determined to make the world a better place—who build open source, technology solutions for individuals and nonprofits serving vital missions. Sean is a passionate zymurgist, avid coffee roaster, enthusiastic writer of screenplays, and connoisseur of practical jokes.",
    "website": {
      "name": "Ruby for Good",
      "url": "http://rubyforgood.org"
    }
  },
  "12706": {
    "name": "Rebecca Dittmar",
    "title": "Software Engineer",
    "organization": "Nike",
    "photo": {
      "alt": null,
      "height": "1250",
      "width": "1250",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Me.JPG"
    },
    "biography": "Rebecca Dittmar is a Senior Software Engineer with 7+ years at Nike. She's skilled in full-stack development and cloud technologies. Her work has directly impacted billions of annual Nike customer interactions. Beyond tech, she's an EMBA and enjoys an active lifestyle.",
    "website": {
      "name": "LinkedIn",
      "url": "https://www.linkedin.com/in/rebecca-dittmar/"
    }
  },
  "12708": {
    "name": "Simon Strohmenger",
    "title": "Director",
    "organization": "Consul Democracy Foundation",
    "photo": {
      "alt": null,
      "height": "427",
      "width": "640",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Simon%20Demo.jpg"
    },
    "biography": "Simon is the Director of the CONSUL DEMOCRACY Foundation. A non-profit organisation whose mission is to reinforce the quality, neutrality and credibility of citizen participation worldwide in democratic processes embodying the principles of democracy, independence, open source and free software and knowledge, neutrality, transparency, rule of law and inclusion; as well as manage and contribute to the improvement, development and worldwide expansion of the open source free software CONSUL DEMOCRACY. The Foundation was founded in 2019 and has its official seat in the Netherlands.",
    "website": {
      "name": "https://consuldemocracy.org/",
      "url": "https://consuldemocracy.org/"
    }
  },
  "12715": {
    "name": "Marie Ramirez",
    "title": "College Student",
    "organization": "UC Berkeley",
    "photo": {
      "alt": null,
      "height": "3974",
      "width": "2880",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/marie_r.jpg"
    },
    "biography": "Second year student at UC Berkeley majoring in Applied Mathematics and Data Science. Marie has been interested in Cybersecurity for more than 6 years and competed in Cybersecurity competitions. She has taken an interdisciplinary approach to Cybersecurity by taking courses in Quantum Computing, Machine Learning/AI, Python programming, and writing. At Berkeley, she is involved in Machine Learning and Data Science committees and also mentors incoming students interested in Applied Mathematics.",
    "website": null
  },
  "12720": {
    "name": "Stacey Haysler",
    "title": "CFO and COO",
    "organization": "PGX, Inc.",
    "photo": {
      "alt": null,
      "height": "1460",
      "width": "1118",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/SSH%20Headshot%20Jan%202025.jpeg"
    },
    "biography": "By day, I'm the CFO and COO of PGX, Inc., a Postgres-only consultancy in Alameda, California. I'm also the President of the U.S. PostgreSQL Association (PgUS), a nonprofit dedicated to the advancement of PostgreSQL through education and advocacy. I'm an organizer of the San Francisco Bay Area PostgreSQL Users Group. At conferences in the US and Europe, you'll often find me at the registration desk. I'm also the creator of the original PostgreSQL Community Code of Conduct, and was the first Chair of the Community CoC Committee for three years. By night, I sleep, since that's a lot to do every day!",
    "website": {
      "name": "PGX, Inc.",
      "url": "https://pgexperts.com"
    }
  },
  "12724": {
    "name": "Isaac Smothers",
    "title": "Senior DevOps Engineer",
    "organization": "Crexi",
    "photo": null,
    "biography": null,
    "website": null
  },
  "12730": {
    "name": "Mohamed Elsakhawy",
    "title": "Researcher/Cloud Engineer",
    "organization": "PhD, Western University",
    "photo": {
      "alt": null,
      "height": "300",
      "width": "235",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/EADCFA76-8DE2-47B0-9F3A-AD7DE2E6BE98-e1654016352709-235x300.jpeg"
    },
    "biography": "Mohamed Elsakhawy received his B.Sc. in Electrical Engineering from Alexandria University, Egypt and his M.E.Sc. in Electrical and Computer Engineering and Ph.D. in Computer Science from the University of Western Ontario, Canada. He is an industry expert in Cloud computing with expertise in large-scale multi-site Clouds. He served as the Operational Lead of Compute Canada’s Cloud National Team between 2017 and 2021. In 2022, Dr. Elsakhawy joined the Cirrus Lab at the University of British Columbia, Canada as an Adjunct professor. His current engagements focus on the architecture and engineering of private on-prem Clouds. Dr. Elsakhawy is a frequent speaker at open-source conferences including StackConf, and OpenStack/OpenInfra summits.  He served as the Vice-Chair and Chair of the OpenStack user committee between 2019 and 2020. His research interests lie in the broad spectrum of Cloud Computing with a particular focus on data-driven intelligence for the Cloud.",
    "website": {
      "name": "Personal website",
      "url": "https://mohamede.com/"
    }
  },
  "12757": {
    "name": "Shaun Thomas",
    "title": "Senior Software Engineer",
    "organization": "pgEdge",
    "photo": {
      "alt": null,
      "height": "1500",
      "width": "1500",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/2024-02-15%2010.31.05-profile-pic.jpg"
    },
    "biography": "Shaun has spent decades working in the Postgres ecosystem, specializing in architecture and high availability. His \"PostgreSQL High Availability Cookbook\" serves as a treatise to the lessons he learned over that time. Perhaps you've read something from his PG Phriday blog series over the years? Currently he serves as a Postgres Architect at pgEdge, striving to help make Postgres the distributed cluster-aware platform he knows it can be!",
    "website": {
      "name": "BonesMoses.org",
      "url": "https://bonesmoses.org/"
    }
  },
  "12758": {
    "name": "Elizabeth Ponce",
    "title": "Software Engineer",
    "organization": "Airbnb",
    "photo": {
      "alt": null,
      "height": "1100",
      "width": "1054",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Screenshot%202024-11-19%20at%202.43.19%E2%80%AFPM.png"
    },
    "biography": "Elizabeth is a Software Engineer in Search Infrastructure at Airbnb and has a non traditional pathway from Customer Support Specialist to Software Engineering at Airbnb. Elizabeth actively contributes to fostering an inclusive and diverse tech community at Airbnb and beyond through mentorship and community building. Elizabeth's hobbies include thrifting, running, karaoke, computer projects with their husband, and ocean visits with family.",
    "website": {
      "name": "Elizabeth Ponce",
      "url": "https://www.eponce.dev/"
    }
  },
  "12760": {
    "name": "Sinan Kefeli",
    "title": "Sr. Data Scientist",
    "organization": null,
    "photo": {
      "alt": null,
      "height": "725",
      "width": "750",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Sinan_Kefeli_Headshot.jpg"
    },
    "biography": "Sinan Kefeli is an AI scientist with a focus on natural language processing (NLP), machine learning, and computer vision. At Verizon, he develops models to analyze customer call transcripts, improve customer interactions, and answer complex queries using large language models (LLMs). His work includes fine-tuning open source models like Mistral and Flan-T5, building graph databases, and creating tools for real-time information retrieval. Prior to Verizon, Sinan earned his PhD in Physics from Caltech, where he applied advanced machine learning techniques to large-scale scientific data pipelines. Sinan uses tools like Python, PyTorch, Neo4j, and Docker to build reliable and efficient AI systems. He focuses on practical solutions that are clear, measurable, and effective.",
    "website": null
  },
  "12761": {
    "name": "Julia Sloan",
    "title": "Research Software Engineer",
    "organization": "California Institute of Technology",
    "photo": {
      "alt": null,
      "height": "640",
      "width": "481",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/picofme.jpg"
    },
    "biography": "I'm a research software engineer passionate about developing cutting-edge technology to help alleviate real-world problems. I see climate change as one of the major issues threatening humans and life on Earth as a whole, and I want to use my technical skills to enact meaningful change in this area. At the same time, I strive to further develop my skills as a computer scientist, tackling interesting and exciting problems along the way.",
    "website": null
  },
  "12771": {
    "name": "Armstrong Foundjem",
    "title": "AI Researcher",
    "organization": "Polytechnique Montréal",
    "photo": {
      "alt": null,
      "height": "581",
      "width": "458",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/armstrong.png"
    },
    "biography": "Dr. Armstrong is a researcher at the intersection of software ecosystem sustainability, affective computing, the trustworthiness of safety-critical systems, and software engineering for machine learning applications, including foundational models, AIWare, and Agentware. He mines massive datasets, including software repositories, and applies socio-technical data science techniques to uncover patterns and empirically make informed decisions.",
    "website": {
      "name": "Personal ",
      "url": "https://foundjem.github.io/"
    }
  },
  "12780": {
    "name": "Gerald Bothello",
    "title": "Sr Directory Cloud Engineering ",
    "organization": "Walmart Global Technology",
    "photo": {
      "alt": null,
      "height": "2400",
      "width": "3600",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/2Y8C0358.jpg"
    },
    "biography": null,
    "website": null
  },
  "12781": {
    "name": "Jonathan Starr",
    "title": "Program Manager",
    "organization": "NumFOCUS",
    "photo": {
      "alt": null,
      "height": "2277",
      "width": "2277",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Headshot%20Square.jpg"
    },
    "biography": "Jonathan Starr stands at the intersection of open source and open science as the program manager of The Open Source Science Initiative out of NumFOCUS, where he drives work on The Map of Open Source Science. In his spare time, Jonathan runs a workshop facilitation 501c3, hosting global workshops connecting technicians, researchers, and the public while facilitating the development of numerous deep tech infrastructures enabling open science. He is also a core contributor and designer of one of the first distributed ledgers, successfully providing free exascale compute to dozens of scientific endeavors. Additionally, he consults on various projects designing novel publishing, identifier, and incentive mechanisms for the scientific process. Burlington based.",
    "website": null
  },
  "12782": {
    "name": "Sukesh Behera",
    "title": "Director, Software Engineering",
    "organization": null,
    "photo": null,
    "biography": null,
    "website": null
  },
  "12783": {
    "name": "Jimmy McCrory",
    "title": "Principal Engineer",
    "organization": "Walmart",
    "photo": null,
    "biography": null,
    "website": null
  },
  "12784": {
    "name": "Jing Hu",
    "title": "Software Engineer",
    "organization": "eBay",
    "photo": {
      "alt": null,
      "height": "1067",
      "width": "1067",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/pic.png"
    },
    "biography": "Software engineer building observability platform at eBay",
    "website": null
  },
  "12786": {
    "name": "Emily Lovell",
    "title": "Postdoctoral Fellow",
    "organization": "UC Santa Cruz OSPO",
    "photo": {
      "alt": null,
      "height": "2110",
      "width": "2110",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Kyoto%20Headshot.jpeg"
    },
    "biography": "Dr. Emily Lovell is an OSPO Incubator Fellow at UC Santa Cruz. Her research and teaching use novel domains to invite broader participation in computing, with her postdoctoral work focusing on newcomers to open source. Emily previously served on faculty at Berea College, where she developed and taught courses on open source contribution and computational craft. She has a S.M. in Media Arts & Sciences from the MIT Media Lab and a Ph.D. in Computer Science from UC Santa Cruz.",
    "website": {
      "name": "Homepage",
      "url": "https://users.soe.ucsc.edu/~emme/"
    }
  },
  "12788": {
    "name": "Jimmy McArthur",
    "title": "Director of Business Development",
    "organization": "OpenInfra Foundation",
    "photo": {
      "alt": null,
      "height": "1735",
      "width": "2600",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/headshot-summit.jpeg"
    },
    "biography": "Jimmy leads the collaboration with OpenInfra Members, including strategy development, goal alignment and new member recruitment. Outside of advocating for current open source trends and distributing his calendar link (which you can find here: ), he enjoys cooking, traveling, and having the best award winning chili in Texas.\n \n https://calendly.com/jimmy-mcarthur",
    "website": null
  },
  "12795": {
    "name": "Allison Price",
    "title": "VP Marketing & Community",
    "organization": "OpenInfra Foundation",
    "photo": {
      "alt": null,
      "height": "1735",
      "width": "2600",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/AllisonPrice_2023.jpg"
    },
    "biography": "Allison is the VP of Marketing & Community at the OpenInfra Foundation (previously the OpenStack Foundation). Her mission is to continue the storytelling of the global community by building relationships with the developers, operators and ecosystem around global open source communities. In her free time, she likes to listen to Celine Dion, rank local margaritas, and travel.",
    "website": null
  },
  "12803": {
    "name": "Todd Robinson",
    "title": "President",
    "organization": "OpenMetal, Inc.",
    "photo": {
      "alt": null,
      "height": "266",
      "width": "266",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/todd.png"
    },
    "biography": "In 2001, Todd and his co-founder Sunil Saxena brought InMotion Hosting online from a data center in Los Angeles. Today, InMotion and a suite of subsidiary brands handle 100,000+ customers with the help of 300+ team members from around the world. As an open source advocate and ambassador for ongoing usage of OpenStack, Ceph and other key open technologies, Todd once again saw a challenge he wanted to resolve. He wanted to break down the complexity of accessing OpenStack and make it very simple for organizations and individuals of all sizes to use, helping to expand the open source community. His solution…OpenMetal. Today, Todd Robinson is the President of OpenMetal, where he sets the strategic vision of the company, drives the product development of OpenMetal cloud services, and focuses on ensuring explosive growth.",
    "website": {
      "name": "On-Demand Private Cloud Provider",
      "url": "https://openmetal.io/"
    }
  },
  "12805": {
    "name": "Peng Wang",
    "title": "Global Technical Evangelist",
    "organization": "OceanBase",
    "photo": {
      "alt": null,
      "height": "4470",
      "width": "4470",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/IMG_2948.JPG"
    },
    "biography": "I am working for OceanBase as the Global Technical Evangelist.",
    "website": null
  },
  "12810": {
    "name": "Ashley Rodriguez",
    "title": "Software Engineer",
    "organization": "Red Hat",
    "photo": null,
    "biography": null,
    "website": null
  },
  "12811": {
    "name": "Rob Fletcher",
    "title": "Co-Founder, COO",
    "organization": "DevZero",
    "photo": {
      "alt": null,
      "height": "400",
      "width": "400",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/QftlCWzY_400x400.jpg"
    },
    "biography": "Rob Fletcher is the Co-Founder and Chief Operating Officer of DevZero, a Seattle-based startup specializing in cloud-based development platforms that enable developers to write and test code in production-like environments. Before founding DevZero in 2021, Rob held significant roles in security engineering at major tech companies. He served as Head of Product Security at Uber, leading a team of over 45 security engineers, engineering managers, and product managers. Following his tenure at Uber, he became a Security Engineering Manager at Meta (formerly Facebook).",
    "website": {
      "name": "DevZero",
      "url": "https://www.devzero.io/"
    }
  },
  "12812": {
    "name": "Cynthia Lo",
    "title": null,
    "organization": null,
    "photo": null,
    "biography": null,
    "website": null
  },
  "12841": {
    "name": "Rajan Patel",
    "title": "Product Manager",
    "organization": "Canonical",
    "photo": {
      "alt": null,
      "height": "1250",
      "width": "1250",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/rajan-headshot-cropped-2mb.jpg"
    },
    "biography": "Rajan Patel is the Product Manager of Livepatch and Landscape, and focuses on systems management and security at scale. In his spare time, Rajan explores the intersection of performance optimisation and cost optimisation for public, private, hybrid, and multi cloud workloads.",
    "website": {
      "name": "Ubuntu",
      "url": "https://ubuntu.com"
    }
  },
  "12842": {
    "name": "Leslie Lamport",
    "title": "Father of Distributed Systems",
    "organization": null,
    "photo": {
      "alt": null,
      "height": "500",
      "width": "393",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Leslie_Lamport.jpg"
    },
    "biography": "Leslie B. Lamport is an American computer scientist and mathematician. Lamport is best known for his seminal work in distributed systems, and as the initial developer of the document preparation system LaTeX and the author of its first manual. Lamport worked as a computer scientist at Massachusetts Computer Associates from 1970 to 1977, Stanford Research Institute (SRI International) from 1977 to 1985, and Digital Equipment Corporation and Compaq from 1985 to 2001. In 2001 he joined Microsoft Research in California, and he retired in January 2025. Lamport was the winner of the 2013 Turing Award for imposing clear, well-defined coherence on the seemingly chaotic behavior of distributed computing systems, in which several autonomous computers communicate with each other by passing messages. He devised important algorithms and developed formal modelling and verification protocols that improve the quality of real distributed systems.",
    "website": null
  },
  "12843": {
    "name": "Longda Feng",
    "title": "Senior Director",
    "organization": "OceanBase",
    "photo": {
      "alt": null,
      "height": "1995",
      "width": "2994",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/2a3f9427612388226d58a405629b4b50.jpg"
    },
    "biography": "Longda Feng, the Senior Director of OceanBase R&D at Ant Group, manages open-source projects and developer relations at OceanBase. As an Apache Storm PMC member/Apache RocketMQ Committer/founder of Alibaba JStorm, he dedicates to build up open-source projects and vibrant developer community and ecosystem. With decade's experience in distributed computing and storage, and Linux kernel development, he enjoys evangelizing cutting-edge technologies, especially those related to open source.",
    "website": {
      "name": "Senior Director",
      "url": "http://en.oceanbase.com"
    }
  },
  "12845": {
    "name": "Miona Aleksic",
    "title": "Product Manager",
    "organization": "Canonical",
    "photo": {
      "alt": null,
      "height": "675",
      "width": "675",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/miona%20photo%20%28copy%29.jpg"
    },
    "biography": "Product Manager for MicroCloud and LXD at Canonical. Her mission is to build a next-generation private cloud infrastructure that ‘just works’. Prior to Canonical, she spent years in telecommunications, leading modernization initiatives in OSS, infrastructure and data centre domains. She has an M.Sc. in Technology Management from Seoul National University.",
    "website": null
  },
  "12849": {
    "name": "Monica Waggoner",
    "title": "Service Planning Manager",
    "organization": "LA Metro",
    "photo": {
      "alt": null,
      "height": "926",
      "width": "877",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/MWaggoner%20Headshot_crop.jpg"
    },
    "biography": "My dream is a Los Angeles where universal basic mobility is realized by a seamless network that eliminates barriers to meeting needs and pursuing desires. I became interested in Transportation after returning to Los Angeles following six months living in Birmingham, UK. I traveled all over Europe with no car, but had trouble traveling a few miles in Los Angeles. When I found out my IT job was being eliminated, I returned to UCLA for a Master's in Transportation Planning. After a decade in non-profit health and human services, I now work as a regional service planner, fine-tuning bus and microtransit service to meet the needs of transit-dependent Angelenos, while working towards a world-class transportation system that is a first choice, not just something for people without choices.",
    "website": null
  },
  "12850": {
    "name": "Kevin Wang",
    "title": "Founder",
    "organization": "Mentors in Tech",
    "photo": {
      "alt": null,
      "height": "800",
      "width": "800",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Kevin%20Wang%20Headshot%20Square.jpg"
    },
    "biography": "Kevin Wang is the founder of Mentors in Tech (MinT), a program that helps overlooked tech students at smaller, less well known, accessible and affordable colleges navigate and launch their careers through structured industry mentorships, integrated open-source capstone projects, and tailored recruitment.\nMinT’s work has been recognized as one of the 20 Promising Practices to Advance Quality, Equity, and Success in Community College Baccalaureate Degree Programs by the Community College Baccalaureate Association. MinT has also been featured on the Clayton Christensen Institute blog as well as Microsoft Alumni News. MinT is the recipient of the 2023 GeekWire Geeks Give Back Award and MinT’s work with partner community colleges was published at 2024 ACM SIGCSE.\nPrior to MinT, Kevin founded the Microsoft TEALS Program that has helped over 1,000 high schools in the US, Canada, and Mexico build diverse, equitable, inclusive, and sustainable CS and AP CS programs.",
    "website": {
      "name": "Mentors in Tech",
      "url": "https://mentorsintech.com/"
    }
  },
  "12860": {
    "name": "Alastair Flynn",
    "title": "Software Engineer",
    "organization": "Canonical",
    "photo": {
      "alt": null,
      "height": "1600",
      "width": "1200",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Alastair%20Flynn.jpeg"
    },
    "biography": "Alastair is an enthusiastic techie with a penchant for doing things the hard way and diving into the guts of a problem. As an engineer at Canonical he works on the open source cloud orchestration engine Juju, written in the Go programming language. He has a passion for open source software and its positive social impact on the world. When not immersed in the depths of a terminal, tinkering with his home server, Alastair can be found exploring the outdoors, running or playing the piano up in Edinburgh, Scotland.",
    "website": {
      "name": "Canonical",
      "url": "http://canonical.com"
    }
  },
  "12862": {
    "name": "Peter Farkas",
    "title": "Co-Founder & CEO",
    "organization": "FerretDB Inc.",
    "photo": {
      "alt": null,
      "height": "500",
      "width": "500",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/peterfarkas-1.png"
    },
    "biography": "Peter has been building sustainable open-source projects and businesses for the last 12 years. He currently serves as the Co-Founder and CEO of FerretDB, the truly Open Source MongoDB Alternative, which helps users to use MongoDB drivers seamlessly with PostgreSQL as the database backend. Peter believes that open source is as sustainable in terms of product and revenue growth as proprietary solutions, and more and more entrepreneurs will work on open source projects.",
    "website": null
  },
  "12863": {
    "name": "Solomon Hykes",
    "title": "Co-Founder",
    "organization": "Dagger",
    "photo": {
      "alt": null,
      "height": "660",
      "width": "768",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Solomon%20Headshot%20%281%29.jpeg"
    },
    "biography": "Solomon Hykes is the co-founder and CEO of Dagger.io, the first programmable CI/CD engine. Before that, he was the co-founder of Docker, where he served for 10 years as CEO then CTO, and a founding member of the CNCF Technical Oversight Committee. Solomon grew up in France, and now lives in San Francisco.",
    "website": {
      "name": "http://www.dagger.io",
      "url": "http://www.dagger.io"
    }
  },
  "12872": {
    "name": "Chach Sikes",
    "title": "Senior Engineer",
    "organization": "CA Office of Data and Innovation",
    "photo": {
      "alt": null,
      "height": "784",
      "width": "526",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Screenshot%202025-01-17%20at%206.12.13%E2%80%AFPM.png"
    },
    "biography": "Chach Sikes is a Senior Engineer with the CA Office of Data and Innovation.",
    "website": {
      "name": "CA Office of Data and Innovation",
      "url": "https://innovation.ca.gov"
    }
  },
  "12883": {
    "name": "Corey Leong",
    "title": "Professor Cloud Computing",
    "organization": "Valencia College",
    "photo": {
      "alt": null,
      "height": "441",
      "width": "441",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/cleong_g_pix_441x441.jpg"
    },
    "biography": "Dr. Corey Leong is a professor at Valencia College. He teaches cloud computing courses, in addition to, overseeing cloud mentorships and cloud internships. Before entering higher education, he worked for 25 years in the IT industry with organizations such as Oracle, Google, and IBM. He lives in Orlando, Florida and enjoys reading, running, and attending Orlando Magic basketball games.",
    "website": {
      "name": "valenciacollege",
      "url": "https://valenciacollege.edu"
    }
  },
  "12888": {
    "name": "Robby Stahl",
    "title": "Head of Strategic Customer Engineering",
    "organization": "Platform9",
    "photo": {
      "alt": null,
      "height": "300",
      "width": "300",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/IMG_9818%20%281%29.jpg"
    },
    "biography": null,
    "website": null
  },
  "12891": {
    "name": "Kelsey Hightower",
    "title": null,
    "organization": null,
    "photo": {
      "alt": null,
      "height": "400",
      "width": "400",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/kelsey.jpg"
    },
    "biography": null,
    "website": null
  },
  "12896": {
    "name": "Noah Chelliah",
    "title": null,
    "organization": "Altispeed Technologies",
    "photo": {
      "alt": null,
      "height": "1024",
      "width": "1024",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/noah.jpg"
    },
    "biography": "Noah Chelliah was born and raised in Grand Forks ND. While attending the University of North Dakota in 2009 he founded Altispeed Technologies. Altispeed is an IT company dedicated to helping people leverage their technology to it’s full potential using open source principals.\n \n \n \n \n Noah launched the Ask Noah Show in 2017, a weekly talk radio show. The goal was to create a path to serve the open source community by answering questions on system administration, IT business operations, and using Linux as the operating system for your “daily driver”. Today the Ask Noah Show has been downloaded over 6.7 million times in 7 countries. Each week Noah and his co-host answer questions and bring you weekly updates from geeks eating their own dog food. In his free time Noah enjoys spending time with his wife, playing with his kids, water skiing, cryptocurrency, and shooting firearms.",
    "website": null
  },
  "12897": {
    "name": "Tristan Ross",
    "title": "LLVM team member",
    "organization": null,
    "photo": {
      "alt": null,
      "height": "400",
      "width": "400",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/tristan.png"
    },
    "biography": "Low level programmer, OS/Zig/Linux dev, Nixpkgs & LLVM committer. Likes to watch 大空スバル (Subaru Oozora).",
    "website": {
      "name": "Tristan Ross",
      "url": "https://tristanxr.com/"
    }
  },
  "12898": {
    "name": "Aneesh Agrawal",
    "title": "Member of Technical Staff",
    "organization": "Antrhopic",
    "photo": {
      "alt": null,
      "height": "400",
      "width": "400",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Aneesh.jpg"
    },
    "biography": "Software engineer with a passion for Developer Experience, currently at Anthropic. Proud Nix user since college, now using it at work!",
    "website": null
  },
  "12899": {
    "name": "Nick Johnstone",
    "title": "Senior Software Developer",
    "organization": null,
    "photo": {
      "alt": null,
      "height": "400",
      "width": "400",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/nick.jpg"
    },
    "biography": "I'm a software developer from New Zealand, with over a decade of experience. I have a particular affection for functional programming, and have been an avid Nix user since 2017. In my spare time I enjoy photography, baking, video games and music.",
    "website": null
  },
  "12900": {
    "name": "Adis Bladis",
    "title": "Freelance Nix Developer",
    "organization": null,
    "photo": {
      "alt": null,
      "height": "400",
      "width": "400",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/adis.png"
    },
    "biography": "Adisbladis is a Nix consultant & nixpkgs committer, where he mostly enjoys working on lower level plumbing such as lib & stdenv, but also maintains Emacs & it's package ecosystem. Python developer in a previous life. He is the author of previous Python packaging efforts like poetry2nix.",
    "website": null
  },
  "12901": {
    "name": "Jacek Galowicz",
    "title": "Nixcademy Founder",
    "organization": "Nixcademy",
    "photo": {
      "alt": null,
      "height": "400",
      "width": "400",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/jacek.jpg"
    },
    "biography": "Long-time Nix user, maintainer of the NixOS integration test driver, C++ book author, Founder of the Nixcademy",
    "website": {
      "name": "Nixcademy Corporate Nix(OS) Trainings",
      "url": "https://nixcademy.com"
    }
  },
  "12902": {
    "name": "Tim Golden",
    "title": "Tinkerer and Technologist",
    "organization": null,
    "photo": {
      "alt": null,
      "height": "400",
      "width": "400",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/tim.jpg"
    },
    "biography": "Tim has over 10 years of experience in quality assurance across environmental and industrial domains, including critical infrastructure testing. This background drives his passion for software systems and technologies like Nix and Linux. Currently pursuing an MSCS at Georgia Tech, Tim brings a cross-disciplinary approach to problem-solving. Passionate about open source, he also serves on a Search and Rescue team and enjoys all forms of mountain recreation.",
    "website": null
  },
  "12903": {
    "name": "Kenji Berthold",
    "title": "NixOS contributor",
    "organization": null,
    "photo": {
      "alt": null,
      "height": "400",
      "width": "400",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/kenji.png"
    },
    "biography": null,
    "website": null
  },
  "12904": {
    "name": "Lassulus .",
    "title": "NixOS Contributor",
    "organization": null,
    "photo": {
      "alt": null,
      "height": "400",
      "width": "400",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/dog.jpg"
    },
    "biography": "I discovered NixOS while looking for fleet management systems 10 years ago and contribute since then.",
    "website": null
  },
  "12905": {
    "name": "Rickard Nilsson",
    "title": "Founder",
    "organization": "nixbuild.net",
    "photo": {
      "alt": null,
      "height": "400",
      "width": "400",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/rick.jpg"
    },
    "biography": "Rickard Nilsson has worked as a freelancing Nix/NixOS expert for over a decade. Five years ago he founded nixbuild.net, which is an advanced scalable build cluster for Nix offered both as a cloud service and for enterprise deployment.",
    "website": null
  },
  "12906": {
    "name": "Victor Fuentes",
    "title": "Platform Engineer",
    "organization": "Replit",
    "photo": {
      "alt": null,
      "height": "1629",
      "width": "1628",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/PXL_20220306_200307486%20%281%29.jpg"
    },
    "biography": "Currently I'm a platform engineer at Replit. I've been using Nix since 2021. In my free time, enjoy working on tooling to make NixOS easier to use.",
    "website": null
  },
  "12907": {
    "name": "Eelco Dolstra",
    "title": "Determinate Systems",
    "organization": "Determinate Systems",
    "photo": null,
    "biography": "Eelco started the Nix project when he was a PhD student at Utrecht University. He is a co-founder at Determinate Systems.",
    "website": null
  },
  "12908": {
    "name": "John Ericson",
    "title": "Software Engineer",
    "organization": "Obsidian Systems",
    "photo": {
      "alt": null,
      "height": "400",
      "width": "400",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/john.jpg"
    },
    "biography": "I've been working the ingredients leading to this moment for years, and so it is very exciting to finally see a first end-to-end demonstration of all the pieces working together! Nix Steering Committee member since 2024 Nix Team member since 2023 Software Engineer at Obsidian Systems since 2017, Nix user since 2014.",
    "website": null
  },
  "12909": {
    "name": "Connor Baker",
    "title": "Nix Engineer and Nix CUDA Maintainer",
    "organization": null,
    "photo": {
      "alt": null,
      "height": "400",
      "width": "400",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/dd54-400o400o1-nZgiy4fZU8jdLRjoWDaWG1.jpg"
    },
    "biography": "Interested in formal methods, Haskell, Lean, type & category theory, and computational photography!",
    "website": null
  },
  "12910": {
    "name": "Morgan Jones",
    "title": "Embedded security engineer",
    "organization": "Viasat",
    "photo": {
      "alt": null,
      "height": "400",
      "width": "400",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/a0de-400o400o1-DNv6vHzCBgiCD2CTvJ6Hp2.jpg"
    },
    "biography": "Hobbyist programmer who became an embedded and mobile security engineer for Viasat, and later a member of SNUG. Works on mobile devices for a day job, and may have read Ken Thompson's Reflections on Trusting Trust one too many times.",
    "website": null
  },
  "12911": {
    "name": "Matteo Fusi",
    "title": "Software Engineer",
    "organization": "Arm",
    "photo": {
      "alt": null,
      "height": "400",
      "width": "400",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/2158-400o400o1-RNa7obZEDjMubij9c6ZZHs.png"
    },
    "biography": "I work at Arm as a Software Engineer in Austin, TX. I have started working with Nix while searching for the holy grail of reproducible environments.",
    "website": null
  },
  "12912": {
    "name": "Mike Kelly",
    "title": "CTO",
    "organization": "MemberVault",
    "photo": {
      "alt": null,
      "height": "400",
      "width": "400",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/046c-400o400o1-b5918133-fb8b-4574-96ca-6f3382319fc1.jpg"
    },
    "biography": "Mike Kelly is the CTO, Developer and Co-Founder of a SaaS company called MemberVault. He is not only a big Linux fan for personal uses, but uses Linux exclusively to develop and host the platform. Mike is based in Olympia, WA where him and his wife run MemberVault, while raising 3 kids and a golden doodle.",
    "website": null
  },
  "12922": {
    "name": "Ken Crandall",
    "title": "Sr. Strategic Product Manager, OpenStack and Kubernetes",
    "organization": "Rackspace Technology",
    "photo": {
      "alt": null,
      "height": "2300",
      "width": "2259",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Ken%20Crandall%20Headshot.jpeg"
    },
    "biography": "Ken Crandall runs Strategic Product Management for OpenStack and Kubernetes at Rackspace. His primary focus and passion at Rackspace is working with industry leading companies to help modernize IT infrastructure and practices. Ken has over 20 years of experience in product, IT managment, and in solution architecture. Ken has built his career around open source technologies and has contributed to many of the best practices that companies use today.",
    "website": null
  },
  "12926": {
    "name": "Jose Blanquicet",
    "title": "Senior Software Engineer",
    "organization": "Microsoft",
    "photo": {
      "alt": null,
      "height": "2041",
      "width": "1663",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/JOSE_FERNANDO_BLANQUICET_MELENDEZ.jpg"
    },
    "biography": "Jose is a Senior Software Engineer at Microsoft, where he focuses on Kubernetes and eBPF technologies. He joined the Inspektor Gadget project in its early stages and is now one of its maintainers. Jose has also been actively evangelizing the benefits of eBPF for observability and system inspection at conferences around the world.",
    "website": null
  },
  "12928": {
    "name": "Mark Collier",
    "title": "Chief Operating Officer",
    "organization": "OpenInfra Foundation",
    "photo": {
      "alt": null,
      "height": "800",
      "width": "800",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/1688839139548.jpeg"
    },
    "biography": "Mark Collier is a co-founder of the OpenStack project and the Chief Operating Officer at the Open Infrastructure Foundation. A committed advocate for open-source principles, Mark has played a key role in the development and global success of OpenStack, establishing it as a leading cloud computing platform and one of the most active open source projects to ever exist. Recently, he has also been involved in defining “open source AI,” contributing to the industry’s efforts to create clear standards and guidelines. With a background in building multi billion dollar open source ecosystems, Mark is a respected voice in the technology community, sharing his insights at industry events and through various media channels.",
    "website": null
  },
  "12929": {
    "name": "Jonathan Bryce",
    "title": "Executive Director",
    "organization": "OpenInfra Foundation",
    "photo": {
      "alt": null,
      "height": "4032",
      "width": "3024",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/JonathanBryce-Headshot.JPG"
    },
    "biography": "Jonathan Bryce, who has spent his career building the cloud, is Executive Director of the Open Infrastructure Foundation. Previously he was a founder of The Rackspace Cloud. He started his career working as a web developer for Rackspace, and during his tenure, he and co-worker Todd Morey had a vision to build a sophisticated web hosting environment where users and businesses alike could turn to design, develop and deploy their ideal web site – all without being responsible for procuring the technology, installing it or making sure it is built to be always available. This vision became The Rackspace Cloud. Since then he has been a major driver of OpenStack, the open source cloud software initiative.",
    "website": null
  },
  "12937": {
    "name": "Paul Shen",
    "title": "Software Engineer",
    "organization": "Dropbox",
    "photo": {
      "alt": null,
      "height": "2400",
      "width": "2400",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/2021-self-portrait-square.jpg"
    },
    "biography": "Paul works at Dropbox improving the logging, tracing, profiling, and error monitoring tools. More recent work includes deploying Grafana Tempo. In his free time, he's focused on using computers more ergonomically by shifting his computer usage to the terminal and his own AI chat TUI, XR display glasses, and voice transcription.",
    "website": null
  },
  "12938": {
    "name": "Sagy Volkov",
    "title": "Distinguished Technology Evangelist ",
    "organization": "Lightbits Labs",
    "photo": {
      "alt": null,
      "height": "2448",
      "width": "3264",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/PXL_20200918_182419155.jpg"
    },
    "biography": "Sagy Volkov is the former Performance Architect of the OpensShift Container Storage (OCS, now ODF) in red hat. Prior to that he ran the performance engineering group and the enterprise advocates group at ScaleIO (Now Dell PowerFlex) and also architected the ScaleIO storage appliance. Before that he was part of Greenplum's performance group and one of the architects of the DCAv2. He is now with Lightbits Labs as a distinguished performance architect concentrating on NVMe/TCP performance and application performance using NVMe/TCP. Sagy has spoken previously in KubeCon, DoK, CNS, DevConf, EMC World and Red Hat summit.",
    "website": null
  },
  "12939": {
    "name": "Daniel Hodges",
    "title": "Software Engineer",
    "organization": "Meta",
    "photo": null,
    "biography": null,
    "website": null
  },
  "12942": {
    "name": "Nolan Bushnell",
    "title": null,
    "organization": null,
    "photo": {
      "alt": null,
      "height": "904",
      "width": "1298",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/nolan%20copy.png"
    },
    "biography": "Nolan Bushnell is a pioneering engineer and entrepreneur, best known as the founder of Atari, Inc. and the creator of Chuck E. Cheese's. In 1972, he co-founded Atari, revolutionizing the video game industry with the release of Pong, one of the first commercially successful arcade games. In 1977, Bushnell established Chuck E. Cheese’s Pizza Time Theatre, merging dining with arcade entertainment, which became a nationwide family destination. Over his career, he has founded more than 20 companies, including Catalyst Technologies, one of the first business incubators, and Brainrush, an educational software company leveraging game-based learning. A recognized industry visionary, Bushnell has been inducted into both the Video Game Hall of Fame and the Consumer Electronics Association Hall of Fame. He is also known for Bushnell’s Law, which states that great games should be \"easy to learn and difficult to master.\"",
    "website": null
  },
  "12943": {
    "name": "Fay Arjomandi",
    "title": "CEO",
    "organization": "mimik",
    "photo": {
      "alt": null,
      "height": "300",
      "width": "300",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/faye.png"
    },
    "biography": "Fay Arjomandi is the Founder, CEO, and Board Member of mimik, a pioneering hybrid edge cloud company. She previously served as CEO of NantMobile and Vodafone xone, leading digital health, AI, and innovation initiatives. A serial entrepreneur, she co-founded three technology startups, including Mobidia and mimik. Fay holds multiple patents in telecommunications, edge computing, and mobile networks. Recognized as a Top 20 Canadian Tech Titan (2022) and Edge Woman of the Year (2020), she is a Forbes Technology Council member and advises startups and enterprises on digital transformation. A sought-after global speaker, she is passionate about digital equity and decentralized cloud technology. Fay holds a B.A.Sc. in Electrical Engineering from Concordia University and has worked across North America, Europe, and the Middle East.",
    "website": null
  },
  "12944": {
    "name": "Liam Broza",
    "title": null,
    "organization": null,
    "photo": {
      "alt": null,
      "height": "386",
      "width": "471",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Screenshot%202025-02-11%20at%2012.39.28%E2%80%AFAM.png"
    },
    "biography": "Liam Broza is an engineer and multi exit founder in AI and XR. Notable projects include Ethereal Engine, BitScoop Labs, LifeScope and Laguna Labs. Companion Intelligence originated from project LifeScope in 2015 with the goal of building an open platform for anyone to personal digital memory database. In 2019, the LifeScope Time Machine was released to give anyone access to global travel into their history through AR and VR. In 2020 Laguna Labs founded Ethereal Engine with a core community of WebXR engineers building the most powerful 3D web engine. After exiting Ethereal Engine to Infinite Reality in 2024. Liam restarted the dream of Companion Intelligence and is now offering CI Private Servers allowing individuals and businesses to use personal private agents with confidence, trust, and control.",
    "website": {
      "name": "https://liambroza.com/",
      "url": "https://liambroza.com/"
    }
  },
  "12945": {
    "name": "Sam Johnston",
    "title": null,
    "organization": null,
    "photo": {
      "alt": null,
      "height": "400",
      "width": "400",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/sam.png"
    },
    "biography": "Sam Johnston is an Australian technology executive and serial entrepreneur with over 20 years of experience founding and advising startups, as well as holding leadership roles at companies like Google, Equinix, Citrix, and DXC Technology. His work spans emerging technologies, including artificial intelligence, drones, robotics, 3D printing, computer vision, augmented reality, blockchain, and quantum computing. As the Convenor of the Open Source Alliance, an AI Convergence challenge of the AI Action Summit, Sam champions global governance in Open Source AI. He serves as CEO of Acumino, a Singapore venture studio, and as a Board Member at Kwaai Open Source AI Lab, where he leads the development of the Personal Artificial Intelligence Operating System (pAI-OS), empowering individuals to use AI while retaining control over their personal data.",
    "website": {
      "name": "https://samjohnston.org/",
      "url": "https://samjohnston.org/"
    }
  },
  "12947": {
    "name": "Luke Repko",
    "title": "Site Reliability Engineer III",
    "organization": "Rackspace Technology",
    "photo": {
      "alt": null,
      "height": "2045",
      "width": "2104",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/headshot_1_0.jpg"
    },
    "biography": "Luke Repko is a passionate engineer with a lifelong curiosity for deconstructing complex systems and understanding how they work. Starting his journey as a customer of Rackspace and an end user of the Nova project, Luke has spent the last decade diving deep into OpenStack and its infrastructure. Now a seasoned Racker, he brings a wealth of hands-on expertise in cloud technologies and their evolution. Luke’s top 5 Clifton Strengths — Achiever, Analytical, Communication, Learner, and Responsibility — perfectly reflect his approach to both technology and teamwork. He thrives on solving problems, sharing insights, and empowering others to learn and grow.",
    "website": {
      "name": "Rackspace Technology",
      "url": "https://www.rackspace.com"
    }
  },
  "12949": {
    "name": "Chris Breu",
    "title": "Senior Cloud Architect",
    "organization": "Rackspace Technologies",
    "photo": {
      "alt": null,
      "height": "2129",
      "width": "1597",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Image.jpeg"
    },
    "biography": "Chris Breu",
    "website": null
  },
  "12975": {
    "name": "Julian Pistorius",
    "title": "Research Software Developer",
    "organization": "Indiana University",
    "photo": {
      "alt": null,
      "height": "1600",
      "width": "1200",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/julian_pistorius_cropped.jpg"
    },
    "biography": "Cloud-native software engineer and research software expert. Building reliable, scalable solutions for academia and beyond. Co-founder of the Exosphere Project. Working on Indiana University's OpenStack research cloud, as well as supporting Jetstream2 - the NSF-sponsored, national research cloud.",
    "website": {
      "name": "GitHub",
      "url": "https://github.com/julianpistorius"
    }
  }
}