{
  "62": {
    "name": "Kyle Rankin",
    "title": "President",
    "organization": "Purism, SPC",
    "photo": {
      "alt": null,
      "height": "500",
      "width": "500",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/headshot4.png"
    },
    "biography": "Kyle Rankin is President of Purism; the author of Linux Hardening in Hostile Networks, DevOps Troubleshooting, The Official Ubuntu Server Book, and Knoppix Hacks, among other books. Rankin was an award-winning columnist and tech editor for Linux Journal, and speaks frequently on Open Source software including at SCALE, FOSDEM, O'Reilly Security Conference, Linux Fest NorthWest, BSidesLV, CactusCon, OSCON, Linux World Expo, and Penguicon.",
    "website": {
      "name": "My Personal Site",
      "url": "https://kylerank.in"
    }
  },
  "259": {
    "name": "Dave Stokes",
    "title": "Technology Evangelist",
    "organization": "Percona",
    "photo": {
      "alt": null,
      "height": "2016",
      "width": "1134",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/davestokes1.jpg"
    },
    "biography": "Dave Stokes is a technology evangelist for Percona Corporation.  He has worked at companies ranging alphabetically from the American Heart Association to Xerox, has three college degrees, enjoys riding his Honda Goldwing motorcycle, lives in North Texas, and started with UNIX in the Version 7 days.  He is the author of MySQL & JSON - A Practical Programming Guide, which is available at Amazon.com",
    "website": {
      "name": "Percona",
      "url": "https://percona.com"
    }
  },
  "357": {
    "name": "Bradley Kuhn",
    "title": "Policy Fellow and Hacker-in-Residence",
    "organization": "Software Freedom Conservancy",
    "photo": {
      "alt": null,
      "height": "800",
      "width": "800",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/bkuhn-photo-2017.jpg"
    },
    "biography": "is the Policy Fellow and Hacker-in-Residence at  and editor-in-chief of . While working as a system administrator and software developer in the 1990s, Kuhn was an early adopter of Linux-based systems and contributor to Perl. As FSF's Executive Director from 2001–2005, Kuhn led FSF's GPL enforcement and invented the Affero GPL. Kuhn began as Conservancy's primary volunteer from 2006–2010, and became its first staff person in 2011. Kuhn holds a summa cum laude B.S.in Computer Science from Loyola University in Maryland, and an M.S. in Computer Science from the University of Cincinnati. Kuhn co-hosts the audcast, . Kuhn received the two primary awards given for work in FOSS: the Open Source Award (2012), and the Award for the Advancement of Free Software (2020).\n \n \n \n \n Bradley M. Kuhn Software Freedom Conservancy copyleft.org \n \n Free as in Freedom",
    "website": {
      "name": "Software Freedom Conservancy",
      "url": "https://sfconservancy.org/"
    }
  },
  "380": {
    "name": "John Willis",
    "title": "Distinguished Researcher",
    "organization": "Kosli",
    "photo": {
      "alt": null,
      "height": "389",
      "width": "378",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/John_Willis.jpg"
    },
    "biography": "John Willis has worked in the IT management industry for more than 35 years. Currently he is an Evangelist at Docker Inc. Prior to Docker Willis was the VP of Solutions for Socketplane (sold to Docker) and Enstratius (sold to Dell). Prior to to Socketplane and Enstratius Willis was the VP of Training & Services at Opscode where he formalized the training, evangelism, and professional services functions at the firm. Willis also founded Gulf Breeze Software, an award winning IBM business partner, which specializes in deploying Tivoli technology for the enterprise. Willis has authored six IBM Redbooks for IBM on enterprise systems management and was the founder and chief architect at Chain Bridge Systems.",
    "website": null
  },
  "408": {
    "name": "Kohsuke Kawaguchi",
    "title": "Creator",
    "organization": "Jenkins project",
    "photo": {
      "alt": null,
      "height": "174",
      "width": "150",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/self_0.jpeg"
    },
    "biography": "Kohsuke Kawaguchi is the creator of Jenkins and co-CEO of Launchable. He is a well-respected developer and popular speaker at industry and Jenkins community events. Kawaguchi’s sensibilities in creating Jenkins and his deep understanding of how to translate its capabilities into usable software have also had a major impact on CloudBees’ strategy as a company, where he served as CTO. Before joining CloudBees, Kawaguchi was with Sun Microsystems and Oracle, where he worked on a variety of projects and initiated the open source work that led to Jenkins.",
    "website": {
      "name": "Jenkins",
      "url": "http://jenkins.io/"
    }
  },
  "435": {
    "name": "Bruce Momjian",
    "title": "Vice President, Postgres Evangelist",
    "organization": "EDB",
    "photo": {
      "alt": null,
      "height": "932",
      "width": "932",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/buddy_icon.jpg"
    },
    "biography": "Bruce Momjian is co-founder and core team member of the PostgreSQL Global Development Group, and has worked on PostgreSQL since 1996. He has been employed by EDB since 2006. He has spoken at many international open-source conferences and is the author of PostgreSQL: Introduction and Concepts, published by Addison-Wesley. Prior to his involvement with PostgreSQL, Bruce worked as a consultant, developing custom database applications for some of the world's largest law firms. As an academic, Bruce holds a Masters in Education, an honorary doctorate, was a high school computer science teacher, and lectures internationally.",
    "website": {
      "name": "My Homepage",
      "url": "https://momjian.us"
    }
  },
  "446": {
    "name": "Colin Charles",
    "title": "Managing Consultant",
    "organization": "GrokOpen",
    "photo": {
      "alt": null,
      "height": "755",
      "width": "500",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/colin_0.jpg"
    },
    "biography": "Colin Charles is the Managing Consultant at GrokOpen. Previously, Colin was on the founding team of MariaDB Server, and has been around the MySQL ecosystem including being an early employee at MySQL, and worked actively on the Fedora and OpenOffice.org projects. Colin has been a MySQL user since 2000. He's well known within open source communities, enjoys building business and market entry in APAC and has spoken at many conferences.",
    "website": {
      "name": "Blog",
      "url": "http://bytebot.net/blog/"
    }
  },
  "456": {
    "name": "Don Marti",
    "title": "Principal",
    "organization": "Aloodo Project",
    "photo": {
      "alt": null,
      "height": "634",
      "width": "634",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/dmarti-2.jpg"
    },
    "biography": "Don Marti has written for Linux Weekly News, Linux Journal, and other publications. Don co-founded the Linux and web consulting firm Electric Lichen, which he and business partner Jim Gleason later sold to VA Linux Systems. Don has served as president and vice president of the Silicon Valley Linux Users Group and on the program committees for Uselinux, Codecon, and LinuxWorld Conference and Expo. He was a key organizer for Windows Refund Day, Burn All GIFs Day, FreedomHEC, and the movement to free Dmitry Sklyarov.",
    "website": {
      "name": "Don Marti",
      "url": "https://blog.zgp.org/"
    }
  },
  "462": {
    "name": "Tom King",
    "title": null,
    "organization": null,
    "photo": null,
    "biography": null,
    "website": null
  },
  "477": {
    "name": "Federico Lucifredi",
    "title": "Product Management Director",
    "organization": "Red Hat",
    "photo": {
      "alt": null,
      "height": "1152",
      "width": "946",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/F2%20Hedcut%20by%20Kevin%20Sprouls%20.jpg"
    },
    "biography": "Federico Lucifredi is the Product Management Director for Ceph Storage at Red Hat and a co-author of O'Reilly's \"Peccary Book\" on AWS System Administration. Previously, he was the Ubuntu Server product manager at Canonical, where he oversaw a broad portfolio and the rise of Ubuntu Server to the rank of most popular OS on Amazon AWS. A software engineer-turned-manager at the Novell corporation, he was part of the SUSE Linux team, overseeing the update lifecycle and delivery stack of a $150 million maintenance business. A CIO and a network software architect at advanced technology and embedded Linux startups, Federico was also a lecturer for over 200 students in Boston University's graduate and undergraduate programs, and simultaneously a consultant for MIT implementing fluid-dynamics simulations in Java.",
    "website": null
  },
  "498": {
    "name": "der hans",
    "title": "Support Engineer Manager",
    "organization": "Object Rocket",
    "photo": {
      "alt": null,
      "height": "2363",
      "width": "2363",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/der.hans-01.png"
    },
    "biography": "der.hans is a Free Software, technology and entrepreneurial veteran. He is a repeat author for the Linux Journal with his article about online privacy and security using a password manager as the cover article for the January 2017 issue. He is chairman of the Phoenix Linux User Group (PLUG), BoF organizer for the Southern California Linux Expo (SCaLE) and founder of the Free Software Stammtisch. He presents regularly at large community-led conferences (SCaLE, SeaGL, Tux-Tage, Kielux, GeekBeacon Fest, LFNW, FOSSASIA, Tübix) and many local groups. \n    @FLOX_advocate\n\n \n \n \n \n https://floss.social/ https://gettogether.community/profile/19646/",
    "website": {
      "name": "LuftHans",
      "url": "https://www.SpiralArray.com/"
    }
  },
  "929": {
    "name": "Christophe Pettus",
    "title": "CEO",
    "organization": "PostgreSQL Experts, Inc.",
    "photo": {
      "alt": null,
      "height": "1377",
      "width": "1377",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/xof%20square_0.jpg"
    },
    "biography": "Christophe has been working with PostgreSQL since 1997. He is the CEO of PostgreSQL Experts, Inc.",
    "website": {
      "name": "The Build",
      "url": "http://thebuild.com"
    }
  },
  "1129": {
    "name": "Nova King",
    "title": null,
    "organization": null,
    "photo": {
      "alt": null,
      "height": "4608",
      "width": "3456",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/IMG_20200606_150727%20%282020_06_06%2021_01_58%20UTC%29.jpg"
    },
    "biography": null,
    "website": {
      "name": "Stardust XR",
      "url": "https://stardustxr.org/"
    }
  },
  "3653": {
    "name": "Justin Garrison",
    "title": "Sr Developer Advocate",
    "organization": "Amazon",
    "photo": {
      "alt": null,
      "height": "612",
      "width": "612",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/profile_1.png"
    },
    "biography": "Justin is a engineer building communities and solutions.",
    "website": {
      "name": "Blog",
      "url": "http://justingarrison.com"
    }
  },
  "3721": {
    "name": "Noah Kantrowitz",
    "title": "Engineer",
    "organization": "Geomagical Labs / IKEA",
    "photo": {
      "alt": null,
      "height": "336",
      "width": "500",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/headshot1.jpg"
    },
    "biography": "Noah Kantrowitz is a web developer turned infrastructure automation enthusiast, and all around engineering rabble-rouser. By day he runs infrastructure at Geomagical/IKEA and by night he makes candy and stickers. He is an active member of the DevOps community, and enjoys merge commits, cat pictures, and beards.",
    "website": {
      "name": "Homepage",
      "url": "https://coderanger.net/"
    }
  },
  "3740": {
    "name": "Peter Zaitsev",
    "title": "Founder",
    "organization": "Percona ",
    "photo": {
      "alt": null,
      "height": "1024",
      "width": "768",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/pz-768x1024.jpg"
    },
    "biography": "Peter Zaitsev is an entrepreneur and co-founder of Percona. As one of the foremost experts on Open Source strategy and database optimization, Peter leveraged both his technical vision and entrepreneurial skills to grow Percona from a two-person shop to one of the most respected open source companies in the business with staff members more than 350. Now Peter continues as a Board Member & Advisor in a range of open source startups. Peter is a co-author of High Performance MySQL: Optimization, Backups, and Replication, one of the most popular books on MySQL performance.",
    "website": {
      "name": "Percona",
      "url": "http://www.percona.com"
    }
  },
  "3783": {
    "name": "Matt Ray",
    "title": "Senior Community Manager for OpenCost",
    "organization": "Kubecost",
    "photo": {
      "alt": null,
      "height": "2154",
      "width": "2154",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Chef-Headshots-Sept-Oct-2014%20%2862%20of%20101%29.jpg"
    },
    "biography": "I have been active in Open Source and DevOps communities for over two decades and have spoken at and helped organize many conferences and meetups. I previously presented at SCALE 10x and 12x. Prior to joining Kubecost, I held customer, community, and partner-facing roles with several open source companies. I've worked in and with enterprises and startups across a wide variety of industries including banking, retail, and government. I currently live in Sydney, Australia after relocating from Austin, Texas. I am the co-host of the Software Defined Talk podcast and I'm active on Mastodon, Twitter, GitHub, and too many Slacks.",
    "website": {
      "name": "Matt Ray's ramblings",
      "url": "https://mattray.github.io/"
    }
  },
  "3806": {
    "name": "Alolita Sharma",
    "title": "Engineering Manager",
    "organization": "Apple",
    "photo": {
      "alt": null,
      "height": "681",
      "width": "1024",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/alolita-headshot-0519_0.jpg"
    },
    "biography": "Alolita Sharma is co-chair of the Cloud Native Computing Foundation (CNCF) Technical Advisory Group (TAG) for Observability, member of the OpenTelemetry Governance Committee and a board director of the Unicode Consortium. She contributes to open standards and open source at OpenTelemetry, Unicode and W3C. She has served on the boards of the OSI and SFLC.in. Alolita has led engineering teams at Wikipedia, Twitter, PayPal, IBM and AWS. Two decades of doing open source continue to inspire her.",
    "website": {
      "name": "Alolita's Blog",
      "url": "http://alolitasharma.com"
    }
  },
  "4046": {
    "name": "Jos Poortvliet",
    "title": "Marketing Director",
    "organization": "Nextcloud",
    "photo": {
      "alt": null,
      "height": "300",
      "width": "300",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/headcrop.jpg"
    },
    "biography": "People person, technology enthusiast and all-things-open evangelist. I have managed and marketed communities for more than a decade, getting started in the , followed by working as  at SUSE and co-founded . At Nextcloud I head up our marketing efforts, writing, speaking at and organizing conferences and talking about my passions ranging from psychology and people in communities to innovative technology.\n \n \n \n KDE community openSUSE Community Manager Nextcloud",
    "website": {
      "name": "blog",
      "url": "http://blog.jospoortvliet.com"
    }
  },
  "4056": {
    "name": "Michael Starch",
    "title": "Flight Software Engineer",
    "organization": "Jet Propulsion Laboratory, California Institute of Technology",
    "photo": {
      "alt": null,
      "height": "716",
      "width": "608",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/portrait.jpg"
    },
    "biography": "Many years ago amongst the snow drifts and tundra of the great frozen north, Michael Starch earned his Bachelor’s degree in Computer Engineering from the University of Michigan. Leaving his beloved homeland behind, he started a career at NASA's Jet Propulsion Laboratory in sunny Pasadena. He has remained there ever since working as a developer, operator, engineer, and open source community manager on a myriad of projects and missions. He also mentors at San Marino High School on Fridays. Over the years, Michael has dabbled in big data research, ultra scale cloud computing, high-end data systems, and software destined for space. Currently he is working on embedded frameworks applicable to NASA's small-scale spacecraft, and is applying those frameworks to robots bound for other worlds. Michael is a member of the Apache Software foundation and has volunteered for the ScaleAV team for many years right here at the Southern California Linux Expo.",
    "website": null
  },
  "4118": {
    "name": "Dustin Laurence",
    "title": "Software Engineer",
    "organization": null,
    "photo": {
      "alt": null,
      "height": "384",
      "width": "425",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/img_2686.jpg"
    },
    "biography": "Intending to become a programmer, Dustin got sidetracked and spent more time than he cares to admit doing theoretical physics and mathematics with no relevance to software.  He's better now. Some little-known facts about Dustin Laurence: \n        He first used a computer playing Colossal Cave Adventure and the\n    bootleg Fortran IV version of Zork over a glass teletype and an\n    acoustic modem.\n \n \n \n \n \n        His first good programming language was C. He lies and pretends\n    he didn't learn 8-bit BASIC first.\n \n \n \n        He once gave up learning the C low-level I/O functions from the\n    man pages because he thought 'void* buffer' indicated an abstract\n    data type and he couldn't find any documentation.\n \n \n \n \n \n        He once predicted that Linux was a fad that would be replaced by\n    BSD for serious work once the Berkeley codebase was completely\n    free. It's probably a good thing he doesn't gamble.\n \n \n \n \n \n        He doesn't do social media for the same reason he doesn't do\n    crack cocaine.",
    "website": null
  },
  "4154": {
    "name": "Bryan Cantrill",
    "title": "CTO",
    "organization": "Oxide Computer",
    "photo": {
      "alt": null,
      "height": "825",
      "width": "804",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/bmc.png"
    },
    "biography": "Bryan Cantrill is a software engineer who has spent a quarter of a century at the hardware/software interface. He is the co-founder and CTO of Oxide Computer Company, which is endeavoring to build a rack-scale computer for the post-cloud era. Prior to Oxide he spent nearly a decade at Joyent, a cloud computing pioneer; prior to Joyent, he spent fourteen years at Sun Microsystems, a now-defunct computer company that Bryan's ten-year-old daughter apparently thought was a brewery.",
    "website": null
  },
  "4167": {
    "name": "Donald Burr",
    "title": "Software Engineer",
    "organization": "VCT Labs",
    "photo": {
      "alt": null,
      "height": "1024",
      "width": "768",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/DSCN0206.jpg"
    },
    "biography": "Donald Burr has been using — and abusing — computers and gadgets practically since the day he was born. (Rumor has it he was born with a keyboard in one hand and a mouse in the other.) He has been involved in the Open Source community in various capacities for most of his adult life, and regularly advocates for the use of Linux and Open Source software to his various employers. Lately he's become enthused with mobile app development. When he’s not geeking around with tech, he can be found blogging and podcasting about Japanese animation and culture at Otaku no Podcast. He can be found on the Twitters as @dburr.",
    "website": {
      "name": "VCT Labs",
      "url": "http://vctlabs.com/"
    }
  },
  "4895": {
    "name": "Keith Fiske",
    "title": "Senior Database Engineer",
    "organization": "Crunchy Data",
    "photo": null,
    "biography": "Senior Database Engineer with Crunchy Data Solutions. Author of several popular 3rd-party PostgreSQL tools such as pg_partman, mimeo, & pg_extractor",
    "website": {
      "name": "http://www.keithf4.com",
      "url": "http://www.keithf4.com"
    }
  },
  "4903": {
    "name": "Eduardo Silva",
    "title": "Co-Founder",
    "organization": "Calyptia",
    "photo": {
      "alt": null,
      "height": "400",
      "width": "400",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/eduardo.jpeg"
    },
    "biography": "Eduardo is an entrepreneur and software engineer. He is currently one of the Fluentd project maintainers and creator of Fluent Bit, a lightweight Logs and Metrics processor. He also is the founder of Calyptia (the Fluent company).",
    "website": {
      "name": "Personal Blog",
      "url": "http://edsiper.linuxchile.cl"
    }
  },
  "4908": {
    "name": "Brian Monroe",
    "title": "Ambassador",
    "organization": "Fedora",
    "photo": null,
    "biography": "I'm a recovering Music Education major that's currently working as a SysAdmin for University of California. Been a Fedora user since Fedora 12 and an Ambassador since Fedora 15. I've been a Fedora Jam (Pro Audio focused spin) contributor since it's conception, and I own way too many guitars.",
    "website": {
      "name": "Fedora",
      "url": "http://www.fedoraproject.org"
    }
  },
  "4960": {
    "name": "Yannick Brosseau",
    "title": null,
    "organization": "Polytechnique Montreal",
    "photo": {
      "alt": null,
      "height": "837",
      "width": "795",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/profile_lpc.jpg"
    },
    "biography": "Yannick is a versatile computer engineer working mostly on open source projects. Recently, he has been helping the Chaire Mobilite lab at Polytechnique Montreal opening the code of their Transition plateform and working on their backend infrastructure. He has also teached embedded software development using OSS tools. And in his spare time, he's helping startups figure out their software development and infrastructure needs. Previously, he was a Production Engineer and Hardware System Engineer at Facebook, where he worked in the Kernel and Firmware teams. Before that, he worked on performance analysis tools for Linux, including contributing to the LTTng project, again at the Polytechnique Montreal university. This among various other work in various fields, including medical devices, GPS embedded platforms and web development.",
    "website": {
      "name": "http://www.yannickbrosseau.com/",
      "url": "http://www.yannickbrosseau.com/"
    }
  },
  "5043": {
    "name": "VIbhor Kumar",
    "title": "Principal System Architect",
    "organization": "EnterpriseDB",
    "photo": {
      "alt": null,
      "height": "104",
      "width": "88",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/photo.jpeg"
    },
    "biography": "Vibhor Kumar is a principal system engineer at EnterpriseDB. He joined the company in 2008 to work with Postgres after having worked with Oracle systems for three years. His experience includes team leadership roles at IBM Global Services and BMC Software and some years as an Oracle database administrator at CMC Ltd. He earned his bachelor’s degree in computer science at the University of Lucknow and his master’s degree in computer science at the Army Institute of Management, Kolkata.",
    "website": {
      "name": "Blog",
      "url": "https://vibhorkumar.wordpress.com"
    }
  },
  "5045": {
    "name": "Peter Geoghegan",
    "title": "Database Architect",
    "organization": "AWS",
    "photo": {
      "alt": null,
      "height": "532",
      "width": "366",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/me_0.jpeg"
    },
    "biography": "Peter has been involved in PostgreSQL development since 2011 as both a reviewer and feature implementer, and is a major contributor and committer. He has worked on all areas of the codebase, with a recent focus on the standard B-Tree index access method, as well as VACUUM.",
    "website": {
      "name": "Personal blog",
      "url": "http://pgeoghegan.blogspot.com"
    }
  },
  "5144": {
    "name": "Nathan Handler",
    "title": "Site Reliability Engineer",
    "organization": "Reddit",
    "photo": {
      "alt": null,
      "height": "1390",
      "width": "1390",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Headshot_Square_2mb.png"
    },
    "biography": "Nathan is a Site Reliability at Reddit, where he works to architect highly scalable and reliable systems that can be efficiently managed and observed. He has been involved with the open source community for nearly two decades, primarily through his roles as an Ubuntu and Debian GNU/Linux Developer and a member of the freenode IRC staff. Previously, he worked as a Developer Advocate/Software Engineer at Orchid Labs building an open marketplace for bandwidth on Ethereum, and as a Site Reliability Engineer at Yelp.",
    "website": null
  },
  "5167": {
    "name": "Magnus Hagander",
    "title": null,
    "organization": "Redpill Linpro",
    "photo": null,
    "biography": "Magnus Hagander is a member of the PostgreSQL Core Team and a developer and code committer in the PostgreSQL Global Development Group. Magnus is one of the original developers of the Windows port of PostgreSQL. These days, he mostly works on other parts of the PostgreSQL backend, recently with a focus on security features, monitoring and backup/replication interfaces and tools. He is also one of the core members of the postgresql.org infrastructure team, maintaining the servers that power the project, and one of the maintainers of the postgresql.org website. He's been a PostgreSQL user since version 6 (with some non-serious use of Postgres 95 before that), and currently serves on the Core Team and as President of the Board for PostgreSQL Europe. To pay the bills, he is a PostgreSQL and open source software consultant at Redpill Linpro in Stockholm, Sweden, where he works on consulting, support and training service.",
    "website": {
      "name": "https://blog.hagander.net/",
      "url": "https://blog.hagander.net/"
    }
  },
  "5172": {
    "name": "Bob Murphy",
    "title": "Linux Systems Administrator",
    "organization": "-",
    "photo": {
      "alt": null,
      "height": "640",
      "width": "413",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/bmurphy.jpg"
    },
    "biography": "I am a Linux Systems Administrator, I've been a user of GNU/Linux for my\nown personal use since the late nineties. I've used many distributions over\nthe years, starting with Slackware, up to the latest Red Hat and Ubuntu\nreleases.",
    "website": null
  },
  "5198": {
    "name": "Patrick McLean",
    "title": "Staff Release Engineer",
    "organization": "Sony PlayStation",
    "photo": {
      "alt": null,
      "height": "1492",
      "width": "1000",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Final_DSC00024-resized.jpg"
    },
    "biography": "Patrick McLean has been a part of the Linux community since the 90s, a Gentoo Developer since 2006, and is currently is a Staff Release Engineer at Sony PlayStation Cloud Gaming Engineering and Infrastructure department. He works on packaging, configuration management, internal tools, and low level debugging at PlayStation.",
    "website": null
  },
  "5299": {
    "name": "Alan Ott",
    "title": "Director of Platform Software",
    "organization": "SoftIron, Inc",
    "photo": {
      "alt": null,
      "height": "241",
      "width": "300",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/alan-pic_0.png"
    },
    "biography": "Alan started programming when he was four years old on his dad's Commodore 64 and began using Linux in the mid-90s while in high school. He currently works for SoftIron, a Silicon Valley startup making the world's finest appliances for the data center, including scale-out storage hardware running Ceph. Alan is the creator and maintainer of M-Stack, a free and open source USB device stack for PIC micocontrollers, and HIDAPI, a cross-platform host-side USB HID library; and is a contributor to the Linux kernel in the areas of USB and 802.15.4. He has presented at SCaLE, Microchip MASTERs, at Embedded Linux Conference in the US and Europe, and as an instructor for the Linux Foundation.",
    "website": {
      "name": "SoftIron",
      "url": "http://www.softiron.com"
    }
  },
  "5447": {
    "name": "Rich Horace",
    "title": "Principal",
    "organization": "SecretSauceOps",
    "photo": {
      "alt": null,
      "height": "4016",
      "width": "6016",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/richhorace-small.jpg"
    },
    "biography": "Rich has had the fortune to work for great organizations and with even better people throughout his career. He was an early-adopter of DevOps recognizing the opportunity to move Ops out from under just being a cost-center to a key contributor to help companies accelerate business objectives. A majority of his career has been building data-driven DevOps teams for SaaS in the online advertising space (Nativo, Fox, MySpace), but also has held roles within Corporate IT (Nestle and EMC). He has a passion for automation, observability and monitoring systems. He has been an Elastic Community Leader and organizer for the Elastic LA Meetup since 2015",
    "website": null
  },
  "5501": {
    "name": "Robert Treat",
    "title": "@robtreat2",
    "organization": "https://xzilla.net",
    "photo": null,
    "biography": "Working on database-backed, internet-based systems for over a decade, Robert is a published author and long-time open source contributor, having been recognized as a major contributor to the PostgreSQL project for his work over the years. An international speaker on databases, open source, and managing web operations at scale, he occasionally blogs at \n \n https://xzilla.net.",
    "website": null
  },
  "5508": {
    "name": "Mica Semrick",
    "title": null,
    "organization": null,
    "photo": null,
    "biography": "Editor, DITA architect, photographer, and all-around nerd.",
    "website": {
      "name": "silentumbrella.com",
      "url": "http://silentumbrella.com"
    }
  },
  "5616": {
    "name": "Matthias Crauwels",
    "title": "Enterprise Customer Engineer",
    "organization": "PlanetScale",
    "photo": {
      "alt": null,
      "height": "2048",
      "width": "1853",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/11357147_10153265154758686_39859391293096838_o.jpg"
    },
    "biography": "Since the age of 10 I’ve always been passionate about computers. I’ve been working with them ever since. In 2005 I got my degree in computer science. I used to work at a major Belgian university where I was developing the e-learning applications. In that position, I was the one who looked after the databases. From there on I grew to be their MySQL DBA. In 2017 I left the university and joined Pythian as a MySQL Database Consultant. Currently I am working at PlanetScale to support large enterprise type customers running MySQL at scale.",
    "website": null
  },
  "5639": {
    "name": "Heather Meeker",
    "title": "General Partner",
    "organization": "OSS Capital",
    "photo": {
      "alt": null,
      "height": "2872",
      "width": "2464",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/HJMHeadshotblue%20background.jpg"
    },
    "biography": "Heather Meeker is a General Partner at OSS Capital, an early stage venture capital fund specializing in commercial open source development. She is also a partner at Tech Law Partners, LLP, a law firm focused on technology transactions. She is an internationally-known specialist in open source software licensing.  She is the primary drafter of many widely-used licenses, including Elastic 2.0, and served on the core drafting team for Mozilla Public License 2.0 and the PolyForm licenses. Her book Open Source for Business, now in its third edition, is a definitive handbook for lawyers, engineers, and businesspersons on open source licensing in business.  Her Technology Licensing: A Primer, is a widely used handbook for technology licensing specialists. Her upcoming book, From Project to Profit, due in 2023, is a handbook for structuring commercial open source software businesses. \n    For more information, see \n \n www.heathermeeker.com/about-me",
    "website": {
      "name": "OSS Capital",
      "url": "http://oss.capital"
    }
  },
  "5647": {
    "name": "Stefano Maffulli",
    "title": "Executive Director",
    "organization": "Open Source Initiative",
    "photo": {
      "alt": null,
      "height": "2128",
      "width": "2184",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/ace_085c-x.jpg"
    },
    "biography": "Stefano is an experienced leader of open source organizations, from non-profits advocacy groups and trade organizations to business ventures and community projects across countries. With a proven track record in community building, he’s also an active contributor to open source projects. When not basking in front of a monitor, you’ll find him teaching sailing or perfecting his pizza technique.",
    "website": null
  },
  "5691": {
    "name": "JJ Asghar",
    "title": "Developer Advocate",
    "organization": "IBM",
    "photo": {
      "alt": null,
      "height": "200",
      "width": "200",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/810824.jpeg"
    },
    "biography": "JJ works at IBM on the IBM cloud as a Developer Advocate. He’s focusing on the IBM Kubernetes Service trying to make companies and users have a successful on boarding to the Cloud Native ecosystem. He lives and grew up in Austin, Texas. He enjoys a good strong stout, hoppy IPA, and some team building Artemis, madding Dwarf Fortress or Rimworld or possibly pair programming cluster Factorio. He’s a member of the Church of Emacs, though jumps into Vim on remote machines. He usually chooses Ubuntu over CentOS, but secretly wants FreeBSD everywhere. He’s always trying to become a better Ruby developer, but flirts with Go, Rust, and only when he has to, Node. A father and husband, if he’s not trying to automate his job away he’s always to convince his daughters to “be button makers not button pushers.”",
    "website": {
      "name": "https://jjasghar.github.io",
      "url": "https://jjasghar.github.io"
    }
  },
  "5771": {
    "name": "Jonathan Katz",
    "title": "VP, Platform Engineering",
    "organization": "Crunchy Data",
    "photo": {
      "alt": null,
      "height": "128",
      "width": "114",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/headshot17.jpg"
    },
    "biography": "Jonathan Katz is the VP of Platform Engineering at Crunchy Data, focused on managing PGO, an open source Postgres Operator behind Crunchy Postgres for Kubernetes. Jonathan is on the PostgreSQL Core Team and is involved in various governance aspects of the PostgreSQL Global Development Group. He is a Secretary and Director of the PostgreSQL Community Association of Canada NPO and is a Director of the United States PostgreSQL Association NPO. He speaks at conferences around the world on both app developer and operations topics on PostgreSQL and associated technologies like Kubernetes. Prior to Crunchy Data, Jonathan was CTO at VenueBook and before that, VP of Technology at Paperless Post.  Jonathan graduated from Tufts University with a B.S. in Computer Science and a B.A. in Mathematics.",
    "website": {
      "name": "Crunchy Data",
      "url": "https://www.crunchydata.com"
    }
  },
  "5790": {
    "name": "Roller Angel",
    "title": "Helpdesk Technician / GLOBE Community Support",
    "organization": "UCAR (University Corporation for Atmospheric Research) / The GLOBE Program",
    "photo": {
      "alt": null,
      "height": "411",
      "width": "425",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Roller-Headshot-2019.png"
    },
    "biography": "Roller Angel spends most of his time helping people learn how to accomplish their goals using technology. He's an avid FreeBSD Systems Administrator and Pythonista who enjoys learning all the amazing things that can be done with Open Source technology, namely FreeBSD and Python, to solve issues. He's a firm believer that one can learn anything they wish to set their mind to. He uses Configuration Management software on FreeBSD written in Python every day as part of his job as a Senior Systems Administrator to help him automate and control the FreeBSD servers he manages.",
    "website": {
      "name": "BSD Programming Workshop",
      "url": "http://BSD.pw"
    }
  },
  "5838": {
    "name": "Bronwyn Mauldin",
    "title": "Director of Research and Evaluation",
    "organization": "LA County Department of Arts & Culture",
    "photo": {
      "alt": null,
      "height": "730",
      "width": "1100",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Mauldin.jpg"
    },
    "biography": "Bronwyn Mauldin oversees a Research and Evaluation team that utilizes data and social science methods to improve the LA County Department of Arts & Culture's work to increase equity and inclusion through the arts. Bronwyn has spent her career conducting applied research and evaluation for nonprofits, philanthropies and government. She also teaches research methods to master's students in the arts administration program at Claremont Graduate University. Across her career in public service, Bronwyn has evaluated farmworker programs in California’s Central Valley, studied employment conditions for truck drivers in the Pacific Northwest, analyzed apprenticeship opportunities in the healthcare industry, and researched villager organizing in rural northeast Thailand. A writer and zine maker, she has been an artist in residence at Mesa Verde National Park in Colorado, Denali National Park in Alaska, and Kulturni Centar Rex in Belgrade, Serbia.",
    "website": {
      "name": "Arts & Culture Needs Assessment",
      "url": "https://lacountyartsdata.org"
    }
  },
  "5910": {
    "name": "Mofizur Rahman",
    "title": "Developer Advocate",
    "organization": "Google",
    "photo": {
      "alt": null,
      "height": "837",
      "width": "837",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/square-profile.png"
    },
    "biography": "Mofizur Rahman (@moficodes) is a Developer Advocate at Google. His area of interests include container orchestration, micro services and observability. His favorite programming language these days is Go. He also tinkers with Node, Python and Java. He is also learning and teaching in the Go, Kubernetes, Docker and Microservice community. He is a strong believer of the power of open source and importance of giving back to the community. He is a self proclaimed sticker collecting addict and has collected several box full of stickers with no signs of stopping. He dabbles in photography sometimes. \n    He writes tech blogs sometimes which can be found on .\n \n https://dev.to/moficodes",
    "website": {
      "name": "Website",
      "url": "https://moficodes.com"
    }
  },
  "5954": {
    "name": "Sam Hanna",
    "title": "Medical Technician",
    "organization": "Abbott Labs",
    "photo": {
      "alt": null,
      "height": "960",
      "width": "540",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/20170605_133411.jpg"
    },
    "biography": "Sam is a medical technician at Abbott Labs for the past 5 years. He assists with clinics, and hospitals with patient’s that have implantable heart devices (e.g., Pacemakers, Implantable Cardioverter Defibrillator, heart Monitors) that need a remote connection to their physician for diagnostics. On his spare time, he has been a Linux user for over 15 years. He is self-taught and loves working with many Linux distributions, server applications, and tools. He is an advocate of opensource software and self-hosting. His goal is to reach out and spread his knowledge to others just as the opensource community has done for him.",
    "website": null
  },
  "5965": {
    "name": "Jeffrey Sica",
    "title": "Principal Developer Experience Engineer",
    "organization": "CNCF",
    "photo": {
      "alt": null,
      "height": "982",
      "width": "952",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/jeefy%20k8s%20profile%20closeup.png"
    },
    "biography": "Jeffrey (@jeefy) is a Principal Developer Experience Engineer at the CNCF, with a focus on improving community and project automation. Before that, he’s worked at Red Hat and the University of Michigan focusing on Cloud Native technologies and CICD patterns. Jeffrey has been a contributor to upstream Kubernetes, helping in SIG-Contribex, SIG-Release, and SIG-UI. He passionately advocates for open source development and recognizing and alleviating burnout.",
    "website": {
      "name": "jeefy.dev",
      "url": "http://jeefy.dev"
    }
  },
  "5977": {
    "name": "Matt Davis",
    "title": "SRE Advocate",
    "organization": "Blameless",
    "photo": {
      "alt": null,
      "height": "1000",
      "width": "1000",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/metacotank-sm.png"
    },
    "biography": "Just as at home with electro-acoustic synthesizer electronics as with site reliability engineering, I find joy in operating inherently chaotic complex systems. My expertise is a variegation of data-center operations, storage hardware, distributed databases, IT security, support services, observability systems, education, advocacy, and SRE leadership. With degrees in music performance and composition, I have a passion for exploring relationships between the artistic mind and the operation of socio-technical systems: my research on improvisation and intuition spans both the arts and resilience engineering. These cross-currents of music and tech are reflected in both my talk subjects and my musical output. Seeking diverse ways to adapt and learn from our emergent universe is at the core of what I do. My experiences have led me to talk about reliability and resilience at LISA, SRECon, Music City Tech, Disney JETA, RE:Deploy, CMG ObservabilityCon, DevWeek, and several years at SCaLE.",
    "website": {
      "name": "Sounding",
      "url": "https://www.sounding.com"
    }
  },
  "5999": {
    "name": "Karen Bruner",
    "title": null,
    "organization": null,
    "photo": null,
    "biography": "After a couple decades on-call, Karen has developed a phobia of not getting enough sleep. She spends her spare time rendering puns in yarn, solving bizarre twisty puzzle cubes, and tripping over cats. Karen also has a blog, where she shares techniques, stories, and rants about Site Reliability, DevOps, and other stuff.",
    "website": {
      "name": "Running in Production with Scissors",
      "url": "https://productionwithscissors.run/"
    }
  },
  "6001": {
    "name": "Michel Salim",
    "title": "Production Engineer",
    "organization": "Meta Platforms, Inc.",
    "photo": {
      "alt": null,
      "height": "334",
      "width": "334",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Key_West_hat.jpg"
    },
    "biography": null,
    "website": {
      "name": "Pensées de Michel",
      "url": "https://michel-slm.name/"
    }
  },
  "6021": {
    "name": "Bob Killen",
    "title": "OSS Program Manager",
    "organization": "Google",
    "photo": {
      "alt": null,
      "height": "1024",
      "width": "1024",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Bob%20Killen.jpeg"
    },
    "biography": "Bob is a Program Manager at the Google Open Source Programs Office with a focus on Cloud Native computing. He serves the Kubernetes project as a Steering Committee member and chair of the Contributor Experience Special Interest Group and has been involved in many other cross-cutting areas of the project. Bob comes from an academic background, spending 15 years at the University of Michigan with a later focus on computational research. As a Cloud Native Computing Foundation Ambassador, Bob has worked towards improving High Performance Computing, Machine Learning, and other research initiatives by integrating them with Cloud Native practices and tooling. He is passionate about Academic Outreach, and is an outspoken advocate of Open Source, Open Science and pets of the furry 4 legged variety.",
    "website": {
      "name": "Bob Killen",
      "url": "https://mrbobbytabl.es"
    }
  },
  "6034": {
    "name": "Alvaro Leiva",
    "title": null,
    "organization": "Meta",
    "photo": {
      "alt": null,
      "height": "1890",
      "width": "1262",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/received_433747241797907.jpeg"
    },
    "biography": "I love Coding, I grew up in a small town in Chile and one weekend, 16 years ago, I had the flu and could not go out. I decided to learn how to code in Python and that was the beginning of the road that would moved us all to the Northern California so that I could join the Production Engineering team at Instagram. Also like eating, drinking and cooking (in that order).",
    "website": null
  },
  "6036": {
    "name": "Jon Cruz",
    "title": "Chief Agitator",
    "organization": "Inkscape",
    "photo": {
      "alt": null,
      "height": "256",
      "width": "256",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Cruz_Jon_sm.jpg"
    },
    "biography": "Jon A. Cruz is a professional developer with over 20 years of experience, working extensively in multimedia, including programming and 3D art creation, and has developed for a wide variety of platforms. Work includes R&D for mobile and other devices, servers for large mail and messaging systems, enterprise security applications, and user interface design and development.. He had participated as a mentor in Google's Summer of Code since its first year with Inkscape and recently also for OpenICC. He has presented at many conferences including Linux.conf.au, the Libre Graphics Meetings, OSCON and others including the SCALE where he also a common presence in the expo hall helping to represent Inkscape and other Libre Graphics efforts..",
    "website": null
  },
  "6049": {
    "name": "Rob Richardson",
    "title": "Developer Advocate",
    "organization": "Shoreline.io",
    "photo": {
      "alt": null,
      "height": "577",
      "width": "577",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Rob%20Richardson%20square.jpg"
    },
    "biography": "Rob Richardson is a software craftsman building web properties in ASP.NET and Node, React and Vue. He’s a Microsoft MVP, published author, frequent speaker at conferences, user groups, and community events, and a diligent teacher and student of high quality software development. You can find this and other talks on his blog at  and follow him on twitter at @rob_rich.\n \n https://robrich.org/presentations",
    "website": {
      "name": "Rob's Speaking Experience",
      "url": "https://robrich.org/presentations"
    }
  },
  "6400": {
    "name": "Bryna Kirzner",
    "title": "COO and Co-Founder",
    "organization": "STAAJ Solutions",
    "photo": {
      "alt": null,
      "height": "639",
      "width": "640",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/bryna.jpg"
    },
    "biography": "Bryna is a tech industry leader passionate about bringing people together and creating a more positive work environment in technology. As the COO and Co-Founder of , she leverages her Agile TechOps knowledge to bridge gaps, inspire change, and provide lean operations to businesses in their crucial early stages.\n \n STAAJ Solutions Bryna helped shape the tech landscape in Southern California as Co-Founder and Co-Chair of DevOpsDayLA and by pioneering DevOps meetups there. Her roles at companies like Disney, Warner Bros, FOX, Verizon, Riot Games, and Nordstrom have provided her valuable insights, which she willingly shares to elevate those around her. Recognized for her depth of knowledge and genuine approach, Bryna is a familiar face at events such as the Southern California Linux Expo (SCaLE). Central to her mission is fostering meaningful collaboration in the tech world.",
    "website": {
      "name": "STAAJ Solutions",
      "url": "http://staajsolutions.com"
    }
  },
  "6588": {
    "name": "Kenny Armstrong",
    "title": "Trainer Advisor",
    "organization": "Linux Professional Institute",
    "photo": {
      "alt": null,
      "height": "450",
      "width": "450",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/DSC01402.jpg"
    },
    "biography": "Kenny has worked with UNIX-like operating systems since his introduction to them while serving in the U.S. military in the late 1990s. Kenny has been involved with the Linux community in various capacities such as teaching Linux for a variety of training organizations, deploying Linux in local government institutions up to large Universities, as well as in various large-scale businesses. Kenny enjoys working with open platforms and finding potential new uses for them in a variety of situations. More importantly, he prefers teaching others about Linux so that they can put it to use wherever possible.",
    "website": null
  },
  "9686": {
    "name": "Mark Wong",
    "title": "Major Contributor",
    "organization": "PostgreSQL",
    "photo": {
      "alt": null,
      "height": "866",
      "width": "866",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/mark-sq_1.png"
    },
    "biography": "Mark Wong is a Performance Engineer at EDB and is a PostgreSQL Major Contributor. He first introduced himself to the PostgreSQL community in 2003 with open source benchmarking kits and performance data. Since then, he has continued to contribute to various aspects of the community such as a Google Summer of Code mentor, Conference Organizer, Portland PostgreSQL Users Group Co-Organizer, PostgreSQL Fundraising Group Member, and a Director on the Board of the United States PostgreSQL.",
    "website": null
  },
  "9719": {
    "name": "Cali Dolfi",
    "title": "Data Scientist ",
    "organization": "Red Hat ",
    "photo": {
      "alt": null,
      "height": "2985",
      "width": "3050",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/CD.jpg"
    },
    "biography": "Cali Dolfi is a Data Scientist in the Open Source Program Office at Red Hat. Her work focuses on changing the way we look at open source communities through the lens of data science and machine learning. Outside of data science, her passion lies in making careers in technology more accessible for underrepresented groups by mentoring college students and developing accessible academic resources. Cali is a recent graduate of Boston University where she was a Teachers Fellow, collegiate athlete, and focused her studies on cryptography and data ethics. In her free time, she loves to weightlift, hike, and cook.",
    "website": {
      "name": "Linkedin ",
      "url": "http://www.linkedin.com/in/calidolfi"
    }
  },
  "9831": {
    "name": "Jay Miller",
    "title": "Senior Cloud Advocate",
    "organization": "Microsoft",
    "photo": {
      "alt": null,
      "height": "3024",
      "width": "3024",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/IMG_7167.jpeg"
    },
    "biography": "Jay is a Senior Cloud Advocate at Microsoft, based in San Diego, Ca. A multipotentialite, Jay enjoys finding unique ways to merge his fascination with productivity, automation, and development to create tools and content to serve the tech community.",
    "website": {
      "name": "KJaymiller.com",
      "url": "https://kjaymiller.com"
    }
  },
  "9895": {
    "name": "Doug Ortiz",
    "title": "Senior Postgres DevOps Engineer",
    "organization": "EnterpriseDB",
    "photo": {
      "alt": null,
      "height": "128",
      "width": "128",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/DougOrtiz-LinkedIn%20%282%29.png"
    },
    "biography": "Doug Ortiz is a technologist with experience in Architecting, Developing, Migrating, Modernizing applications between on-premise to/from  platforms involving technologies  such as: AWS, Azure, GCP, IaaC, Big Data, Data Analytics, DevOps, Linux, Kubernetes, Docker, Terraform, Ansible, Python, Scala, GoLang, GraphQL, .Net, along with database technologies of the likes: PostgreSQL, Neo4J, MySQL, and SQL Server. Strengths: Multi-Cloud Experience, Software Architecture and Development, DevOps, Microservices, Containerization, Automation, and Database Technologies",
    "website": {
      "name": "EDB",
      "url": "http://www.edb.com"
    }
  },
  "10037": {
    "name": "Greg Prosser",
    "title": "Security Engineer",
    "organization": "Meta (Facebook)",
    "photo": null,
    "biography": null,
    "website": null
  },
  "10071": {
    "name": "Frédéric Desbiens",
    "title": "Program Manager and Evangelist — IoT and Edge Computing",
    "organization": "Eclipse Foundation",
    "photo": {
      "alt": null,
      "height": "2002",
      "width": "2002",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/fdesbiens-headshot2022-square2.jpg"
    },
    "biography": "Frédéric Desbiens manages IoT and Edge Computing programs at the Eclipse Foundation. His job is to help the community innovate by bringing devices and software together. He is a strong supporter of open source. He worked as a product manager, solutions architect, and developer for companies as diverse as Pivotal, Cisco, and Oracle. Frédéric holds an MBA in electronic commerce, a BASc in Computer Science, and a BEd, all from Université Laval. In the past, Frédéric spoke at several industry conferences, such as Oracle OpenWorld, JavaOne, ODTUG Kaleidoscope, IOUG Collaborate, and QCon. After hours, Frédéric will typically read a history book, play video games, or watch Anime. \n    You can follow his blog at: \n \n https://blog.blueberrycoder.com/",
    "website": {
      "name": "Eclipse Edge Native Working Group",
      "url": "https://edgenative.eclipse.org"
    }
  },
  "10098": {
    "name": "Sage McTaggart",
    "title": "Security Analyst",
    "organization": "Red Hat",
    "photo": {
      "alt": null,
      "height": "200",
      "width": "200",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/mctaggart.png"
    },
    "biography": "Sage is a security analyst at Red Hat, focusing on storage security, both for containers and for distributed systems. They did a master's degree at UCSC, and have an undergraduate degree in math and computer science from Umass Amherst. In their free time, they enjoy hiking with their dog.",
    "website": null
  },
  "10099": {
    "name": "Michael Hackett",
    "title": "Senior Principal Product Experience Engineer",
    "organization": "Red Hat",
    "photo": {
      "alt": null,
      "height": "786",
      "width": "818",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/hackett.png"
    },
    "biography": "Michael Hackett is a storage and SAN expert in customer support. He has been working on Ceph and storage-related products for over 12 years. Apart from this, he holds several storage and SAN-based certifications and prides himself on his ability to troubleshoot and adapt to new complex issues. Michael is currently working at Red Hat, based in Massachusetts, where he is a principal software maintenance engineer for Red Hat Ceph and the technical product lead for the global Ceph team. Michael lives in Massachusetts with his wife, Nicole, his two sons, and their dog. He is an avid sports fan and enjoys time with his family.",
    "website": null
  },
  "10109": {
    "name": "Anita Zhang",
    "title": "Software Engineering Manager",
    "organization": "Meta",
    "photo": {
      "alt": null,
      "height": "800",
      "width": "800",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/headshot2022_800.png"
    },
    "biography": "Anita Zhang is the software engineering manager of Meta's Linux Userspace team. Her team connects Meta's infrastructure with the open source community. She is active on the systemd project and continues to support systemd at Meta as part of their userspace efforts.",
    "website": null
  },
  "10128": {
    "name": "Justin Reock",
    "title": "Field CTO",
    "organization": "Gradle, Inc.",
    "photo": {
      "alt": null,
      "height": "522",
      "width": "916",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/New-headshot-transback-png.png"
    },
    "biography": "Justin Reock is the Chief Evangelist and Field CTO of Gradle Enterprise, and is an outspoken blogger, speaker, and free software evangelist. He has over 20 years of experience working in various software roles and has delivered enterprise solutions, technical leadership, and community education on a range of topics.",
    "website": {
      "name": "Gradle",
      "url": "https://gradle.com"
    }
  },
  "10238": {
    "name": "AmyJune Hineline",
    "title": "Certificate Community Architect",
    "organization": "The Linux Foundation",
    "photo": {
      "alt": null,
      "height": "1168",
      "width": "1650",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Image%20from%20iOS.jpg"
    },
    "biography": "AmyJune currently works with the Linux Foundation as their Certificate Community Architect. She is responsible for supporting the Certification team’s efforts in building and maintaining exams and related documentation for exam products in the Linux Foundation’s certification portfolio. She is a Drupal core mentor. She has the unique privilege of being a non-code developer and has the ability to bridge the gap between the technical writers, the coders, the developers, and the designers and connect them with first-time contributors with skill sets that match their specific contribution needs. AmyJune helps communities discover how they can contribute and belong in more ways than code.",
    "website": null
  },
  "10262": {
    "name": "Ibrar Ahmed",
    "title": "Principle Software Engineer",
    "organization": "Percona LLC",
    "photo": {
      "alt": null,
      "height": "640",
      "width": "640",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/pp.jpeg"
    },
    "biography": "Ibrar Ahmed is a Senior Software Architect at Percona LLC. Before coming to open source development, he had vast experience in software design and development. His primary focus was on system-level embedded development. After joining EnterpriseDB 2006, an Enterprise PostgreSQL company, he started his career in open-source development, specifically in PostgreSQL. He has contributed to the PostgreSQL community and other open-source communities. His contribution ranges from the main performance feature enhancements to various PostgreSQL modules. In the database field, he has experience in other well-known databases, MySQL, Oracle, MongoDB and Hadoop. His expertise is in core databases and tools related to databases like Hive /Spark. Ibrar has given more than 60+ PostgreSQL talks in the four years in various parts of the World. He also authored multiple books on PostgreSQL. He is ranked among the top 100 most influential people in the database community.",
    "website": {
      "name": "pgelephant.com",
      "url": "http://pgelephant.com"
    }
  },
  "10276": {
    "name": "Carl George",
    "title": null,
    "organization": null,
    "photo": {
      "alt": null,
      "height": "400",
      "width": "400",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/carl-2021-square.jpg"
    },
    "biography": "Carl George is a Principal Software Engineer on the Community Platform Engineering team at Red Hat. He is active in the EPEL, Fedora, and CentOS communities. He has worked in the IT field for 19 years, including 8 years in the U.S. Army.",
    "website": null
  },
  "10363": {
    "name": "zoe steinkamp",
    "title": "Developer Advocate",
    "organization": "Influx Data",
    "photo": {
      "alt": null,
      "height": "1322",
      "width": "1773",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/HW2_4303bw%20%281%29.jpg"
    },
    "biography": "My name is Zoe Steinkamp and I am a developer Advocate for influxData, after working as a front end software engineer for over eight years. In my role as a Developer Advocate, I help developers to engage with InfluxData, including our database platform, open source tools, and Time-Series Data solutions. I have a passion for making developers' lives as well as learning about data science. My interests besides new technology include traveling and gardening. You can find me speaking at virtual and in person events and always feel free to reach out on linkedin.",
    "website": null
  },
  "10445": {
    "name": "Remy DeCausemaker",
    "title": "Open Source Lead",
    "organization": "Digital Service at The Centers for Medicare & Medicaid Services",
    "photo": {
      "alt": null,
      "height": "1430",
      "width": "1471",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/decause-shouldershot-by-peter-adams.jpeg"
    },
    "biography": "Remy DeCausemaker is the Open Source Lead for the Digital Service at the Centers for Medicare & Medicaid Services (CMS.) Remy supports a community of developers, designers, and other contributors to create accessible healthcare technology through collaboration. Through his work with the Digital Service, Remy helps improve access to health Information, and grow communities of practice around Open Data, Open Standards, and Open Source code. Remy comes to CMS with over a decade of work at the frontier of Open Source Software. His career has included many firsts, including helping to launch the first academic minor in Open Source Software in the United States at Rochester Institute of Technology. He was the first Open Source community manager of an American presidential campaign, the first Head of Open Source at Spotify, the second Open Source Program Manager at Twitter, and now serves as the nation’s first ever Open Source Lead at CMS.gov. Photo: Peter Adams, FacesOfOpensource.com",
    "website": {
      "name": "Digital Service @ CMS.gov",
      "url": "https://cms.gov/digital-service-cms"
    }
  },
  "10466": {
    "name": "Kenny Gryp",
    "title": "MySQL Product Management Director",
    "organization": "MySQL",
    "photo": {
      "alt": null,
      "height": "890",
      "width": "864",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Screen%20Shot%202022-07-22%20at%204.16.30%20PM.png"
    },
    "biography": "Kenny started using MySQL in the early 2000's as DBA/Systems Engineer, spent 8 years at Percona as MySQL Consultant/Architect & Practice Manager and is currently MySQL Product Management Director at Oracle.",
    "website": null
  },
  "10557": {
    "name": "Mandi Walls",
    "title": "DevOps Advocate",
    "organization": "PagerDuty",
    "photo": {
      "alt": null,
      "height": "800",
      "width": "735",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/MandiWalls-735x800.jpg"
    },
    "biography": "Mandi Walls is a DevOps Advocate at PagerDuty. For PagerDuty, she helps technology organizations increase their effectiveness with modern IT practices and unplanned incidents. She is a regular speaker at technical conferences when she isn’t podcasting, streaming, or writing about PagerDuty. She is interested in the emergence of new tools and workflows to make the task of operating large complex computing systems more approachable.",
    "website": {
      "name": "About Me",
      "url": "https://about.me/lnxchk"
    }
  },
  "10577": {
    "name": "Adam Gordon Bell",
    "title": "Developer ",
    "organization": "Earthly",
    "photo": {
      "alt": null,
      "height": "1400",
      "width": "1400",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Adam2.png"
    },
    "biography": "Adam Gordon Bell has a popular podcast on software development. He formerly worked for Tenable on cloud security and container security products. He is now a developer advocate for the open-source build tool Earthly. He also spends a lot of time writing about software development.",
    "website": {
      "name": "Earthly",
      "url": "http://earthly.dev/"
    }
  },
  "10608": {
    "name": "Lukonde Mwila",
    "title": "Senior Developer Advocate",
    "organization": "AWS",
    "photo": {
      "alt": null,
      "height": "2500",
      "width": "2500",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Luke%20%28White%20Background%29%20%286%29.jpg"
    },
    "biography": "Lukonde is a Senior Developer Advocate at AWS and a HashiCorp Ambassador. He has years of experience in application development, solution architecture, cloud engineering, and DevOps workflows. He is a life-long learner and is passionate about sharing knowledge through various mediums. Nowadays, Lukonde spends the majority of his time contributing to the cloud-native ecosystem.",
    "website": {
      "name": "YouTube Channel",
      "url": "https://www.youtube.com/c/LukondeMwila"
    }
  },
  "10610": {
    "name": "Fatima Taj",
    "title": "Software Engineer",
    "organization": "Yelp",
    "photo": {
      "alt": null,
      "height": "1058",
      "width": "1080",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Profile%20Picture.jpeg"
    },
    "biography": "Fatima is a graduate of the University of Waterloo, Canada. Post graduation, she's worked full-time as a Software Developer at DRW, a trading firm, and currently works at Yelp as a Software Engineer. Fatima is passionate about supporting fellow tech enthusiasts and has spoken at over 70 hackathons across North America in 2022. In addition, she's also been a panelist at Harvard WeCode, presented at the Women Who Code Connect Event, Black is Tech Conference, Tapia Conference, and Women of Silicon Roundabout, London's biggest event for women in technology.",
    "website": null
  },
  "10614": {
    "name": "Christian Kreibich",
    "title": "Technical Lead",
    "organization": "The Zeek Project",
    "photo": {
      "alt": null,
      "height": "1000",
      "width": "1000",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/mugshot-1000.jpg"
    },
    "biography": "Christian is the technical lead of the Zeek project. He works at Corelight. Prior to that he spent 5 years building and leading the networking group at Lastline, and 5 years as a staff research scientist at the International Computer Science Institute. He served on the advisory board of the Open Information Security Foundation, and holds a PhD from the University of Cambridge. He has a major crush on open-source software and has used Linux as his main OS since kernel 2.0.28.",
    "website": null
  },
  "10615": {
    "name": "Naveen Srinivasan",
    "title": null,
    "organization": null,
    "photo": {
      "alt": null,
      "height": "1280",
      "width": "1176",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/naveensrinivasan.jpeg"
    },
    "biography": "Naveen is a contributor and maintainer of multiple  projects, a member and contributor to the  org, and a contributor to the .\n \n \n \n OpenSSF Sigstore SLSA code base \n    His contributions have earned him recognition with Google Peer Bonus awards in  and . \n \n \n 2021 2022 \n    His contributions can be viewed on his ), and he can be found on .\n \n \n http://github.com/naveensrinivasan https://twitter.com/snaveen",
    "website": {
      "name": "https://github.com/naveensrinivasan",
      "url": "https://github.com/naveensrinivasan"
    }
  },
  "10623": {
    "name": "Hamid Akhtar",
    "title": "Senior Software Engineer",
    "organization": "Percona",
    "photo": {
      "alt": null,
      "height": "3088",
      "width": "2316",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/IMG_0452.jpg"
    },
    "biography": "Hamid has over twenty years of experience in software development and has been working with PostgreSQL for over a decade. Previously, he was part of EnterpriseDB, managing the official PostgreSQL installers for Windows, Linux, and macOS. At HighGo Software, Hamid was a leading PostgreSQL architect working on various in-house solutions, including in-memory solutions, ORC FDW, and various performance features. Hamid is currently the Engineering Tech Lead for PostgreSQL at Percona, where he contributes to both the PostgreSQL community and Percona's PostgreSQL offering.",
    "website": null
  },
  "10631": {
    "name": "vignesh ravichandran",
    "title": "Engineering Manager",
    "organization": "Cloudflare Inc",
    "photo": {
      "alt": null,
      "height": "221",
      "width": "221",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/dp.jpeg"
    },
    "biography": "Vignesh is an Engineering Manager at Cloudflare responsible for Cloudflare's mission-critical databases.\nHe manages a team of database engineers across the world. Vignesh also built high availability on Postgres across multiple data centers and contributed to Postgres, stolon, and other open-source projects. He is the creator of spinup.host",
    "website": {
      "name": "http://viggy28.dev",
      "url": "http://viggy28.dev"
    }
  },
  "10636": {
    "name": "Shayon Sanyal",
    "title": "Principal Database Specialist Solutions Architect",
    "organization": "Amazon Web Services",
    "photo": {
      "alt": null,
      "height": "2000",
      "width": "1500",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Shayon%20Sanyal_resized.jpg"
    },
    "biography": "Shayon Sanyal is a Principal Database Specialist Solutions Architect for RDS/Aurora PostgreSQL based out of New York and has been with AWS since December 2017. Shayon has overall 12+ years experience in IT Consulting, Delivery, Pre-Sales and Professional Services in IT Infrastructure, IaaS, Database and Cloud domains. His day job allows him to help AWS customers design scalable, secure, performant and robust database architectures on the cloud. Outside work, you can find him hiking, traveling or training for the next half-marathon.",
    "website": null
  },
  "10651": {
    "name": "Mel Kaulfuss",
    "title": "Developer Advocate",
    "organization": "Buildkite",
    "photo": {
      "alt": null,
      "height": "2544",
      "width": "2133",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/mel_profile_pic.jpeg"
    },
    "biography": "Mel is a Developer Advocate at Buildkite and has spent the past decade delivering software, either as a Software Developer, Production Coordinator or Project Manager. She loves developer communities and bringing people together to learn, has organised and emceed numerous RubyConfs in Australia, and most recently launched Buildkite's own developer conference; Unblock. When she's not clickity clacking, she's patting dogs, eating strawberries, learning German and watching Nordic Noir.",
    "website": {
      "name": "Mel Kaulfuss - personal site",
      "url": "http://melk.dev"
    }
  },
  "10659": {
    "name": "Julia Kreger",
    "title": "Senior Principal Software Engineer",
    "organization": "Red Hat",
    "photo": {
      "alt": null,
      "height": "400",
      "width": "400",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Julia-400x400.png"
    },
    "biography": "Julia has seen things, and built things! Sounds ominous right? She started in Networking early in her career, and drifted through building data centers, hardcore systems engineering, and eventually the automation of the data center infrastructure! She is a Senior Principal Software Engineer at Red Hat, and serves on the Board of Directors of the OpenInfra Foundation. When she is not in meetings, she can sometimes be found working on the Ironic Project, which helps facilitate Bare Metal as a Service.",
    "website": null
  },
  "10660": {
    "name": "Jay Faulkner",
    "title": "Open Source Developer",
    "organization": "G-Research Open Source Software",
    "photo": {
      "alt": null,
      "height": "1285",
      "width": "1285",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/jf-headshot.jpg"
    },
    "biography": "I am Jay Faulkner, an Open Source Developer and Advocate. I believe that through working with others around the world to solve problems we can make the world better. Open source is a great way to do that. I'm on the OpenStack Technical Committee and am PTL of Ironic. I also contribute periodically to Armada (armadaproject.io) and Gentoo.",
    "website": {
      "name": "Personal blog",
      "url": "https://jay.jvf.cc"
    }
  },
  "10662": {
    "name": "Nicolas Vermande",
    "title": "Head of Devrel",
    "organization": "Spectro Cloud",
    "photo": {
      "alt": null,
      "height": "596",
      "width": "833",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Screen%20Shot%202022-09-15%20at%2012.01.17%20PM.png"
    },
    "biography": "Nicolas is an experienced hands-on technologist, evangelist and product owner who has been working in the fields of Cloud-Native technologies, Open Source Software, Virtualization and Datacenter networking for the past 18 years. Passionate about enabling users and building cool tech solving real-life problems, you'll often see him speaking at global tech conferences and online events, spreading the word and walking the walk with customers and users.",
    "website": null
  },
  "10668": {
    "name": "Luis Mendoza",
    "title": "High School Student",
    "organization": "LAUSD",
    "photo": null,
    "biography": null,
    "website": null
  },
  "10669": {
    "name": "David Martinez",
    "title": "High School Student",
    "organization": "LAUSD",
    "photo": null,
    "biography": null,
    "website": null
  },
  "10671": {
    "name": "Miejl Mendoza",
    "title": "Student",
    "organization": "LAUSD",
    "photo": null,
    "biography": null,
    "website": null
  },
  "10672": {
    "name": "Jilliene Yusi",
    "title": "Student",
    "organization": "LAUSD",
    "photo": null,
    "biography": null,
    "website": null
  },
  "10682": {
    "name": "Brian Russell",
    "title": "Product Manager",
    "organization": "Google",
    "photo": {
      "alt": null,
      "height": "699",
      "width": "800",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/profile.JPG"
    },
    "biography": "Brian is a Product Manager on Google’s Open Source Security Team. He focuses on software supply chain security and is actively involved in the OpenSSF Scorecards project. In his spare time, Brian enjoys 3D printing and Atari video game programming.",
    "website": null
  },
  "10685": {
    "name": "Igor Khokhriakov",
    "title": "Scientific Software Developer",
    "organization": "San Diego Supercomputer Center",
    "photo": {
      "alt": null,
      "height": "1347",
      "width": "1678",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/0_4.jpeg"
    },
    "biography": "My name is Igor Khokhriakov. I am a Scientific Software Developer in San Diego Supercomputer Center, University of California San Diego (UCSD), USA. Main field of interest and responsibility design and implement Kubernetes platform to integrate computed structured models from AplhaFold and others into rcsb.org search engine. Previously I worked as a scientist at Helmholtz-Zentrum Hereon (ex. Helmholtz-Zentrum Geesthacht) effectively I was involved mainly in Scientific Software Development activities, specifically in designing and developing Data Acquisition system for High-throughput tomography experiments. Also I actively participated in Tango-Controls community - an open source framework for System Control and Data Acquisition systems - by doing a lot of researchers around it. Specifically, moving Tango-Controls into the realm of web, design and implement a roadmap for future Tango evaluation etc.",
    "website": {
      "name": "Home page",
      "url": "https://ingvord.ru/"
    }
  },
  "10701": {
    "name": "David Zhu",
    "title": "Technical project manager",
    "organization": "Alluxio",
    "photo": null,
    "biography": null,
    "website": null
  },
  "10702": {
    "name": "Chunxu Tang",
    "title": null,
    "organization": null,
    "photo": {
      "alt": null,
      "height": "2003",
      "width": "2001",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Chunxu.jpg"
    },
    "biography": "Chunxu Tang is a Research Scientist at Alluxio and a committer of PrestoDB. Prior to Alluxio, he served as a Senior Software Engineer in Twitter’s data platform team, where he gained extensive experience with a wide range of data systems, including Presto, Zeppelin, BigQuery, and Druid. He received his Ph.D. in computer engineering from Syracuse University, where he conducted research on distributed collaboration systems and machine learning applications.",
    "website": null
  },
  "10703": {
    "name": "Beinan Wang",
    "title": "Senior Staff Software Engineer",
    "organization": "Alluxio",
    "photo": null,
    "biography": "Dr. Beinan Wang is a Senior Staff Engineer from Alluxio and is the committer of PrestoDB.  Prior to Alluxio, he was the Tech Lead of the Presto team in Twitter and he built large scale distributed SQL systems for Twitter’s data platform.  He has twelve-year experience of working on performance optimization, distributed caching, and volume data processing.  He received his PhD in computer engineering from Syracuse University on the symbolic model checking and runtime verification of distributed systems.",
    "website": null
  },
  "10708": {
    "name": "Michael Cote",
    "title": "Senior Member of Technical Staff",
    "organization": "VMware",
    "photo": {
      "alt": null,
      "height": "1466",
      "width": "1461",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/2019%20Cot%C3%A9%20headshot%20Square.jpg"
    },
    "biography": "Michael Coté studies how large organizations get better at building software to run better and grow their business. His books Changing Mindsets, Monolithic Transformation, and The Business Bottleneck cover these topics. He’s been an industry analyst at RedMonk and 451 Research, done corporate strategy and M&A, and was a programmer. He also co-hosts several podcasts, including Software Defined Talk. Cf. cote.io, and is @cote in Twitter. Texas Forever!",
    "website": {
      "name": "Cote.io",
      "url": "https://cote.io"
    }
  },
  "10712": {
    "name": "Nicholas Morey",
    "title": "Developer Advocate",
    "organization": "Akuity",
    "photo": {
      "alt": null,
      "height": "400",
      "width": "400",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/avitar.jpeg"
    },
    "biography": "Nicholas Morey is a Platform Engineer with a passion for DevOps practices. He is on the team at Akuity as a Developer Advocate, talking with the community about anything Argo Project related. He is an experienced Argo CD operator and a Certified Kubernetes Administrator.",
    "website": null
  },
  "10720": {
    "name": "Samantha Saldana",
    "title": "Student",
    "organization": "LAUSD",
    "photo": null,
    "biography": null,
    "website": null
  },
  "10721": {
    "name": "Wesley Bantugan",
    "title": "Student",
    "organization": "LAUSD",
    "photo": null,
    "biography": null,
    "website": null
  },
  "10722": {
    "name": "Danica Madamba",
    "title": "Student",
    "organization": "LAUSD",
    "photo": null,
    "biography": null,
    "website": null
  },
  "10723": {
    "name": "Jônatas Paganini",
    "title": "Developer Advocate",
    "organization": "Timescale",
    "photo": {
      "alt": null,
      "height": "800",
      "width": "800",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/squared.png"
    },
    "biography": "Nerd, cyclist, and blogger. Jônatas is a pair programming evangelist. Vim editor user and enthusiast. Postgresql user since 2004.",
    "website": {
      "name": "My personal blog",
      "url": "https://ideia.me"
    }
  },
  "10736": {
    "name": "Christopher Travers",
    "title": null,
    "organization": null,
    "photo": null,
    "biography": "Chris Travers has over twenty years of experience working with PostgreSQL as an application developer, database administrator and engineer, and IT manager.  He has worked with (and overseen teams which worked with) petabyte-scale implementations of PostgreSQL often replacing technologies like Elastic Search when scalability limits were reached there. At Adjust, Chris oversaw teams supporting the infrastructure and data management platforms that supported 700k requests a second and data environments storing over ten petabytes of data at high velocity.  He has also worked as a principal engineer at Delivery Hero, and at several other firms.",
    "website": null
  },
  "10739": {
    "name": "Kathryn Tang",
    "title": "Engineering Operations Lead",
    "organization": "Shopify",
    "photo": {
      "alt": null,
      "height": "502",
      "width": "502",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Screenshot%202022-11-23%20at%201.57.40%20PM.png"
    },
    "biography": "Kathryn manages the business of Infrastructure at Shopify, leading the Engineering Operations group. Driving Black Friday Cyber Monday (BFCM) readiness, large complex programs, cloud costs, and partner relationships, we set the foundation for Shopify Infrastructure teams to build the best technology at scale. With a background in business management, wind engineering consulting, analytics, business transformation, and investing, she thinks holistically about risk management.",
    "website": null
  },
  "10744": {
    "name": "Susan Wu",
    "title": "Outbound Product Manager",
    "organization": "Google",
    "photo": {
      "alt": null,
      "height": "747",
      "width": "498",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Google%20Susan%207.jpeg"
    },
    "biography": "Susan is an Outbound Product Manager at Google Cloud. She previously led product and technical marketing roles at Sun/Oracle, Canonical, Docker, Citrix, Midokura (SDN startup now part of Sony Group), VMware NSX and Tanzu Service Mesh. She is a frequent speaker at conferences such as OSCON, Open Source Summit, Container World, Interop, Open Networking and Edge Summit and VMworld. Follow Susan on Twitter @susanwu88 and on Github.com/susanwu88",
    "website": {
      "name": "Google Cloud",
      "url": "https://cloud.google.com/"
    }
  },
  "10746": {
    "name": "Olga Merkulova",
    "title": "Solutions Analyst",
    "organization": "IK Company",
    "photo": {
      "alt": null,
      "height": "2020",
      "width": "2030",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/1669665382667_0.jpg"
    },
    "biography": "Olga Merkulova is a solutions analyst and founder of the IK Company. She started as a Java developer back in 2007. After 4 years in the big international companies she realized she is also keen on analysis and requirements capture. Olga ended up founding an IT consulting company in 2016 and working as a solutions analyst optimizing processes, writing prototypes and proof of the concepts for laboratories in the big EU research facilities such as ESFR, DESY. She is an open-source enthusiast. This is the reason all company’s in-house developed projects and frameworks are open source. Olga moved to the southern California form the north of Germany about 1 year ago but she is still amazed by the everyday wonderful weather! She loves to travel and her one of the most memorable adventure is the USA coast to coast road trip.",
    "website": null
  },
  "10748": {
    "name": "Ryan Taylor",
    "title": "Solutions Eng",
    "organization": "Transposit Corporation",
    "photo": {
      "alt": null,
      "height": "2000",
      "width": "1467",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/med_rez.jpg"
    },
    "biography": "I have over 15 years of experience leading Technical Operations teams with some of the most respected companies in streaming media, finance, and security technology. In 2021, I joined Transposit as Head of Product to provide thought leadership and strategy to build a product that fulfills the needs of our customers, employees, partners and rewards our stakeholders. I am an Ex-Hulugan, Director of Production Operations. My teams maximized uptime/availability for our Live and Video on Demand products leveraging operators, a talented engineering team, and the analytical tools built by those teams. I am a frequent speaker, consultant, and colleague to those in the technical operations field. In my experience, communication and shared goals have lowered the drawbridges of impenetrable castles. The resulting relationships and experiences have led my teams to create and operate some of the most efficient tech platforms.",
    "website": {
      "name": "Our Website",
      "url": "https://transposit.com"
    }
  },
  "10750": {
    "name": "Andrew Zigler",
    "title": "Developer Advocate",
    "organization": "Mattermost",
    "photo": {
      "alt": null,
      "height": "400",
      "width": "400",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/_0DqyYZG_400x400.jpeg"
    },
    "biography": "Andrew is a professional developer advocate at Mattermost where he creates resources to empower the open source community. After graduating from The University of Texas at Austin, he taught English abroad in Japan, learned to code between teaching classes, and later became the lead web developer for an e-learning company back home in the United States. A lifelong advocate of career and technical education, Andrew's passion is helping others unlock their true potential.",
    "website": {
      "name": "andrewzigler.com",
      "url": "https://www.andrewzigler.com/"
    }
  },
  "10753": {
    "name": "Muhammad Usama",
    "title": "Senior software engineer",
    "organization": "Percona",
    "photo": {
      "alt": null,
      "height": "1040",
      "width": "1052",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/IMG_7393.jpg"
    },
    "biography": "Muhammad Usama is major contributor and committer for the Pgpool-II open-source project and has contributed to many performances and high availability-related features. He has 20 years of professional software development experience and has been involved with PostgreSQL since 2006.\nBefore coming to open source development, Usama was doing software design and development with the main focus on system-level embedded development. After joining EnterpriseDB in 2006, he started his career in open-source development, specifically in PostgreSQL and Pgpool-II. At HighGo Software, he was one of the leading PostgreSQL architects and spearheaded the IvorySQL (Oracle-compatible open-source PostgreSQL) project. He is currently working at Percona and contributing towards the community and Percona's PostgreSQL offering.",
    "website": null
  },
  "10755": {
    "name": "Chanchal Gupta",
    "title": null,
    "organization": "Edmunds",
    "photo": {
      "alt": null,
      "height": "600",
      "width": "600",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/IMG_2712_exif_clerared_low_ressed_resized_cloaked.png"
    },
    "biography": "Chanchal is a founding member of the Site Reliability Engineering (SRE) team at Edmunds.  He loves solving complex problems using technology and data.  He enjoys traveling, nature, and hiking in national parks.",
    "website": null
  },
  "10759": {
    "name": "Paige Cruz",
    "title": "Senior Developer Advocate",
    "organization": "Chronosphere",
    "photo": {
      "alt": null,
      "height": "1155",
      "width": "804",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Screen%20Shot%202022-11-29%20at%2010.11.11%20AM.png"
    },
    "biography": "Paige Cruz is a Senior Developer Advocate at Chronosphere passionate about cultivating sustainable on-call practices and bringing folks their aha moment with observability. She started as a software engineer at New Relic before switching to Site Reliability Engineering holding the pager for InVision, Lightstep, and Weedmaps. Off-the-clock you can find her spinning yarn, swooning over alpacas, or watching trash TV on Bravo.",
    "website": {
      "name": "Personal Site",
      "url": "https://www.paigerduty.com"
    }
  },
  "10764": {
    "name": "Daniel Gross",
    "title": "Senior Developer Advocate",
    "organization": "AWS",
    "photo": {
      "alt": null,
      "height": "2839",
      "width": "2839",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/headshot_11.jpg"
    },
    "biography": "With over 28 years of experience in leading-edge technology, Dan has held developer and lead roles at various companies in Silicon Valley. He has been with AWS for over 3 1/2 years working in the IoT space to help reduce friction and accelerate time to market for builders. Focused on FreeRTOS and embedded devices interacting with cloud services, Dan is passionate about delivering a great developer experience for IoT.",
    "website": null
  },
  "10766": {
    "name": "ALKIN TEZUYSAL",
    "title": "EVP - Global Services",
    "organization": "ChistaDATA Inc. ",
    "photo": {
      "alt": null,
      "height": "2661",
      "width": "2391",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/studyo%20objektif%20%281Mb%29.jpg"
    },
    "biography": "Alkin Tezuysal has extensive experience in open-source relational databases, working in various sectors for large corporations. With over 25 years of industry experience, he has acquired skills for managing large projects from the ground up to production. For the past decade, he's been focused on e-commerce, SaaS, and MySQL technologies. Alkin has managed and architected database topologies for high-volume sites. He has several years of experience in 24X7 support and operational tasks and improving database systems for major companies. He has led global operations teams on Tier 1/2/3 support for MySQL customers. He currently holds the EVP - Global Services position at fast-growing startup ChistaDATA Inc. He's also co-author of the  MySQL Cookbook 4th Edition.",
    "website": {
      "name": "ChistaDATA",
      "url": "http://www.chistadata.com"
    }
  },
  "10767": {
    "name": "Timothy Mamo",
    "title": "Senior Developer Advocate",
    "organization": "DigitalOcean",
    "photo": {
      "alt": null,
      "height": "2022",
      "width": "1960",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/ProfilePic_0.jpg"
    },
    "biography": "Timothy Mamo loves to help growing companies make the most of the cloud by focusing on Cloud Native technologies and processes. He’s had a varied experience, from studying aerospace engineering and working in the automotive industry before moving into the world of Cloud and becoming a Developer Advocate for DigitalOcean. He enjoys working and helping others improve and understand, at times with some Mediterranean gusto.",
    "website": null
  },
  "10768": {
    "name": "Natalia Ivanko",
    "title": "Security Product Lead",
    "organization": "Isovalent",
    "photo": {
      "alt": null,
      "height": "1130",
      "width": "1110",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Screenshot%202022-11-30%20at%2011.59.29.png"
    },
    "biography": "Natalia Reka Ivanko is a Security Product Lead with a strong background in container and cloud native security. She is passionate about building things that matter and working with site reliability and software engineers to develop and apply security best practices. She is inclined towards innovative technologies like eBPF and Kubernetes, loves being hands on, and is always looking for new challenges and growth. She is a big believer in open source and automation. In her free time she loves flying as a private pilot, experiencing outdoor activities like surfing and running and getting to know new cultures.",
    "website": {
      "name": "LinkedIN - Natalia Reka Ivanko",
      "url": "https://www.linkedin.com/in/natália-réka-ivánkó/"
    }
  },
  "10771": {
    "name": "Brooks Townsend",
    "title": "Lead Software Engineer",
    "organization": "Cosmonic",
    "photo": {
      "alt": null,
      "height": "1600",
      "width": "2400",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/headshot_kubecon.jpg"
    },
    "biography": "Brooks is a Lead Software Engineer at Cosmonic, focusing on harnessing WebAssembly to alleviate the pains of modern software development. Brooks started his software development career with Critical Stack, a Kubernetes container orchestration platform that is now open source. He joined Cosmonic to focus on bringing WebAssembly and wasmCloud to the Cloud Native world full-time. He is a proud Rustacean and an advocate of all-things open source.",
    "website": null
  },
  "10781": {
    "name": "Taylor Thomas",
    "title": "Director of Engineering",
    "organization": "Cosmonic",
    "photo": {
      "alt": null,
      "height": "512",
      "width": "512",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/image.png"
    },
    "biography": "Taylor Thomas is an Engineering Director working on WebAssembly platforms at Cosmonic. He actively participates in the open source community and is one of the creators of Krustlet and Bindle. He is currently core maintainer of wasmCloud, Bindle, and Krustlet. He is a regular speaker at various open source conferences and meetups, including various KubeCons and local meetup groups. His work at Intel, Nike, and Microsoft spanned various containers and Kubernetes platforms as well as WebAssembly platforms and experimentation. He currently lives in the Utah area in the US and enjoys hiking and camping.",
    "website": null
  },
  "10782": {
    "name": "John Fastabend",
    "title": "Engineer",
    "organization": "Isovalent",
    "photo": null,
    "biography": "John Fastabend is the creator of Tetragon and current project lead as well as a Cilium maintainer. He is a long time kernel contributor and maintainer working on BPF from the early days of its creation and is the listed maintainer for various networking subsystems and drivers. He is currently having fun applying eBPF at Isovalent to solve cloud-native security and observability problems with Tetragon.",
    "website": null
  },
  "10783": {
    "name": "kat gaines",
    "title": "developer advocate",
    "organization": "pagerduty",
    "photo": {
      "alt": null,
      "height": "625",
      "width": "501",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/crop.jpeg"
    },
    "biography": "Kat Gaines is a developer advocate at PagerDuty. She enjoys talking and thinking about incident response, customer support, and automating the creation of a delightful end-user and employee experience. She previously ran Global Customer Support at PagerDuty, and as a result it’s hard to get her to stop talking about the potential career paths for tech support professionals. In her spare time, Kat is a mediocre plant parent and a slightly less mediocre pet parent to two rabbits, Lupin and Ginny.",
    "website": null
  },
  "10785": {
    "name": "Ryan Booz",
    "title": "PostgreSQL Advocate",
    "organization": "Redgate",
    "photo": {
      "alt": null,
      "height": "619",
      "width": "600",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/ryanb_headshot_square.jpg"
    },
    "biography": "Ryan is an Advocate at Redgate focusing on PostgreSQL. Ryan has been working as a PostgreSQL advocate, developer, DBA and product manager for more than 20 years, primarily working with time-series data on PostgreSQL and the Microsoft Data Platform. Ryan is a long-time DBA, starting with MySQL and Postgres in the late 90s. He spent more than 15 years working with SQL Server before returning to PostgreSQL full-time in 2018. He’s at the top of his game when he's learning something new about the data platform or teaching others about the technology he loves.",
    "website": {
      "name": "Software And Booz",
      "url": "https://www.softwareandbooz.com"
    }
  },
  "10786": {
    "name": "Andrew Ryan",
    "title": "Production Engineer",
    "organization": "Meta Platforms Inc",
    "photo": null,
    "biography": "Andrew has been a Production Engineer at Meta since 2009. Before that, he held a variety of roles in software development and system administration.",
    "website": null
  },
  "10787": {
    "name": "Caroline Coward",
    "title": "Library Group Supervisor",
    "organization": "NASA Jet Propulsion Laboratory/Caltech",
    "photo": {
      "alt": null,
      "height": "2129",
      "width": "1968",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Study%20in%20purple.jpg"
    },
    "biography": "Caroline Coward supervises the daily operations of the Library at NASA’s Jet Propulsion Laboratory, collaborating with and supporting the work of scientists, engineers, and mission specialists across the organization in areas such as internal and external information curation, ML/AI technology initiatives, and data governance and strategy. Caroline holds a Master of Library and Information Science degree from San Jose State University, and she spent the majority of her over 30-year career as a tenured faculty member in higher education coordinating programs in information literacy and High Impact Practices. At JPL, Caroline leads efforts in organizing the Lab's vast information stores, from physical processing and access, to blockchain applications, information and AI ethics, metadata, taxonomy, and ontology development, to developing new information initiatives Labwide.",
    "website": null
  },
  "10788": {
    "name": "Dan OBoyle",
    "title": "SRE",
    "organization": "Reddit",
    "photo": {
      "alt": null,
      "height": "880",
      "width": "1130",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Screenshot%202022-11-30%20at%206.45.36%20PM.png"
    },
    "biography": "Dan is a Staff Site Reliability Engineer @ Reddit. He started his career as a high school teacher and transitioned into a System Administrator. He enjoys creative collaboration to solve solvable things, and using automation for everything else.",
    "website": null
  },
  "10790": {
    "name": "Denis Lussier",
    "title": "Co-founder and CTO",
    "organization": "Stealth Technology Corp.",
    "photo": {
      "alt": null,
      "height": "292",
      "width": "320",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/denis.jpg"
    },
    "biography": "Denis is a software developer, architect and entrepreneur with several decades of deep PostgreSQL experience. Denis co-founded EnterpriseDB (EDB), one of the leading commercial Postgres companies, and served as CTO for the company’s first five years. During this time EDB became a big supporter of the Postgres community, and he and the company developed or supported the development of many enterprise class features in Postgres. Subsequently Denis was founder and CEO of OpenSCG, a Postgres product and consulting company acquired by Amazon Web Services in 2018. He then served at AWS as Postgres product manager for Aurora and RDS, the largest Postgres cloud services in the world. \n    Denis is now the co-founder and CTO at , a Postgres-focused startup planning to emerge from stealth mode in Q1 2023. He has previously spoken at a number of Postgres conferences and over the years has mentored many members of the Postgres developer community.\n \n https://www.stelthy.io",
    "website": {
      "name": "Stealth Technology Corp, aka Stelthy.io",
      "url": "https://www.stelthy.io"
    }
  },
  "10797": {
    "name": "Anne Holler",
    "title": "Advisor",
    "organization": "Elotl",
    "photo": {
      "alt": null,
      "height": "510",
      "width": "908",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/IMG_0519.jpg"
    },
    "biography": "Anne is an advisor at Elotl.  She has an ongoing interest in the intersection of resource efficiency and\nartificial intelligence.  She worked on Uber's Michelangelo Machine Learning platform, on the management\nstack for Velocloud's SD-WAN product, on VMware's Distributed Resource Schedulers for server and storage\ninfrastructure, on performance analysis for VMware's hypervisor and hosted products, on Omnishift's\ntransparent application and data delivery over the web to the desktop, on Transmeta's Crusoe processor\nperformance and power, and on Hewlett-Packard's low-level compiler optimizer.  She received bachelors and\nmasters degrees from Duke University, and a doctorate from University of Virginia, all in Computer Science.",
    "website": {
      "name": "AnneHollerLinkedIn",
      "url": "https://www.linkedin.com/in/anne-holler-8860943/"
    }
  },
  "10798": {
    "name": "Yarden Laifenfeld",
    "title": "Software Engineer",
    "organization": "Rookout",
    "photo": {
      "alt": null,
      "height": "2048",
      "width": "1476",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/IMG_7673%203.JPG"
    },
    "biography": "Yarden Laifenfeld is a Software Engineer at Rookout. With a deep background in C and embedded Linux environments, you can find her in the office jumping between 6 different programming languages a day. When she’s not busy developing new features and helping out clients, she loves learning about new technology, creating iOS apps and making everything she can automated.",
    "website": null
  },
  "10800": {
    "name": "Tarus Balog",
    "title": "Principal Evangelist Open Source",
    "organization": "Amazon Web Service",
    "photo": {
      "alt": null,
      "height": "299",
      "width": "300",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/tarus_balog.png"
    },
    "biography": "Tarus Balog has been involved in managing communications networks professionally since 1988, and unprofessionally since 1978 when he got his first computer - a TRS-80 from Radio Shack. After working as a network management consultant for many years, he got involved in open source software through the OpenNMS Project starting in 2001 and became the maintainer of the project in 2002. He built a company around that project that counted some of the world's largest companies as customers, and the company was sold in 2019. Since 2022 he has been an advocate for open source at Amazon Web Services as a Principal Evangelist.",
    "website": {
      "name": "Adventures in Open Source",
      "url": "https://adventuresinoss.com"
    }
  },
  "10828": {
    "name": "Ramiro Berrelleza",
    "title": "CEO and Co-founder",
    "organization": "Okteto",
    "photo": {
      "alt": null,
      "height": "2400",
      "width": "3600",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/RamiroBerrelleza13.jpg"
    },
    "biography": "Ramiro Berrelleza is one of the founders of Okteto. He has spent most of his career (and his free time) building cloud services and developer tools. Before starting Okteto, Ramiro was an Architect at Atlassian and a Software Engineer at Microsoft Azure. Originally from Mexico, he currently lives in the Bay Area.",
    "website": null
  },
  "10837": {
    "name": "Chelsea Dole",
    "title": "Senior Software Engineer",
    "organization": "Brex",
    "photo": {
      "alt": null,
      "height": "528",
      "width": "559",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Screenshot%202022-12-02%20at%208.10.26%20PM.png"
    },
    "biography": "Chelsea Dole is a Senior Software Engineer at Brex, a fintech startup providing B2B credit access and expense management software. As an engineer on the Data Storage team, she builds Postgres infrastructure at scale, performs query optimization, and seeks to up-level organizational understanding of databases. Chelsea is active within the Postgres and Python communities, and has presented talks about cloud computing, data storage, and Python.",
    "website": {
      "name": "LinkedIn",
      "url": "https://www.linkedin.com/in/chelsea-dole/"
    }
  },
  "10844": {
    "name": "Rylie Johnson",
    "title": "Software Engineer",
    "organization": "Civic Eagle",
    "photo": {
      "alt": null,
      "height": "802",
      "width": "780",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Screenshot%202023-01-12%20at%203.03.25%20PM.png"
    },
    "biography": "Rylie is a Software Engineer with Civic Eagle and a Maintainer of Open States, where they aim to improve civic engagement at the state and federal level by providing data and tools regarding those legislatures.",
    "website": null
  },
  "10848": {
    "name": "Elizabeth Christensen",
    "title": "Customer Success ",
    "organization": "Crunchy Data",
    "photo": {
      "alt": null,
      "height": "515",
      "width": "500",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/elizabeth_tiny_headshot.png"
    },
    "biography": "Elizabeth is a Customer Success Manager at Crunchy Data and volunteers for the United States PostgreSQL Association (PgUS). Elizabeth enjoys writing about Postgres for Newbies and teaching people about databases whenever she gets the chance. She has a background in open source project management and enjoys working with development teams to build products and applications using all the fun things in the open source toy box. Elizabeth hails from Lawrence, Kansas and spends most of her free time pretending like she lives on a farm in the 1860s.",
    "website": null
  },
  "10850": {
    "name": "David Christensen",
    "title": "Principal Database Engineer",
    "organization": "Crunchy Data",
    "photo": {
      "alt": null,
      "height": "555",
      "width": "600",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/david_small_headshot.png"
    },
    "biography": "David has been working with PostgreSQL for around 20 years, since version 6.5. He is a committer to the Bucardo project (a multi-primary database replication solution), and has consulted on PostgreSQL databases for close to 15 years.",
    "website": null
  },
  "10852": {
    "name": "James McShane",
    "title": "Director of Engineering Services",
    "organization": "SuperOrbital",
    "photo": {
      "alt": null,
      "height": "4032",
      "width": "3024",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/IMG_1026.jpeg"
    },
    "biography": "James is a lifelong learner, practitioner, and teacher of technical topics, focused on product delivery on Kubernetes. He has enabled teams large and small to deliver new products and platforms amidst challenging business and technical environments.",
    "website": {
      "name": "https://superorbital.io/",
      "url": "https://superorbital.io/"
    }
  },
  "10859": {
    "name": "Kaslin Fields",
    "title": "OSS K8s & GKE Developer Advocate",
    "organization": "Google Cloud",
    "photo": {
      "alt": null,
      "height": "400",
      "width": "400",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/KaslinHeadshot2021.jpeg"
    },
    "biography": "Kaslin Fields is a Developer Advocate at Google Cloud, a Cloud Native Computing Foundation (CNCF) Ambassador, and a contributor to Open Source Kubernetes. As a Developer Advocate, she engages with Open Source and technical practitioner communities both as a member, and as an advocate for their needs in the development of Google Cloud's products. She is passionate about making technology accessible to a broad audience through creating content in many forms, such as videos, blogs, documentation, and even comics which she illustrates herself!",
    "website": {
      "name": "Containerized Adventures",
      "url": "https://kaslin.rocks"
    }
  },
  "10876": {
    "name": "Jesse Mortenson",
    "title": "Chief Technology Officer",
    "organization": "Civic Eagle / Open States",
    "photo": {
      "alt": null,
      "height": "300",
      "width": "300",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/team-headshot-02-small.jpg"
    },
    "biography": "I was inspired to join Civic Eagle by the founders’ commitment to the mission of improving participation in democracy and by the perseverance and tenacity they demonstrated in overcoming obstacles to that mission. At Civic Eagle, we help the people who connect directly with communities translate a desire for a better world into public policy. These folks are often strapped for time and resources, so our data automation and collaboration tools make their biggest impact at that “grasstops” level. I was employee #1 in 2018 and led our efforts to adopt and incorporate the Open States project. I have a background that includes positions focusing on DevOps, API development in a SaaS context, and side projects collecting data for the public good.",
    "website": {
      "name": "Open States",
      "url": "https://www.openstates.org"
    }
  },
  "10877": {
    "name": "Margaret Tucker",
    "title": "Policy Analyst",
    "organization": "GitHub",
    "photo": {
      "alt": null,
      "height": "667",
      "width": "1000",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/gh.jpeg"
    },
    "biography": "Margaret Tucker is a Policy Analyst at GitHub working on issues including intermediary liability, copyright, and open source security policy. Margaret is passionate about advocating for developers' interests to policymakers and hearing from developers about what policy issues matter to them. Prior to joining GitHub, Margaret was a Policy Fellow serving the Office of Science and Technology Policy and also worked as a Research Associate for Future Tense, a section of Slate covering the implications of emerging technologies.",
    "website": {
      "name": "GitHub Policy",
      "url": "https://github.com/about/developer-policy/"
    }
  },
  "10878": {
    "name": "J Simmons",
    "title": "Digital Engineering Consultant",
    "organization": "The J. Simmons, LLC",
    "photo": {
      "alt": null,
      "height": "958",
      "width": "959",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/headshot_13.jpg"
    },
    "biography": "I am an OSHW advocate and the founder of Mach 30, a US non-profit dedicated to developing OSHW for spaceflight. I was the lead developer for the Shepard Test Stand (OSHW Certificate US000006, ), an open source Estes rocket motor test stand to support educational and outreach activities. I have also presented at the 2012, 2013, and 2015 OSHW Summits where I covered topics ranging from open source spaceflight hardware to export controls to open source engineering analysis. \n \n http://opendesignengine.net/projects/shepard-ts In 2012, I was the chief architect and project manager for Open Design Engine, an all inclusive web application for hosting OSHW projects.  Since the launch of Open Design Engine, I have focused my effort on collecting lessons on what it takes to effectively develop, collaborate, share, and remix OSHW projects in academic, commercial, and volunteer settings.",
    "website": {
      "name": "The J. Simmons, LLC",
      "url": "https://thejsimmons.com"
    }
  },
  "10888": {
    "name": "Joshua Loscar",
    "title": null,
    "organization": null,
    "photo": {
      "alt": null,
      "height": "925",
      "width": "717",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/jscar-headshot-2022%20%281%29.png"
    },
    "biography": "Senior Platform TAM at Red Hat\nI am a #RedHatAccelerator\nPassions: Privacy, Security & Hardware, Raspberry Pi, Steam Deck, & 3D printing.",
    "website": null
  },
  "10896": {
    "name": "Paul Mansour-Geoffrion",
    "title": "Director of Customer Success",
    "organization": "FireTail.io",
    "photo": {
      "alt": null,
      "height": "2834",
      "width": "2101",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/IMG_4524.jpg"
    },
    "biography": "Paul’s been in the IT security industry for over a decade. More recently he’s helped organizations large and small to move their workloads securely to public cloud environments. Today, he's working with FireTail.io, a company whose mission is to help make APIs more secure by giving developers the tools necessary to design bulletproof APIs. He’s also a fan of sailing, gardening, and house music.",
    "website": null
  },
  "10897": {
    "name": "Leigh Capili",
    "title": "Staff Developer Advocate",
    "organization": "VMware",
    "photo": {
      "alt": null,
      "height": "612",
      "width": "612",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/profile-pic.png"
    },
    "biography": "Leigh is an empathetic speaker and developer with niches in cloud-native systems and security.\nHe has a background in building software to manage infrastructure.  Leigh contributes to Kubernetes and Flux and is frequently working on his next software demo. He also co-maintains Ignite, the microVM manager with Docker UX. ()\nLeigh works with the VMware Tanzu Advocacy team and previously built Developer Experience and Platform with Weaveworks, Beatport, AT&T, and DIRECTV.  Leigh and his wife enjoy snowboarding and have a 60lb dog named Pepsi.\n \n \n \n \n \n https://ignite.rtfd.io/",
    "website": {
      "name": "Github: stealthybox",
      "url": "https://github.com/stealthybox"
    }
  },
  "10900": {
    "name": "Vijay Samuel",
    "title": "Observability Architect",
    "organization": "eBay",
    "photo": {
      "alt": null,
      "height": "1268",
      "width": "1107",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/headshot_14.jpg"
    },
    "biography": "Vijay Samuel works with eBay's observability platform as its architect. During his time at eBay Vijay has transformed eBay's observability platform into a cloud native offering that is primarily built on top of open source technologies. He loves to code in Go and play video games.",
    "website": null
  },
  "10903": {
    "name": "Miguel Hernandez",
    "title": "Founder",
    "organization": "the OpenMindz Group",
    "photo": {
      "alt": null,
      "height": "483",
      "width": "483",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/migs-.jpg"
    },
    "biography": "Miguel Hernandez (@Techivist) is a serial do-good'er & community-builder.He's enjoyed coaching/mentoring kids, organizing tech meetups/conferences in various languages and contributing to various Open Source projects like Ubuntu, Drupal & Songbird. He's volunteered various times through the Los Angeles Public Library system where he taught adults to read, gave citizenship classes & created (then open source'ed) a curriculum for how to learn to use computers from zero, available in both English & Spanish.Miguel has been on the front lines of the battle for more diversity in tech & making tech accessible to all.\n \n \n \n \n \n \n \n \n \n \n In a previous life, he did Alzheimer's research & studied Gerontology at USC. \n    He's a recipient of the nation's highest honor for public service, the President's Volunteer Service Award.His favorite pasttimes are helping the elderly cross the street & rescuing puppies.",
    "website": {
      "name": "Techivist",
      "url": "http://techivist.org/about"
    }
  },
  "10908": {
    "name": "Timothy Kidd",
    "title": "Student",
    "organization": "Da Vinci Science High School",
    "photo": {
      "alt": null,
      "height": "3024",
      "width": "4032",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/IMG-8293.jpg"
    },
    "biography": "I'm a student who loves everything from Robotics, Quantum Computing, to making music. I'm an aspiring materials engineer.",
    "website": null
  },
  "10909": {
    "name": "Zoe Villanueva",
    "title": "Student",
    "organization": "El Camino College",
    "photo": null,
    "biography": null,
    "website": null
  },
  "10910": {
    "name": "Mikaela Boyon",
    "title": "Student ",
    "organization": "Port of Los Angeles High School",
    "photo": null,
    "biography": "Hello! I am a current junior at Port of Los Angeles High, just trying to explore different careers in tech. I play video games, sing, play a variety of sports, and love building.",
    "website": null
  },
  "10911": {
    "name": "Eddie Zaneski",
    "title": "Developer Advocate",
    "organization": "Chainguard",
    "photo": {
      "alt": null,
      "height": "1714",
      "width": "1714",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/new%20headshot%20crop%20darker.jpg"
    },
    "biography": "Eddie lives in Denver, CO with his wife and dog. He loves open source and works on the Kubernetes project. When not hacking on random things you'll most likely find him climbing rocks somewhere.",
    "website": {
      "name": "GitHub: eddiezane",
      "url": "https://github.com/eddiezane"
    }
  },
  "10915": {
    "name": "Kat Fitzgerald",
    "title": "Staff Security Engineer",
    "organization": "Google",
    "photo": {
      "alt": null,
      "height": "960",
      "width": "958",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/k_nerd.jpg"
    },
    "biography": "Based in Chicago and a natural creature of winter, you can typically find me sipping Grand Mayan Extra Anejo whilst simultaneously defending my systems using OSS, magic spells and Dancing Flamingos. Honeypots & Refrigerators are a few of my favorite things! Fun Fact: I rescue Feral Pop Tarts and have the only Pop Tart Sanctuary in the Chicago area.",
    "website": null
  },
  "10916": {
    "name": "Alex Lynd",
    "title": "Cybersecurity Content Creator ",
    "organization": "Hak5 ",
    "photo": {
      "alt": null,
      "height": "1080",
      "width": "1080",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Alex-Headshot.jpg"
    },
    "biography": "Alex Lynd is a 19 year old hardware developer and cybersecurity content creator who appears on shows like Hak5, where he creates ethical hacking tutorials & InfoSec related content. Alex researches / specializes in Signals Intelligence, and uses microcontrollers to showcase low-cost hacks.  He has a passion for sustainability, hardware hacking, and open-source; and he creates content across multiple platforms to document his journey & projects in hopes of inspiring other young makers.  Alex is also the creator of the Nugget, a cat-shaped hardware console designed to teach beginners about hacking, programming, and hardware! alexlynd.com",
    "website": {
      "name": "https://alexlynd.com",
      "url": "https://alexlynd.com"
    }
  },
  "10918": {
    "name": "Annabel Enriquez",
    "title": "Project Specialist",
    "organization": "Getty Conservation Institute",
    "photo": {
      "alt": null,
      "height": "793",
      "width": "793",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/ALE_square_headshot.jpg"
    },
    "biography": "Annabel Lee Enriquez is a Project Specialist at the Getty Conservation Institute, where she has specialized in cultural heritage documentation and technology projects since 2013. She manages data modeling and knowledge organization strategy for the Arches project, an open-source software platform for integrated cultural heritage data management. She also provides community training and guidance on Arches and data-related topics, and works directly with GCI partners to better facilitate their respective implementations of Arches for cultural heritage inventories. Annabel received a B.S. in Urban and Regional Studies from Cornell University, and an M.S. in Geographic Information Science and Technology from the University of Southern California with graduate studies in the Heritage Conservation program.",
    "website": {
      "name": "Arches Project Website",
      "url": "https://www.archesproject.org/"
    }
  },
  "10925": {
    "name": "Rob Gaston",
    "title": "Senior Developer",
    "organization": "Farallon Geographics, Inc.",
    "photo": {
      "alt": null,
      "height": "200",
      "width": "200",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/head-shot.jpg"
    },
    "biography": "Rob Gaston is a software developer presently working as at Farallon Geographics in San Francisco, CA. He's a team member on the Arches project, and sometimes he helps people learn web development skills by teaching classes, which he has done for General Assembly and BayGeo.",
    "website": {
      "name": "personal website",
      "url": "https://www.rgaston.com/"
    }
  },
  "10928": {
    "name": "Aeris Stewart",
    "title": "Community Manager",
    "organization": "Humanitec",
    "photo": null,
    "biography": "Aeris manages community outreach and engagement at Humanitec and PlatformEngineering.org. They also serve as a co-organizer for PlatformCon, the first ever conference by and for platform engineers, and is a content curator for Platform Weekly, a community-driven email newsletter about all topics platform engineering and cloud native.",
    "website": null
  },
  "10929": {
    "name": "Priyanka Ravi",
    "title": "Developer Experience Engineer",
    "organization": "Weaveworks",
    "photo": {
      "alt": null,
      "height": "1000",
      "width": "1000",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Priyanka%20Ravi%20%281%29.jpeg"
    },
    "biography": "Priyanka “Pinky” Ravi is a Developer Experience Engineer at Weaveworks. She has worked on a multitude of topics including front end development, UI automation for testing and API development. Previously she was a software developer at State Farm where she was on the delivery engineering team working on GitOps enablement. She was instrumental in the multi- tenancy migration to utilize Flux for an internal Kubernetes offering.",
    "website": null
  },
  "10936": {
    "name": "Chris Down",
    "title": "Kernel Engineer",
    "organization": "Meta",
    "photo": {
      "alt": null,
      "height": "512",
      "width": "512",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/headshot_15.jpg"
    },
    "biography": "Chris Down is an engineer on the Meta kernel team, primarily working on cgroups and overall memory management strategy. He is responsible for debugging and resolving major production issues and improving the reliability and efficiency of Meta's systems, and is also a maintainer of systemd.",
    "website": {
      "name": "chrisdown.name",
      "url": "https://chrisdown.name"
    }
  },
  "10941": {
    "name": "Glenn Hope",
    "title": null,
    "organization": null,
    "photo": {
      "alt": null,
      "height": "1200",
      "width": "1200",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/me-boat.jpeg"
    },
    "biography": "Glenn is on hiatus, reading and writing. He started his career working with supercomputers at the National Institute for Computational Sciences at Oak Ridge National Lab, then went to Facebook to join Site Reliability Operations, where he received a baptism by fire as the single-point-of-failure oncall for the entire company. Later, he wore many hats as a Production Engineer - first in FB's DevInfra org, working on everything from physical device testing for mobile phones to running Chef in containers at scale, and then at Instagram as the team lead for Signal Engineering, working to support the systems that allowed for hundreds of server diffs to be deployed independently and safely each day. His last two years have been spent on that much-needed hiatus, working on personal hobbies: helping port Rust to the Sony PSP, building a client-side search library for language acquisition, playing bass guitar, breathing new life into old tech, and learning to speak Taiwanese Hokkien.",
    "website": {
      "name": "Mosquito Capital Substack",
      "url": "https://mosquito.capital"
    }
  },
  "10942": {
    "name": "Matthew Croughan",
    "title": "Founder of Nix.How",
    "organization": "Nix.How LTD",
    "photo": {
      "alt": null,
      "height": "1264",
      "width": "1264",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/nixlabs-kino-cropped.jpg"
    },
    "biography": "Matt was once a Docker enthusiast, but was accidentally captivated by Nix and functional programming whilst working for an Embedded Linux company who were using Yocto + Docker for building and deploying software (tools which are exactly the opposite of functional and reproducible!). Since discovering Nix, Matt has quit his job and become a passionate NixOS contributor, evangelist and founder of Nix.How LTD, a Nix Software Consultancy that focuses on converting clients from legacy, unreproducible systems to Nix/NixOS. Every machine he owns and maintains is built using Nix, which includes his Android devices which are also built with Nix. He created ‘nixinate’, a Flake native deployment tool/library for NixOS. Matt is one of the founders of Nix.Camp, a small yearly event in North Wales for Nix enthusiasts.",
    "website": {
      "name": "Nix.How",
      "url": "https://nix.how"
    }
  },
  "10946": {
    "name": "Rizel Scarlett",
    "title": "Junior Developer Advocate",
    "organization": "GitHub",
    "photo": {
      "alt": null,
      "height": "406",
      "width": "406",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/1551287106903.jpeg"
    },
    "biography": "Rizel is a Junior Developer Advocate at GitHub. She moonlights as an advisor at G{Code} House, an organization aimed at teaching women of color and non-binary people of color to code. Rizel believes in leveraging vulnerability, honesty, and kindness as means to educate early-career developers.",
    "website": {
      "name": "Rizel's blog",
      "url": "http://blackgirlbytes.dev"
    }
  },
  "10949": {
    "name": "Camilla Berretta",
    "title": null,
    "organization": null,
    "photo": null,
    "biography": "Camilla is a classical musician turned software engineer based in Los Angeles. Born and raised in Perugia, Italy, in her previous career as a professional violist she performed with symphonies across the United States. During the pandemic, her curiosity for learning led her to explore programming. She just graduated from Ada Developers Academy, an 11-month highly selective fullstack bootcamp for women and non-binary people. Camilla is currently a CrowdStrike Cloud Engineering Intern, working with microservices, internal tooling, Kubernetes, Elasticsearch, and Go. Camilla enjoys solving problems, digging into technical details, and teaching others.",
    "website": null
  },
  "10971": {
    "name": "Paak Quansah",
    "title": "Software Engineer",
    "organization": "Pluto.TV",
    "photo": {
      "alt": null,
      "height": "4000",
      "width": "6000",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/IMG_0944%20%282%29.jpeg"
    },
    "biography": "Paak graduated from Syracuse University in 2018 with a Bachelor's Degree in Computer Science. He is currently a Software Engineer with Pluto TV working on the Platform Reliability Operations team and brings 5 years of experience building out large scale tools and services. Building out Pluto TV's internal observability suite has been an ongoing priority and Paak has made a significant contribution to this initiative using  a variety of tools and design patterns. Paak enjoys watching any Lakers game and in his free time playing basketball and practicing his golf swing.",
    "website": null
  },
  "10979": {
    "name": "Logan Garrison",
    "title": null,
    "organization": null,
    "photo": {
      "alt": null,
      "height": "834",
      "width": "848",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/logan2.jpg"
    },
    "biography": "Logan is in 5th grade and loves Minecraft, reading, and creating videos. He likes to build and explore new things and has been creating animations, stop motion, and live videos ever since he could use a camera.",
    "website": {
      "name": "YouTube",
      "url": "https://youtube.com/@cyber-craft"
    }
  },
  "10981": {
    "name": "Tomas Hruby",
    "title": "Staff Software Engineer",
    "organization": "Tigera",
    "photo": {
      "alt": null,
      "height": "677",
      "width": "677",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/avatar_3.jpg"
    },
    "biography": "Tomas is a Staff Software Engineer at Tigera, working as a founding developer of the Calico eBPF dataplane. Before joining Tigera in 2019, worked as an engineer in network storage and network observability domains. He worked as a researcher at Vrije Universiteit Amsterdam in Andy Tanenbaum's group and obtained PhD by defending thesis \"On the Design of Reliable and Scalable Networked Systems\".",
    "website": null
  },
  "10989": {
    "name": "ChanChan Mao",
    "title": "Community Evangelist",
    "organization": "Alluxio",
    "photo": {
      "alt": null,
      "height": "2049",
      "width": "1536",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/chanchan%20mao.JPG"
    },
    "biography": null,
    "website": null
  },
  "10992": {
    "name": "Arun Gupta",
    "title": "VP, Open Ecosystem Initiatives",
    "organization": "Intel",
    "photo": {
      "alt": null,
      "height": "1364",
      "width": "1500",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/arun.jpg"
    },
    "biography": "Arun Gupta is vice president and general manager of Open Ecosystem Initiatives at Intel Corporation. An open source strategist, advocate, and practitioner for nearly two decades, Arun has taken companies such as Apple, Amazon, and Sun Microsystems through systemic changes to embrace open source principles by contributing and collaborating effectively. \n    As an elected chair of the Cloud Native Computing Foundation (CNCF) Governing Board, Arun works with CNCF leadership and member companies to grow the cloud native ecosystem. He has delivered technical talks in over 45 countries, authored multiple books, and is a Docker Captain, Java Champion, and Java User Group leader. He also founded the Devoxx4Kids chapter in the U.S. and continues to promote technology education among children.\nArun holds two patents on using XML and XSL for an efficient generation of test reports. He is an avid runner and is easily accessible as @arungupta on Twitter.",
    "website": null
  },
  "10993": {
    "name": "Matt Turner",
    "title": "Software Engineer",
    "organization": "Tetrate",
    "photo": {
      "alt": null,
      "height": "3045",
      "width": "3167",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Image%20from%20iOS%20%285%29.jpg"
    },
    "biography": "Matt is a software engineer at Tetrate, working on Istio-related products, and loves sharing the latest tech and trends with everyone. He's been doing Dev, sometimes with added Ops, for over a decade. His idea of \"full-stack\" is Linux, Kubernetes, and now Istio too. He's given many talks and workshops on Kubernetes and Istio, and is co-organiser of the Service Mesh London meetup. He tweets @mt165 and blogs at \n \n https://mt165.co.uk",
    "website": {
      "name": "https://mt165.co.uk",
      "url": "https://mt165.co.uk"
    }
  },
  "10995": {
    "name": "Pierre-Louis Gingembre",
    "title": "Product Manager",
    "organization": "Google",
    "photo": null,
    "biography": "Technology and Product Leader with a strong experience in Networking, Security and Cloud-Native Applications. Currently focused on Container Security, Kubernetes, and Service Meshes.",
    "website": null
  },
  "10996": {
    "name": "Ken Thompson",
    "title": null,
    "organization": null,
    "photo": {
      "alt": null,
      "height": "2024",
      "width": "1619",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/faces.KenThompson20449.web_.jpg"
    },
    "biography": "Ken Thompson is an American pioneer of computer science.  Thompson worked at Bell Labs for most of his career where he designed and implemented the original Unix operating system. Later at Google, Thompson co-developed the Go programming language.",
    "website": null
  },
  "11001": {
    "name": "Borja Burgos",
    "title": "Director Product",
    "organization": "Datadog ",
    "photo": {
      "alt": null,
      "height": "2184",
      "width": "1688",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Screenshot%202023-02-02%20at%2010.33.04%20AM.jpg"
    },
    "biography": "Borja Burgos is a DevEx-obsessed entrepreneur and technologist. In 2013, he co-founded Tutum – a platform for developers to build and run their Docker applications. After Tutum's acquisition by Docker in 2015, Borja relentlessly continued working on new tools and services to delight developers, from their local desktops to their cloud environments. Disappointed with the complexity and lack of visibility in modern-day testing and continuous integration workflows, he left Docker to co-found Undefined Labs. Now as part of Datadog, he and his team are working to shift observability left into CI/CD by building the next generation of developer-centric observability tools!",
    "website": null
  },
  "11002": {
    "name": "Dr. Kitty Yeung",
    "title": "Incubation",
    "organization": "Microsoft",
    "photo": {
      "alt": null,
      "height": "1415",
      "width": "1000",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/KittyYeung_Caius1.jpg"
    },
    "biography": "Dr. Kitty Yeung is a physicist, engineer and artist, in addition to her role leading incubation projects at Microsoft. To drive integration between science and art, she also founded a sustainable and STEAM fashion brand, Art by Physicist, and founded the fashion-tech initiative at Microsoft. Prior, Kitty worked as a Senior Quantum Architect at Microsoft Quantum, Manager and Creative Technologist of the Bay Area Microsoft Garage Program; UX Designer at Intel Maker Group; Research Scientist and Hardware Engineer at Intel Silicon Photonics. She’s the producer of Microsoft’s quantum learning materials, including the MS Learn quantum modules and the Quantum Learning website; author of comic series Quantum Computing & Some Physics; lecturer at HackadayU and Microsoft Reactor on Quantum Computing. She received her Ph.D. in Applied Physics from Harvard University in 2015 (Thesis: Engineering Plasmonic Circuits in 2-Dimensional Electron Systems) and a M.Sci., B.A. and M.A. in Natural Sciences.",
    "website": {
      "name": "Personal website",
      "url": "https://artbyphysicistkittyyeung.com/"
    }
  },
  "11004": {
    "name": "Cedrick Lunven",
    "title": "Director of Developer Relation",
    "organization": "Datastax",
    "photo": {
      "alt": null,
      "height": "972",
      "width": "1142",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/c.png"
    },
    "biography": "Cedrick leads Developer Relations at Datastax. He is a passionate Java developer who keeps implementing applications to demo anything but also lately tools like CLI and SDKs. In 2013 he created the open-source feature toggle library called FF4J which he has been actively maintaining. He runs weekly technical live workshops on youtube. With almost 20 years in the industry as a tech leach, solution architect, or presales he can discuss a wide range of technologies and distributed architectures.",
    "website": {
      "name": "Devrel",
      "url": "https://awesome-sastra.github.io"
    }
  },
  "11007": {
    "name": "Paul Vecchio",
    "title": "Engineering Manager - Foundational Technology",
    "organization": "sweetgreen",
    "photo": {
      "alt": null,
      "height": "220",
      "width": "220",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/paul.jpeg"
    },
    "biography": null,
    "website": null
  },
  "11008": {
    "name": "Amit Jotwani",
    "title": null,
    "organization": "Retool",
    "photo": {
      "alt": null,
      "height": "400",
      "width": "400",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/amit.jpeg"
    },
    "biography": "Hello! I am Amit, a Senior Developer Advocate at Retool. Prior to joining Retool, I spent five years at Amazon, helping developers build voice skills for Alexa. By day you can find me cooking up Retool apps to solve my everyday problems. By night, when I am not doing dad duties or cooking up code, I like catching up on the reruns of Seinfeld. Self-proclaimed Lego, and Instant Pot recipe nerd.",
    "website": null
  },
  "11010": {
    "name": "Career Day",
    "title": null,
    "organization": "SCaLE",
    "photo": {
      "alt": null,
      "height": "110",
      "width": "220",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/RaiseMe_logo.png"
    },
    "biography": null,
    "website": null
  },
  "11011": {
    "name": "Nathan Loding",
    "title": "Developer Advocate",
    "organization": "Camunda",
    "photo": {
      "alt": null,
      "height": "2048",
      "width": "2048",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/reverent_geek-profile-balloon.jpg"
    },
    "biography": "I'm a nerd, and proud of it! I love solving problems and technology is the best way to do that. I work professionally as a Developer Advocate for Camunda. On the side I'm a husband, father, collector of hobbies, gardener, and outdoorsman (hiking, camping, canoeing/kayaking). I enjoy working analog, with my hands, whenever possible. I hate chores and cleaning up after myself.",
    "website": null
  },
  "11012": {
    "name": "Devrim Gunduz",
    "title": "Postgres Expert",
    "organization": "EDB",
    "photo": {
      "alt": null,
      "height": "123",
      "width": "128",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/devrim-avatar-014-small-128.123.jpg"
    },
    "biography": "I’started using Linux in 1996, and PostgreSQL in 1998. Love to travel, listen to music, and enjoy life with friends. Joined PostgreSQL community around 1999. Currently maintaining PostgreSQL official RPM repository at  and  . Contributed to many PostgreSQL related projects. Already a Fedora and EPEL contributor as well.\n \n \n https://yum.postgresql.org https://zypp.postgresql.org Working at EDB as Postgres Expert in CTO team.",
    "website": null
  },
  "11014": {
    "name": "Nisha Riyaj",
    "title": "MySQL Principal Solution Engineer",
    "organization": "Oracle",
    "photo": {
      "alt": null,
      "height": "2433",
      "width": "1433",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/20230216_094904%20%284%29.jpg"
    },
    "biography": "Been working with Oracle/MySQL for many years as DBA. Have done DR setup with MySQL InnoDB Cluster and Source-Target replication. Have presented in many Quest Oracle Community user group conferences.",
    "website": null
  },
  "11015": {
    "name": "James Kunstle",
    "title": "Software Engineer",
    "organization": "Red Hat",
    "photo": {
      "alt": null,
      "height": "1920",
      "width": "1440",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/69420549107__87574136-C23B-41BF-BDB0-325DED3C2D0E_0.JPG"
    },
    "biography": "James Kunstle is a software engineer in Red Hat's Open Source Program Office. James finished his graduate work at BU in AI, having finished collaborative research with Red Hat in the adversarial machine learning space. He works on the oss-aspen project and oss-aspen/8Knot, and is based in Boston.",
    "website": null
  },
  "11018": {
    "name": "Vino Duraisamy",
    "title": "Developer advocate ",
    "organization": "lakeFS",
    "photo": {
      "alt": null,
      "height": "800",
      "width": "800",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/vinodhini.jpeg"
    },
    "biography": "Vino is a developer advocate at lakeFS, an open-source platform that delivers git-like experience to object store based data lakes. she started as a software engineer at NetApp, and worked on data management applications for NetApp data centers when on-prem data centers were still a cool thing. She then hopped onto cloud and big data world and landed at the data teams of Nike and Apple. There she worked mainly on batch processing workloads as a data engineer, built custom NLP models as an ML engineer and even touched upon MLOps a bit for model deployments. Vino enjoys sharing her learnings and industry best practices through blogs, video tutorials and tech talks. An avid public speaker and an ardent toastmaster, she has presented in different data conferences and meetups. When she is not wrestling with data (yes, wrestling), you can find her doing yoga or strolling the golden gate park and ocean beach.",
    "website": {
      "name": "linkedin",
      "url": "https://www.linkedin.com/in/vinodhini-sd/"
    }
  },
  "11019": {
    "name": "Christina Webber",
    "title": null,
    "organization": null,
    "photo": null,
    "biography": null,
    "website": null
  },
  "11024": {
    "name": "Jacob Payne",
    "title": "Sr. Software Engineer",
    "organization": "Spectrocloud",
    "photo": {
      "alt": null,
      "height": "962",
      "width": "722",
      "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/profile%20picture.jpg"
    },
    "biography": null,
    "website": null
  }
}